lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
/*******************************************************************************
* Copyright (C) 2013-2016, Cypress Semiconductor Corporation or a              *
* subsidiary of Cypress Semiconductor Corporation.  All rights reserved.       *
*                                                                              *
* This software, including source code, documentation and related              *
* materials ("Software"), is owned by Cypress Semiconductor Corporation or     *
* one of its subsidiaries ("Cypress") and is protected by and subject to       *
* worldwide patent protection (United States and foreign), United States       *
* copyright laws and international treaty provisions. Therefore, you may use   *
* this Software only as provided in the license agreement accompanying the     *
* software package from which you obtained this Software ("EULA").             *
*                                                                              *
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,     *
* non-transferable license to copy, modify, and compile the                    *
* Software source code solely for use in connection with Cypress's             *
* integrated circuit products.  Any reproduction, modification, translation,   *
* compilation, or representation of this Software except as specified          *
* above is prohibited without the express written permission of Cypress.       *
*                                                                              *
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO                         *
* WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING,                         *
* BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED                                 *
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A                              *
* PARTICULAR PURPOSE. Cypress reserves the right to make                       *
* changes to the Software without notice. Cypress does not assume any          *
* liability arising out of the application or use of the Software or any       *
* product or circuit described in the Software. Cypress does not               *
* authorize its products for use in any products where a malfunction or        *
* failure of the Cypress product may reasonably be expected to result in       *
* significant property damage, injury or death ("High Risk Product"). By       *
* including Cypress's product in a High Risk Product, the manufacturer         *
* of such system or application assumes all risk of such use and in doing      *
* so agrees to indemnify Cypress against all liability.                        *
*******************************************************************************/
/**
 ******************************************************************************
 ** \file   mb9af31xk.h
 **
 ** MCU Headerfile
 **
 ** History:
 
 **
 ******************************************************************************/

#ifndef _MB9AF31XK_H_
#define _MB9AF31XK_H_
#define __MB9AF31XK_H__
#define __MB9A310K_H__

#if defined __cplusplus
extern "C" {
#endif

#define FM_GENERAL_MCUHEADER_VERSION              0201


#ifndef FM_DEVICE_PACKAGE_MB_K
#define FM_DEVICE_PACKAGE_MB_K
#endif 

/******************************************************************************
 ** Configuration of the Cortex-M4 Processor and Core Peripherals
 ** 
 ******************************************************************************/
#define FM3_DEVICE_TYPE                           5
#define FM_DEVICE_TYPE                            3005u
#define FM_CORE_TYPE_FM3                          1
#define __CM3_REV                                 0x0201
#define __MPU_PRESENT                             1
#define __NVIC_PRIO_BITS                          4
#define __Vendor_SysTickConfig                    0
#define __FPU_PRESENT                             0
#define __FPU_DP                                  0
#define __ICACHE_PRESENT                          0
#define __DCACHE_PRESENT                          0
#define __DTCM_PRESENT                            0

/******************************************************************************
 ** Peripheral Types
 ** 
 ******************************************************************************/
#define FM3_ADC_TYPE_A                            1
#define FM3_BT_TYPE_A                             1
#define FM3_BTIOSEL03_TYPE_A                      1
#define FM3_BTIOSEL47_TYPE_A                      1
#define FM3_CRC_TYPE_A                            1
#define FM3_CRG_TYPE_A                            1
#define FM3_CRTRIM_TYPE_A                         1
#define FM3_DMAC_TYPE_A                           1
#define FM3_DS_TYPE_A                             1
#define FM3_DT_TYPE_A                             1
#define FM3_EXTI_TYPE_A                           1
#define FM3_FLASH_IF_TYPE_A                       1
#define FM3_GPIO_TYPE_A                           1
#define FM3_HWWDT_TYPE_A                          1
#define FM3_INTREQ_TYPE_A                         1
#define FM3_LVD_TYPE_A                            1
#define FM3_MFS_TYPE_A                            1
#define FM3_MFS_NFC_TYPE_A                        1
#define FM3_MFT_TYPE_A                            1
#define FM3_MFT_PPG_TYPE_A                        1
#define FM3_QPRC_TYPE_A                           1
#define FM3_RTC_TYPE_A                            1
#define FM3_SBSSR_TYPE_A                          1
#define FM3_SWWDT_TYPE_A                          1
#define FM3_UNIQUE_ID_TYPE_A                      1
#define FM3_USB_TYPE_A                            1
#define FM3_USBCLK_TYPE_A                         1
#define FM3_WC_TYPE_A                             1
#define FM3_WORKFLASH_IF_TYPE_A                   1

/******************************************************************************
 ** Available Peripherals
 ** 
 ******************************************************************************/
#define FM3_ADC_AVAILABLE                         1
#define FM_ADC_AVAILABLE                          1
#define FM3_BT_AVAILABLE                          1
#define FM_BT_AVAILABLE                           1
#define FM3_BT_PPG_AVAILABLE                      1
#define FM_BT_PPG_AVAILABLE                       1
#define FM3_BT_PWC_AVAILABLE                      1
#define FM_BT_PWC_AVAILABLE                       1
#define FM3_BT_PWM_AVAILABLE                      1
#define FM_BT_PWM_AVAILABLE                       1
#define FM3_BT_RT_AVAILABLE                       1
#define FM_BT_RT_AVAILABLE                        1
#define FM3_BTIOSEL03_AVAILABLE                   1
#define FM_BTIOSEL03_AVAILABLE                    1
#define FM3_BTIOSEL47_AVAILABLE                   1
#define FM_BTIOSEL47_AVAILABLE                    1
#define FM3_CRC_AVAILABLE                         1
#define FM_CRC_AVAILABLE                          1
#define FM3_CRG_AVAILABLE                         1
#define FM_CRG_AVAILABLE                          1
#define FM3_CRTRIM_AVAILABLE                      1
#define FM_CRTRIM_AVAILABLE                       1
#define FM3_DMAC_AVAILABLE                        1
#define FM_DMAC_AVAILABLE                         1
#define FM3_DS_AVAILABLE                          1
#define FM_DS_AVAILABLE                           1
#define FM3_DT_AVAILABLE                          1
#define FM_DT_AVAILABLE                           1
#define FM3_EXTI_AVAILABLE                        1
#define FM_EXTI_AVAILABLE                         1
#define FM3_FLASH_IF_AVAILABLE                    1
#define FM_FLASH_IF_AVAILABLE                     1
#define FM3_GPIO_AVAILABLE                        1
#define FM_GPIO_AVAILABLE                         1
#define FM3_HWWDT_AVAILABLE                       1
#define FM_HWWDT_AVAILABLE                        1
#define FM3_INTREQ_AVAILABLE                      1
#define FM_INTREQ_AVAILABLE                       1
#define FM3_LVD_AVAILABLE                         1
#define FM_LVD_AVAILABLE                          1
#define FM3_MFS_AVAILABLE                         1
#define FM_MFS_AVAILABLE                          1
#define FM3_MFS_CSIO_AVAILABLE                    1
#define FM_MFS_CSIO_AVAILABLE                     1
#define FM3_MFS_I2C_AVAILABLE                     1
#define FM_MFS_I2C_AVAILABLE                      1
#define FM3_MFS_LIN_AVAILABLE                     1
#define FM_MFS_LIN_AVAILABLE                      1
#define FM3_MFS_NFC_AVAILABLE                     1
#define FM_MFS_NFC_AVAILABLE                      1
#define FM3_MFS_UART_AVAILABLE                    1
#define FM_MFS_UART_AVAILABLE                     1
#define FM3_MFT_AVAILABLE                         1
#define FM_MFT_AVAILABLE                          1
#define FM3_MFT_ADCMP_AVAILABLE                   1
#define FM_MFT_ADCMP_AVAILABLE                    1
#define FM3_MFT_FRT_AVAILABLE                     1
#define FM_MFT_FRT_AVAILABLE                      1
#define FM3_MFT_ICU_AVAILABLE                     1
#define FM_MFT_ICU_AVAILABLE                      1
#define FM3_MFT_OCU_AVAILABLE                     1
#define FM_MFT_OCU_AVAILABLE                      1
#define FM3_MFT_PPG_AVAILABLE                     1
#define FM_MFT_PPG_AVAILABLE                      1
#define FM3_MFT_WFG_AVAILABLE                     1
#define FM_MFT_WFG_AVAILABLE                      1
#define FM3_QPRC_AVAILABLE                        1
#define FM_QPRC_AVAILABLE                         1
#define FM3_RTC_AVAILABLE                         1
#define FM_RTC_AVAILABLE                          1
#define FM3_SBSSR_AVAILABLE                       1
#define FM_SBSSR_AVAILABLE                        1
#define FM3_SWWDT_AVAILABLE                       1
#define FM_SWWDT_AVAILABLE                        1
#define FM3_UNIQUE_ID_AVAILABLE                   1
#define FM_UNIQUE_ID_AVAILABLE                    1
#define FM3_USB_AVAILABLE                         1
#define FM_USB_AVAILABLE                          1
#define FM3_USBCLK_AVAILABLE                      1
#define FM_USBCLK_AVAILABLE                       1
#define FM3_WC_AVAILABLE                          1
#define FM_WC_AVAILABLE                           1
#define FM3_WORKFLASH_IF_AVAILABLE                1
#define FM_WORKFLASH_IF_AVAILABLE                 1

