lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
/******************************************************************************
 ** \brief Interrupt number definition for all type MCUs
 ** 
 ******************************************************************************/
#define FM_INTERRUPT_TYPE                         0x300Au

#define IRQ_NMI_AVAILABLE                         1
#define IRQ_HARDFAULT_AVAILABLE                   1
#define IRQ_MEMMANAGE_AVAILABLE                   1
#define IRQ_BUSFAULT_AVAILABLE                    1
#define IRQ_USAGEFAULT_AVAILABLE                  1
#define IRQ_SVC_AVAILABLE                         1
#define IRQ_DEBUGMONITOR_AVAILABLE                1
#define IRQ_PENDSV_AVAILABLE                      1
#define IRQ_SYSTICK_AVAILABLE                     1

#define IRQ_CSV_AVAILABLE                         1
#define IRQ_SWDT_AVAILABLE                        1
#define IRQ_LVD_AVAILABLE                         1
#define IRQ_MFT0_2_WFG_DTIF_AVAILABLE             1
#define IRQ_EXINT0_7_AVAILABLE                    1
#define IRQ_EXINT8_31_AVAILABLE                   1
#define IRQ_DT_QPRC0_2_AVAILABLE                  1
#define IRQ_MFS0_RX_AVAILABLE                     1
#define IRQ_MFS0_TX_AVAILABLE                     1
#define IRQ_MFS1_RX_AVAILABLE                     1
#define IRQ_MFS1_TX_AVAILABLE                     1
#define IRQ_MFS3_RX_AVAILABLE                     1
#define IRQ_MFS3_TX_AVAILABLE                     1
#define IRQ_MFS5_RX_AVAILABLE                     1
#define IRQ_MFS5_TX_AVAILABLE                     1
#define IRQ_PPG00_02_04_08_10_12_16_18_20_AVAILABLE 1
#define IRQ_TIM_WC_RTC_AVAILABLE                  1
#define IRQ_ADC0_AVAILABLE                        1
#define IRQ_ADC1_AVAILABLE                        1
#define IRQ_MFT0_2_FRT_AVAILABLE                  1
#define IRQ_MFT0_2_ICU_AVAILABLE                  1
#define IRQ_MFT0_2_OCU_AVAILABLE                  1
#define IRQ_BT0_7_AVAILABLE                       1
#define IRQ_USB0_F_AVAILABLE                      1
#define IRQ_USB0_H_F_AVAILABLE                    1
#define IRQ_DMAC0_AVAILABLE                       1
#define IRQ_DMAC1_AVAILABLE                       1
#define IRQ_DMAC2_AVAILABLE                       1
#define IRQ_DMAC3_AVAILABLE                       1
#define IRQ_DMAC4_AVAILABLE                       1
#define IRQ_DMAC5_AVAILABLE                       1
#define IRQ_DMAC6_AVAILABLE                       1
#define IRQ_DMAC7_AVAILABLE                       1
#define IRQ_FLASHIF_AVAILABLE                     1


typedef enum IRQn
{
    NMI_IRQn                                      =  -14, /* Non Maskable Interrupt NMI */
    HardFault_IRQn                                =  -13, /* HardFault HardFault */
    MemManage_IRQn                                =  -12, /* Memory Management MemManage */
    BusFault_IRQn                                 =  -11, /* Bus Fault BusFault */
    UsageFault_IRQn                               =  -10, /* Usage Fault UsageFault */
    SVC_IRQn                                      =   -5, /* SV Call SVC */
    DebugMonitor_IRQn                             =   -4, /* Debug Monitor DebugMonitor */
    PendSV_IRQn                                   =   -2, /* Pend SV PendSV */
    SysTick_IRQn                                  =   -1, /* System Tick SysTick */

    CSV_IRQn                                      =    0, /* CSV_IRQ */
    SWDT_IRQn                                     =    1, /* SWDT_IRQ */
    LVD_IRQn                                      =    2, /* LVD_IRQ */
    MFT0_2_WFG_DTIF_IRQn                          =    3, /* MFT0_2_WFG_DTIF_IRQ */
    EXINT0_7_IRQn                                 =    4, /* EXINT0_7_IRQ */
    EXINT8_31_IRQn                                =    5, /* EXINT8_31_IRQ */
    DT_QPRC0_2_IRQn                               =    6, /* DT_QPRC0_2_IRQ */
    MFS0_RX_IRQn                                  =    7, /* MFS0_RX_IRQ */
    MFS0_TX_IRQn                                  =    8, /* MFS0_TX_IRQ */
    MFS1_RX_IRQn                                  =    9, /* MFS1_RX_IRQ */
    MFS1_TX_IRQn                                  =   10, /* MFS1_TX_IRQ */
    MFS3_RX_IRQn                                  =   13, /* MFS3_RX_IRQ */
    MFS3_TX_IRQn                                  =   14, /* MFS3_TX_IRQ */
    MFS5_RX_IRQn                                  =   17, /* MFS5_RX_IRQ */
    MFS5_TX_IRQn                                  =   18, /* MFS5_TX_IRQ */
    PPG00_02_04_08_10_12_16_18_20_IRQn            =   23, /* PPG00_02_04_08_10_12_16_18_20_IRQ */
    TIM_WC_RTC_IRQn                               =   24, /* TIM_WC_RTC_IRQ */
    ADC0_IRQn                                     =   25, /* ADC0_IRQ */
    ADC1_IRQn                                     =   26, /* ADC1_IRQ */
    MFT0_2_FRT_IRQn                               =   28, /* MFT0_2_FRT_IRQ */
    MFT0_2_ICU_IRQn                               =   29, /* MFT0_2_ICU_IRQ */
    MFT0_2_OCU_IRQn                               =   30, /* MFT0_2_OCU_IRQ */
    BT0_7_IRQn                                    =   31, /* BT0_7_IRQ */
    USB0_F_IRQn                                   =   34, /* USB0_F_IRQ */
    USB0_H_F_IRQn                                 =   35, /* USB0_H_F_IRQ */
    DMAC0_IRQn                                    =   38, /* DMAC0_IRQ */
    DMAC1_IRQn                                    =   39, /* DMAC1_IRQ */
    DMAC2_IRQn                                    =   40, /* DMAC2_IRQ */
    DMAC3_IRQn                                    =   41, /* DMAC3_IRQ */
    DMAC4_IRQn                                    =   42, /* DMAC4_IRQ */
    DMAC5_IRQn                                    =   43, /* DMAC5_IRQ */
    DMAC6_IRQn                                    =   44, /* DMAC6_IRQ */
    DMAC7_IRQn                                    =   45, /* DMAC7_IRQ */
    FLASHIF_IRQn                                  =   47, /* FLASHIF_IRQ */
} IRQn_Type;

#include "core_cm3.h"
#include "system_mb9a310k.h"
#include <stdint.h>

/******************************************************************************
 ** Device Specific Peripheral Registers structures
 ** 
 ******************************************************************************/
#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

