lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
typedef struct stc_gpio_pzr4_field
{
        __IO  uint32_t  RESERVED0                :6;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  RESERVED1                :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  RESERVED2                :21;
} stc_gpio_pzr4_field_t;

typedef struct stc_gpio_pzr5_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_gpio_pzr5_field_t;

typedef struct stc_gpio_pzr6_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_gpio_pzr6_field_t;

typedef struct stc_gpio_pzr8_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_gpio_pzr8_field_t;

typedef struct stc_gpio_pzre_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  RESERVED0                :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED1                :28;
} stc_gpio_pzre_field_t;

/******************************************************************************
 ** HWWDT_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_hwwdt_wdg_ctl_field
{
        __IO  uint32_t  INTEN                    :1;
        __IO  uint32_t  RESEN                    :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_hwwdt_wdg_ctl_field_t;

typedef struct stc_hwwdt_wdg_ris_field
{
        __IO  uint32_t  RIS                      :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_hwwdt_wdg_ris_field_t;

/******************************************************************************
 ** INTREQ_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_intreq_drqsel_field
{
        __IO  uint32_t  USBEP1                   :1;
        __IO  uint32_t  USBEP2                   :1;
        __IO  uint32_t  USBEP3                   :1;
        __IO  uint32_t  USBEP4                   :1;
        __IO  uint32_t  USBEP5                   :1;
        __IO  uint32_t  ADCSCAN0                 :1;
        __IO  uint32_t  ADCSCAN1                 :1;
        __IO  uint32_t  ADCSCAN2                 :1;
        __IO  uint32_t  IRQ0BT0                  :1;
        __IO  uint32_t  IRQ0BT2                  :1;
        __IO  uint32_t  IRQ0BT4                  :1;
        __IO  uint32_t  IRQ0BT6                  :1;
        __IO  uint32_t  MFS0RX                   :1;
        __IO  uint32_t  MFS0TX                   :1;
        __IO  uint32_t  MFS1RX                   :1;
        __IO  uint32_t  MFS1TX                   :1;
        __IO  uint32_t  MFS2RX                   :1;
        __IO  uint32_t  MFS2TX                   :1;
        __IO  uint32_t  MFS3RX                   :1;
        __IO  uint32_t  MFS3TX                   :1;
        __IO  uint32_t  MFS4RX                   :1;
        __IO  uint32_t  MFS4TX                   :1;
        __IO  uint32_t  MFS5RX                   :1;
        __IO  uint32_t  MFS5TX                   :1;
        __IO  uint32_t  MFS6RX                   :1;
        __IO  uint32_t  MFS6TX                   :1;
        __IO  uint32_t  MFS7RX                   :1;
        __IO  uint32_t  MFS7TX                   :1;
        __IO  uint32_t  EXINT0                   :1;
        __IO  uint32_t  EXINT1                   :1;
        __IO  uint32_t  EXINT2                   :1;
        __IO  uint32_t  EXINT3                   :1;
} stc_intreq_drqsel_field_t;

typedef struct stc_intreq_oddpks_field
{
        __IO   uint8_t  ODDPKS0                  :1;
        __IO   uint8_t  ODDPKS1                  :1;
        __IO   uint8_t  ODDPKS2                  :1;
        __IO   uint8_t  ODDPKS3                  :1;
        __IO   uint8_t  ODDPKS4                  :1;
        __IO   uint8_t  RESERVED0                :3;
} stc_intreq_oddpks_field_t;

typedef struct stc_intreq_irqcmode_field
{
        __IO  uint32_t  IRQCMODE                 :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irqcmode_field_t;

typedef struct stc_intreq_exc02mon_field
{
        __IO  uint32_t  NMI                      :1;
        __IO  uint32_t  HWINT                    :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_intreq_exc02mon_field_t;

typedef struct stc_intreq_irq00mon_field
{
        __IO  uint32_t  FCSINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq00mon_field_t;

typedef struct stc_intreq_irq01mon_field
{
        __IO  uint32_t  SWWDTINT                 :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq01mon_field_t;

typedef struct stc_intreq_irq02mon_field
{
        __IO  uint32_t  LVDINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq02mon_field_t;

typedef struct stc_intreq_irq03mon_field
{
    union {
        struct {
            __IO  uint32_t  WAVE0INT             :4;
            __IO  uint32_t  WAVE1INT             :4;
            __IO  uint32_t  WAVE2INT             :4;
            __IO  uint32_t  RESERVED0            :20;
        };
        struct {
            __IO  uint32_t  WAVE0INT0            :1;
            __IO  uint32_t  WAVE0INT1            :1;
            __IO  uint32_t  WAVE0INT2            :1;
            __IO  uint32_t  WAVE0INT3            :1;
            __IO  uint32_t  WAVE1INT0            :1;
            __IO  uint32_t  WAVE1INT1            :1;
            __IO  uint32_t  WAVE1INT2            :1;
            __IO  uint32_t  WAVE1INT3            :1;
            __IO  uint32_t  WAVE2INT0            :1;
            __IO  uint32_t  WAVE2INT1            :1;
            __IO  uint32_t  WAVE2INT2            :1;
            __IO  uint32_t  WAVE2INT3            :1;
            __IO  uint32_t  RESERVED1            :20;
        };
    };
} stc_intreq_irq03mon_field_t;

typedef struct stc_intreq_irq04mon_field
{
        __IO  uint32_t  EXTINT0                  :1;
        __IO  uint32_t  EXTINT1                  :1;
        __IO  uint32_t  EXTINT2                  :1;
        __IO  uint32_t  EXTINT3                  :1;
        __IO  uint32_t  EXTINT4                  :1;
        __IO  uint32_t  EXTINT5                  :1;
        __IO  uint32_t  EXTINT6                  :1;
        __IO  uint32_t  EXTINT7                  :1;
        __IO  uint32_t  RESERVED0                :24;
} stc_intreq_irq04mon_field_t;

typedef struct stc_intreq_irq05mon_field
{
        __IO  uint32_t  EXTINT8                  :1;
        __IO  uint32_t  EXTINT9                  :1;
        __IO  uint32_t  EXTINT10                 :1;
        __IO  uint32_t  EXTINT11                 :1;
        __IO  uint32_t  EXTINT12                 :1;
        __IO  uint32_t  EXTINT13                 :1;
        __IO  uint32_t  EXTINT14                 :1;
        __IO  uint32_t  EXTINT15                 :1;
        __IO  uint32_t  EXTINT16                 :1;
        __IO  uint32_t  EXTINT17                 :1;
        __IO  uint32_t  EXTINT18                 :1;
        __IO  uint32_t  EXTINT19                 :1;
        __IO  uint32_t  EXTINT20                 :1;
        __IO  uint32_t  EXTINT21                 :1;
        __IO  uint32_t  EXTINT22                 :1;
        __IO  uint32_t  EXTINT23                 :1;
        __IO  uint32_t  EXTINT24                 :1;
        __IO  uint32_t  EXTINT25                 :1;
        __IO  uint32_t  EXTINT26                 :1;
        __IO  uint32_t  EXTINT27                 :1;
        __IO  uint32_t  EXTINT28                 :1;
        __IO  uint32_t  EXTINT29                 :1;
        __IO  uint32_t  EXTINT30                 :1;
        __IO  uint32_t  EXTINT31                 :1;
        __IO  uint32_t  RESERVED0                :8;
} stc_intreq_irq05mon_field_t;

