lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
typedef struct stc_intreq_irq31mon_field
{
        __IO  uint32_t  BTINT0                   :1;
        __IO  uint32_t  BTINT1                   :1;
        __IO  uint32_t  BTINT2                   :1;
        __IO  uint32_t  BTINT3                   :1;
        __IO  uint32_t  BTINT4                   :1;
        __IO  uint32_t  BTINT5                   :1;
        __IO  uint32_t  BTINT6                   :1;
        __IO  uint32_t  BTINT7                   :1;
        __IO  uint32_t  BTINT8                   :1;
        __IO  uint32_t  BTINT9                   :1;
        __IO  uint32_t  BTINT10                  :1;
        __IO  uint32_t  BTINT11                  :1;
        __IO  uint32_t  BTINT12                  :1;
        __IO  uint32_t  BTINT13                  :1;
        __IO  uint32_t  BTINT14                  :1;
        __IO  uint32_t  BTINT15                  :1;
        __IO  uint32_t  RESERVED0                :16;
} stc_intreq_irq31mon_field_t;

typedef struct stc_intreq_irq32mon_field
{
        __IO  uint32_t  CAN0INT                  :1;
        __IO  uint32_t  MAC0SBD                  :1;
        __IO  uint32_t  MAC0PMI                  :1;
        __IO  uint32_t  MAC0LPI                  :1;
        __IO  uint32_t  RESERVED0                :28;
} stc_intreq_irq32mon_field_t;

typedef struct stc_intreq_irq33mon_field
{
        __IO  uint32_t  CAN1INT                  :1;
        __IO  uint32_t  MAC1SBD                  :1;
        __IO  uint32_t  MAC1PMI                  :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq33mon_field_t;

typedef struct stc_intreq_irq34mon_field
{
        __IO  uint32_t  USB0INT0                 :1;
        __IO  uint32_t  USB0INT1                 :1;
        __IO  uint32_t  USB0INT2                 :1;
        __IO  uint32_t  USB0INT3                 :1;
        __IO  uint32_t  USB0INT4                 :1;
        __IO  uint32_t  RESERVED0                :27;
} stc_intreq_irq34mon_field_t;

typedef struct stc_intreq_irq35mon_field
{
        __IO  uint32_t  USB0INT0                 :1;
        __IO  uint32_t  USB0INT1                 :1;
        __IO  uint32_t  USB0INT2                 :1;
        __IO  uint32_t  USB0INT3                 :1;
        __IO  uint32_t  USB0INT4                 :1;
        __IO  uint32_t  USB0INT5                 :1;
        __IO  uint32_t  RESERVED0                :26;
} stc_intreq_irq35mon_field_t;

typedef struct stc_intreq_irq36mon_field
{
        __IO  uint32_t  USB1INT0                 :1;
        __IO  uint32_t  USB1INT1                 :1;
        __IO  uint32_t  USB1INT2                 :1;
        __IO  uint32_t  USB1INT3                 :1;
        __IO  uint32_t  USB1INT4                 :1;
        __IO  uint32_t  RCEC0INT                 :1;
        __IO  uint32_t  RESERVED0                :26;
} stc_intreq_irq36mon_field_t;

typedef struct stc_intreq_irq37mon_field
{
        __IO  uint32_t  USB1INT0                 :1;
        __IO  uint32_t  USB1INT1                 :1;
        __IO  uint32_t  USB1INT2                 :1;
        __IO  uint32_t  USB1INT3                 :1;
        __IO  uint32_t  USB1INT4                 :1;
        __IO  uint32_t  USB1INT5                 :1;
        __IO  uint32_t  RCEC1INT                 :1;
        __IO  uint32_t  RESERVED0                :25;
} stc_intreq_irq37mon_field_t;

typedef struct stc_intreq_irq38mon_field
{
        __IO  uint32_t  DMAINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq38mon_field_t;

typedef struct stc_intreq_irq39mon_field
{
        __IO  uint32_t  DMAINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq39mon_field_t;

typedef struct stc_intreq_irq40mon_field
{
        __IO  uint32_t  DMAINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq40mon_field_t;

typedef struct stc_intreq_irq41mon_field
{
        __IO  uint32_t  DMAINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq41mon_field_t;

typedef struct stc_intreq_irq42mon_field
{
        __IO  uint32_t  DMAINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq42mon_field_t;

typedef struct stc_intreq_irq43mon_field
{
        __IO  uint32_t  DMAINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq43mon_field_t;

typedef struct stc_intreq_irq44mon_field
{
        __IO  uint32_t  DMAINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq44mon_field_t;

typedef struct stc_intreq_irq45mon_field
{
        __IO  uint32_t  DMAINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq45mon_field_t;

typedef struct stc_intreq_irq46mon_field
{
        __IO  uint32_t  BTINT0                   :1;
        __IO  uint32_t  BTINT1                   :1;
        __IO  uint32_t  BTINT2                   :1;
        __IO  uint32_t  BTINT3                   :1;
        __IO  uint32_t  BTINT4                   :1;
        __IO  uint32_t  BTINT5                   :1;
        __IO  uint32_t  BTINT6                   :1;
        __IO  uint32_t  BTINT7                   :1;
        __IO  uint32_t  BTINT8                   :1;
        __IO  uint32_t  BTINT9                   :1;
        __IO  uint32_t  BTINT10                  :1;
        __IO  uint32_t  BTINT11                  :1;
        __IO  uint32_t  BTINT12                  :1;
        __IO  uint32_t  BTINT13                  :1;
        __IO  uint32_t  BTINT14                  :1;
        __IO  uint32_t  BTINT15                  :1;
        __IO  uint32_t  RESERVED0                :16;
} stc_intreq_irq46mon_field_t;

typedef struct stc_intreq_irq47mon_field
{
        __IO  uint32_t  RESERVED0                :11;
        __IO  uint32_t  FLASHINT                 :1;
        __IO  uint32_t  RESERVED1                :20;
} stc_intreq_irq47mon_field_t;

