lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
typedef struct stc_intreq_drqsel1_field
{
        __IO  uint32_t  USB1EP1                  :1;
        __IO  uint32_t  USB1EP2                  :1;
        __IO  uint32_t  USB1EP3                  :1;
        __IO  uint32_t  USB1EP4                  :1;
        __IO  uint32_t  USB1EP5                  :1;
        __IO  uint32_t  RESERVED0                :27;
} stc_intreq_drqsel1_field_t;

typedef struct stc_intreq_dqesel_field
{
    union {
        struct {
            __IO  uint32_t  ESEL10               :4;
            __IO  uint32_t  ESEL11               :4;
            __IO  uint32_t  ESEL24               :4;
            __IO  uint32_t  ESEL25               :4;
            __IO  uint32_t  ESEL26               :4;
            __IO  uint32_t  ESEL27               :4;
            __IO  uint32_t  ESEL30               :4;
            __IO  uint32_t  ESEL31               :4;
        };
        struct {
            __IO  uint32_t  ESEL100              :1;
            __IO  uint32_t  ESEL101              :1;
            __IO  uint32_t  ESEL102              :1;
            __IO  uint32_t  ESEL103              :1;
            __IO  uint32_t  ESEL110              :1;
            __IO  uint32_t  ESEL111              :1;
            __IO  uint32_t  ESEL112              :1;
            __IO  uint32_t  ESEL113              :1;
            __IO  uint32_t  ESEL240              :1;
            __IO  uint32_t  ESEL241              :1;
            __IO  uint32_t  ESEL242              :1;
            __IO  uint32_t  ESEL243              :1;
            __IO  uint32_t  ESEL250              :1;
            __IO  uint32_t  ESEL251              :1;
            __IO  uint32_t  ESEL252              :1;
            __IO  uint32_t  ESEL253              :1;
            __IO  uint32_t  ESEL260              :1;
            __IO  uint32_t  ESEL261              :1;
            __IO  uint32_t  ESEL262              :1;
            __IO  uint32_t  ESEL263              :1;
            __IO  uint32_t  ESEL270              :1;
            __IO  uint32_t  ESEL271              :1;
            __IO  uint32_t  ESEL272              :1;
            __IO  uint32_t  ESEL273              :1;
            __IO  uint32_t  ESEL300              :1;
            __IO  uint32_t  ESEL301              :1;
            __IO  uint32_t  ESEL302              :1;
            __IO  uint32_t  ESEL303              :1;
            __IO  uint32_t  ESEL310              :1;
            __IO  uint32_t  ESEL311              :1;
            __IO  uint32_t  ESEL312              :1;
            __IO  uint32_t  ESEL313              :1;
        };
    };
} stc_intreq_dqesel_field_t;

typedef struct stc_intreq_oddpks1_field
{
        __IO   uint8_t  ODDPKS10                 :1;
        __IO   uint8_t  ODDPKS11                 :1;
        __IO   uint8_t  ODDPKS12                 :1;
        __IO   uint8_t  ODDPKS13                 :1;
        __IO   uint8_t  ODDPKS14                 :1;
        __IO   uint8_t  RESERVED0                :3;
} stc_intreq_oddpks1_field_t;

typedef struct stc_intreq_rcintsel0_field
{
    union {
        struct {
            __IO  uint32_t  INTSEL0              :8;
            __IO  uint32_t  INTSEL1              :8;
            __IO  uint32_t  INTSEL2              :8;
            __IO  uint32_t  INTSEL3              :8;
        };
        struct {
            __IO  uint32_t  INTSEL00             :1;
            __IO  uint32_t  INTSEL01             :1;
            __IO  uint32_t  INTSEL02             :1;
            __IO  uint32_t  INTSEL03             :1;
            __IO  uint32_t  INTSEL04             :1;
            __IO  uint32_t  INTSEL05             :1;
            __IO  uint32_t  INTSEL06             :1;
            __IO  uint32_t  INTSEL07             :1;
            __IO  uint32_t  INTSEL10             :1;
            __IO  uint32_t  INTSEL11             :1;
            __IO  uint32_t  INTSEL12             :1;
            __IO  uint32_t  INTSEL13             :1;
            __IO  uint32_t  INTSEL14             :1;
            __IO  uint32_t  INTSEL15             :1;
            __IO  uint32_t  INTSEL16             :1;
            __IO  uint32_t  INTSEL17             :1;
            __IO  uint32_t  INTSEL20             :1;
            __IO  uint32_t  INTSEL21             :1;
            __IO  uint32_t  INTSEL22             :1;
            __IO  uint32_t  INTSEL23             :1;
            __IO  uint32_t  INTSEL24             :1;
            __IO  uint32_t  INTSEL25             :1;
            __IO  uint32_t  INTSEL26             :1;
            __IO  uint32_t  INTSEL27             :1;
            __IO  uint32_t  INTSEL30             :1;
            __IO  uint32_t  INTSEL31             :1;
            __IO  uint32_t  INTSEL32             :1;
            __IO  uint32_t  INTSEL33             :1;
            __IO  uint32_t  INTSEL34             :1;
            __IO  uint32_t  INTSEL35             :1;
            __IO  uint32_t  INTSEL36             :1;
            __IO  uint32_t  INTSEL37             :1;
        };
    };
} stc_intreq_rcintsel0_field_t;

typedef struct stc_intreq_rcintsel1_field
{
    union {
        struct {
            __IO  uint32_t  INTSEL4              :8;
            __IO  uint32_t  INTSEL5              :8;
            __IO  uint32_t  INTSEL6              :8;
            __IO  uint32_t  INTSEL7              :8;
        };
        struct {
            __IO  uint32_t  INTSEL40             :1;
            __IO  uint32_t  INTSEL41             :1;
            __IO  uint32_t  INTSEL42             :1;
            __IO  uint32_t  INTSEL43             :1;
            __IO  uint32_t  INTSEL44             :1;
            __IO  uint32_t  INTSEL45             :1;
            __IO  uint32_t  INTSEL46             :1;
            __IO  uint32_t  INTSEL47             :1;
            __IO  uint32_t  INTSEL50             :1;
            __IO  uint32_t  INTSEL51             :1;
            __IO  uint32_t  INTSEL52             :1;
            __IO  uint32_t  INTSEL53             :1;
            __IO  uint32_t  INTSEL54             :1;
            __IO  uint32_t  INTSEL55             :1;
            __IO  uint32_t  INTSEL56             :1;
            __IO  uint32_t  INTSEL57             :1;
            __IO  uint32_t  INTSEL60             :1;
            __IO  uint32_t  INTSEL61             :1;
            __IO  uint32_t  INTSEL62             :1;
            __IO  uint32_t  INTSEL63             :1;
            __IO  uint32_t  INTSEL64             :1;
            __IO  uint32_t  INTSEL65             :1;
            __IO  uint32_t  INTSEL66             :1;
            __IO  uint32_t  INTSEL67             :1;
            __IO  uint32_t  INTSEL70             :1;
            __IO  uint32_t  INTSEL71             :1;
            __IO  uint32_t  INTSEL72             :1;
            __IO  uint32_t  INTSEL73             :1;
            __IO  uint32_t  INTSEL74             :1;
            __IO  uint32_t  INTSEL75             :1;
            __IO  uint32_t  INTSEL76             :1;
            __IO  uint32_t  INTSEL77             :1;
        };
    };
} stc_intreq_rcintsel1_field_t;

