lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
/******************************************************************************
 ** MFS_NFC_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_mfs_nfc_i2cdnf_field
{
    union {
        struct {
            __IO  uint16_t  I2CDNF0              :2;
            __IO  uint16_t  I2CDNF1              :2;
            __IO  uint16_t  I2CDNF2              :2;
            __IO  uint16_t  I2CDNF3              :2;
            __IO  uint16_t  I2CDNF4              :2;
            __IO  uint16_t  I2CDNF5              :2;
            __IO  uint16_t  I2CDNF6              :2;
            __IO  uint16_t  I2CDNF7              :2;
        };
        struct {
            __IO  uint16_t  I2CDNF00             :1;
            __IO  uint16_t  I2CDNF01             :1;
            __IO  uint16_t  I2CDNF10             :1;
            __IO  uint16_t  I2CDNF11             :1;
            __IO  uint16_t  I2CDNF20             :1;
            __IO  uint16_t  I2CDNF21             :1;
            __IO  uint16_t  I2CDNF30             :1;
            __IO  uint16_t  I2CDNF31             :1;
            __IO  uint16_t  I2CDNF40             :1;
            __IO  uint16_t  I2CDNF41             :1;
            __IO  uint16_t  I2CDNF50             :1;
            __IO  uint16_t  I2CDNF51             :1;
            __IO  uint16_t  I2CDNF60             :1;
            __IO  uint16_t  I2CDNF61             :1;
            __IO  uint16_t  I2CDNF70             :1;
            __IO  uint16_t  I2CDNF71             :1;
        };
    };
} stc_mfs_nfc_i2cdnf_field_t;

/******************************************************************************
 ** MFT_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_mft_ocsa10_field
{
        __IO   uint8_t  CST0                     :1;
        __IO   uint8_t  CST1                     :1;
        __IO   uint8_t  BDIS0                    :1;
        __IO   uint8_t  BDIS1                    :1;
        __IO   uint8_t  IOE0                     :1;
        __IO   uint8_t  IOE1                     :1;
        __IO   uint8_t  IOP0                     :1;
        __IO   uint8_t  IOP1                     :1;
} stc_mft_ocsa10_field_t;

typedef struct stc_mft_ocsb10_field
{
        __IO   uint8_t  OTD0                     :1;
        __IO   uint8_t  OTD1                     :1;
        __IO   uint8_t  RESERVED0                :2;
        __IO   uint8_t  CMOD                     :1;
        __IO   uint8_t  BTS0                     :1;
        __IO   uint8_t  BTS1                     :1;
        __IO   uint8_t  RESERVED1                :1;
} stc_mft_ocsb10_field_t;

typedef struct stc_mft_ocsa32_field
{
        __IO   uint8_t  CST2                     :1;
        __IO   uint8_t  CST3                     :1;
        __IO   uint8_t  BDIS2                    :1;
        __IO   uint8_t  BDIS3                    :1;
        __IO   uint8_t  IOE2                     :1;
        __IO   uint8_t  IOE3                     :1;
        __IO   uint8_t  IOP2                     :1;
        __IO   uint8_t  IOP3                     :1;
} stc_mft_ocsa32_field_t;

typedef struct stc_mft_ocsb32_field
{
        __IO   uint8_t  OTD2                     :1;
        __IO   uint8_t  OTD3                     :1;
        __IO   uint8_t  RESERVED0                :2;
        __IO   uint8_t  CMOD                     :1;
        __IO   uint8_t  BTS2                     :1;
        __IO   uint8_t  BTS3                     :1;
        __IO   uint8_t  RESERVED1                :1;
} stc_mft_ocsb32_field_t;

typedef struct stc_mft_ocsa54_field
{
        __IO   uint8_t  CST4                     :1;
        __IO   uint8_t  CST5                     :1;
        __IO   uint8_t  BDIS4                    :1;
        __IO   uint8_t  BDIS5                    :1;
        __IO   uint8_t  IOE4                     :1;
        __IO   uint8_t  IOE5                     :1;
        __IO   uint8_t  IOP4                     :1;
        __IO   uint8_t  IOP5                     :1;
} stc_mft_ocsa54_field_t;

typedef struct stc_mft_ocsb54_field
{
        __IO   uint8_t  OTD4                     :1;
        __IO   uint8_t  OTD5                     :1;
        __IO   uint8_t  RESERVED0                :2;
        __IO   uint8_t  CMOD                     :1;
        __IO   uint8_t  BTS4                     :1;
        __IO   uint8_t  BTS5                     :1;
        __IO   uint8_t  RESERVED1                :1;
} stc_mft_ocsb54_field_t;

typedef struct stc_mft_ocsc_field
{
        __IO   uint8_t  MOD0                     :1;
        __IO   uint8_t  MOD1                     :1;
        __IO   uint8_t  MOD2                     :1;
        __IO   uint8_t  MOD3                     :1;
        __IO   uint8_t  MOD4                     :1;
        __IO   uint8_t  MOD5                     :1;
        __IO   uint8_t  RESERVED0                :2;
} stc_mft_ocsc_field_t;

typedef struct stc_mft_tccp0_field
{
    union {
        struct {
            __IO  uint16_t  TCCP                 :16;
        };
        struct {
            __IO  uint16_t  TCCP0                :1;
            __IO  uint16_t  TCCP1                :1;
            __IO  uint16_t  TCCP2                :1;
            __IO  uint16_t  TCCP3                :1;
            __IO  uint16_t  TCCP4                :1;
            __IO  uint16_t  TCCP5                :1;
            __IO  uint16_t  TCCP6                :1;
            __IO  uint16_t  TCCP7                :1;
            __IO  uint16_t  TCCP8                :1;
            __IO  uint16_t  TCCP9                :1;
            __IO  uint16_t  TCCP10               :1;
            __IO  uint16_t  TCCP11               :1;
            __IO  uint16_t  TCCP12               :1;
            __IO  uint16_t  TCCP13               :1;
            __IO  uint16_t  TCCP14               :1;
            __IO  uint16_t  TCCP15               :1;
        };
    };
} stc_mft_tccp0_field_t;

