lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
typedef struct stc_mft_wfg_wfsa54_field
{
    union {
        struct {
            __IO  uint16_t  DCK                  :3;
            __IO  uint16_t  TMD                  :3;
            __IO  uint16_t  GTEN                 :2;
            __IO  uint16_t  PSEL                 :2;
            __IO  uint16_t  PGEN                 :2;
            __IO  uint16_t  DMOD                 :1;
            __IO  uint16_t  RESERVED0            :3;
        };
        struct {
            __IO  uint16_t  DCK0                 :1;
            __IO  uint16_t  DCK1                 :1;
            __IO  uint16_t  DCK2                 :1;
            __IO  uint16_t  TMD0                 :1;
            __IO  uint16_t  TMD1                 :1;
            __IO  uint16_t  TMD2                 :1;
            __IO  uint16_t  GTEN0                :1;
            __IO  uint16_t  GTEN1                :1;
            __IO  uint16_t  PSEL0                :1;
            __IO  uint16_t  PSEL1                :1;
            __IO  uint16_t  PGEN0                :1;
            __IO  uint16_t  PGEN1                :1;
            __IO  uint16_t  RESERVED1            :4;
        };
    };
} stc_mft_wfg_wfsa54_field_t;

typedef struct stc_mft_wfg_wfir_field
{
        __IO  uint16_t  DTIFA                    :1;
        __IO  uint16_t  DTICA                    :1;
        __IO  uint16_t  RESERVED0                :2;
        __IO  uint16_t  TMIF10                   :1;
        __IO  uint16_t  TMIC10                   :1;
        __IO  uint16_t  TMIE10                   :1;
        __IO  uint16_t  TMIS10                   :1;
        __IO  uint16_t  TMIF32                   :1;
        __IO  uint16_t  TMIC32                   :1;
        __IO  uint16_t  TMIE32                   :1;
        __IO  uint16_t  TMIS32                   :1;
        __IO  uint16_t  TMIF54                   :1;
        __IO  uint16_t  TMIC54                   :1;
        __IO  uint16_t  TMIE54                   :1;
        __IO  uint16_t  TMIS54                   :1;
} stc_mft_wfg_wfir_field_t;

typedef struct stc_mft_wfg_nzcl_field
{
    union {
        struct {
            __IO  uint16_t  DTIEA                :1;
            __IO  uint16_t  NWS                  :3;
            __IO  uint16_t  SDTI                 :1;
            __IO  uint16_t  RESERVED1            :11;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  NWS0                 :1;
            __IO  uint16_t  NWS1                 :1;
            __IO  uint16_t  NWS2                 :1;
            __IO  uint16_t  RESERVED2            :12;
        };
    };
} stc_mft_wfg_nzcl_field_t;

typedef struct stc_mft_adcmp_acsb_field
{
        __IO   uint8_t  BDIS0                    :1;
        __IO   uint8_t  BDIS1                    :1;
        __IO   uint8_t  BDIS2                    :1;
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  BTS0                     :1;
        __IO   uint8_t  BTS1                     :1;
        __IO   uint8_t  BTS2                     :1;
        __IO   uint8_t  RESERVED1                :1;
} stc_mft_adcmp_acsb_field_t;

typedef struct stc_mft_adcmp_acsa_field
{
    union {
        struct {
            __IO  uint16_t  CE0                  :2;
            __IO  uint16_t  CE1                  :2;
            __IO  uint16_t  CE2                  :2;
            __IO  uint16_t  RESERVED0            :2;
            __IO  uint16_t  SEL0                 :2;
            __IO  uint16_t  SEL1                 :2;
            __IO  uint16_t  SEL2                 :2;
            __IO  uint16_t  RESERVED2            :2;
        };
        struct {
            __IO  uint16_t  CE00                 :1;
            __IO  uint16_t  CE01                 :1;
            __IO  uint16_t  CE10                 :1;
            __IO  uint16_t  CE11                 :1;
            __IO  uint16_t  CE20                 :1;
            __IO  uint16_t  CE21                 :1;
            __IO  uint16_t  RESERVED1            :2;
            __IO  uint16_t  SEL00                :1;
            __IO  uint16_t  SEL01                :1;
            __IO  uint16_t  SEL10                :1;
            __IO  uint16_t  SEL11                :1;
            __IO  uint16_t  SEL20                :1;
            __IO  uint16_t  SEL21                :1;
            __IO  uint16_t  RESERVED3            :2;
        };
    };
} stc_mft_adcmp_acsa_field_t;

typedef struct stc_mft_adcmp_atsa_field
{
    union {
        struct {
            __IO  uint16_t  AD0S                 :2;
            __IO  uint16_t  AD1S                 :2;
            __IO  uint16_t  AD2S                 :2;
            __IO  uint16_t  RESERVED0            :2;
            __IO  uint16_t  AD0P                 :2;
            __IO  uint16_t  AD1P                 :2;
            __IO  uint16_t  AD2P                 :2;
            __IO  uint16_t  RESERVED2            :2;
        };
        struct {
            __IO  uint16_t  AD0S0                :1;
            __IO  uint16_t  AD0S1                :1;
            __IO  uint16_t  AD1S0                :1;
            __IO  uint16_t  AD1S1                :1;
            __IO  uint16_t  AD2S0                :1;
            __IO  uint16_t  AD2S1                :1;
            __IO  uint16_t  RESERVED1            :2;
            __IO  uint16_t  AD0P0                :1;
            __IO  uint16_t  AD0P1                :1;
            __IO  uint16_t  AD1P0                :1;
            __IO  uint16_t  AD1P1                :1;
            __IO  uint16_t  AD2P0                :1;
            __IO  uint16_t  AD2P1                :1;
            __IO  uint16_t  RESERVED3            :2;
        };
    };
} stc_mft_adcmp_atsa_field_t;

/******************************************************************************
 ** MFT_PPG_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_mft_ppg_ttcr0_field
{
    union {
        struct {
            __IO   uint8_t  STR0                 :1;
            __IO   uint8_t  MONI0                :1;
            __IO   uint8_t  CS0                  :2;
            __IO   uint8_t  TRG0O                :1;
            __IO   uint8_t  TRG2O                :1;
            __IO   uint8_t  TRG4O                :1;
            __IO   uint8_t  TRG6O                :1;
        };
        struct {
            __IO   uint8_t  RESERVED0            :2;
            __IO   uint8_t  CS00                 :1;
            __IO   uint8_t  CS01                 :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_mft_ppg_ttcr0_field_t;

typedef struct stc_mft_ppg_ttcr1_field
{
    union {
        struct {
            __IO   uint8_t  STR1                 :1;
            __IO   uint8_t  MONI1                :1;
            __IO   uint8_t  CS1                  :2;
            __IO   uint8_t  TRG1O                :1;
            __IO   uint8_t  TRG3O                :1;
            __IO   uint8_t  TRG5O                :1;
            __IO   uint8_t  TRG7O                :1;
        };
        struct {
            __IO   uint8_t  RESERVED0            :2;
            __IO   uint8_t  CS10                 :1;
            __IO   uint8_t  CS11                 :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_mft_ppg_ttcr1_field_t;

