lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
/******************************************************************************
 ** QPRC_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_qprc_qicrl_field
{
        __IO   uint8_t  QPCMIE                   :1;
        __IO   uint8_t  QPCMF                    :1;
        __IO   uint8_t  QPRCMIE                  :1;
        __IO   uint8_t  QPRCMF                   :1;
        __IO   uint8_t  OUZIE                    :1;
        __IO   uint8_t  UFDF                     :1;
        __IO   uint8_t  OFDF                     :1;
        __IO   uint8_t  ZIIF                     :1;
} stc_qprc_qicrl_field_t;

typedef struct stc_qprc_qicrh_field
{
        __IO   uint8_t  CDCIE                    :1;
        __IO   uint8_t  CDCF                     :1;
        __IO   uint8_t  DIRPC                    :1;
        __IO   uint8_t  DIROU                    :1;
        __IO   uint8_t  QPCNRCMIE                :1;
        __IO   uint8_t  QPCNRCMF                 :1;
        __IO   uint8_t  RESERVED0                :2;
} stc_qprc_qicrh_field_t;

typedef struct stc_qprc_qcr_field
{
    union {
        struct {
            __IO  uint16_t  PCM                  :2;
            __IO  uint16_t  RCM                  :2;
            __IO  uint16_t  PSTP                 :1;
            __IO  uint16_t  CGSC                 :1;
            __IO  uint16_t  RSEL                 :1;
            __IO  uint16_t  SWAP                 :1;
            __IO  uint16_t  PCRM                 :2;
            __IO  uint16_t  AES                  :2;
            __IO  uint16_t  BES                  :2;
            __IO  uint16_t  CGE                  :2;
        };
        struct {
            __IO  uint16_t  PCM0                 :1;
            __IO  uint16_t  PCM1                 :1;
            __IO  uint16_t  RCM0                 :1;
            __IO  uint16_t  RCM1                 :1;
            __IO  uint16_t  RESERVED0            :4;
            __IO  uint16_t  PCRM0                :1;
            __IO  uint16_t  PCRM1                :1;
            __IO  uint16_t  AES0                 :1;
            __IO  uint16_t  AES1                 :1;
            __IO  uint16_t  BES0                 :1;
            __IO  uint16_t  BES1                 :1;
            __IO  uint16_t  CGE0                 :1;
            __IO  uint16_t  CGE1                 :1;
        };
    };
} stc_qprc_qcr_field_t;

typedef struct stc_qprc_qecr_field
{
        __IO  uint16_t  ORNGMD                   :1;
        __IO  uint16_t  ORNGF                    :1;
        __IO  uint16_t  ORNGIE                   :1;
        __IO  uint16_t  RESERVED0                :13;
} stc_qprc_qecr_field_t;

typedef struct stc_qprc_qprcrr_field
{
    union {
        struct {
            __IO  uint32_t  QPCRR                :16;
            __IO  uint32_t  QRCRR                :16;
        };
        struct {
            __IO  uint32_t  QPCRR0               :1;
            __IO  uint32_t  QPCRR1               :1;
            __IO  uint32_t  QPCRR2               :1;
            __IO  uint32_t  QPCRR3               :1;
            __IO  uint32_t  QPCRR4               :1;
            __IO  uint32_t  QPCRR5               :1;
            __IO  uint32_t  QPCRR6               :1;
            __IO  uint32_t  QPCRR7               :1;
            __IO  uint32_t  QPCRR8               :1;
            __IO  uint32_t  QPCRR9               :1;
            __IO  uint32_t  QPCRR10              :1;
            __IO  uint32_t  QPCRR11              :1;
            __IO  uint32_t  QPCRR12              :1;
            __IO  uint32_t  QPCRR13              :1;
            __IO  uint32_t  QPCRR14              :1;
            __IO  uint32_t  QPCRR15              :1;
            __IO  uint32_t  QRCRR0               :1;
            __IO  uint32_t  QRCRR1               :1;
            __IO  uint32_t  QRCRR2               :1;
            __IO  uint32_t  QRCRR3               :1;
            __IO  uint32_t  QRCRR4               :1;
            __IO  uint32_t  QRCRR5               :1;
            __IO  uint32_t  QRCRR6               :1;
            __IO  uint32_t  QRCRR7               :1;
            __IO  uint32_t  QRCRR8               :1;
            __IO  uint32_t  QRCRR9               :1;
            __IO  uint32_t  QRCRR10              :1;
            __IO  uint32_t  QRCRR11              :1;
            __IO  uint32_t  QRCRR12              :1;
            __IO  uint32_t  QRCRR13              :1;
            __IO  uint32_t  QRCRR14              :1;
            __IO  uint32_t  QRCRR15              :1;
        };
    };
} stc_qprc_qprcrr_field_t;

/******************************************************************************
 ** RTC_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_rtc_wtcr1_field
{
        __IO  uint32_t  ST                       :1;
        __IO  uint32_t  RESERVED0                :1;
        __IO  uint32_t  RUN                      :1;
        __IO  uint32_t  SRST                     :1;
        __IO  uint32_t  SCST                     :1;
        __IO  uint32_t  SCRST                    :1;
        __IO  uint32_t  BUSY                     :1;
        __IO  uint32_t  RESERVED1                :1;
        __IO  uint32_t  MIEN                     :1;
        __IO  uint32_t  HEN                      :1;
        __IO  uint32_t  DEN                      :1;
        __IO  uint32_t  MOEN                     :1;
        __IO  uint32_t  YEN                      :1;
        __IO  uint32_t  RESERVED2                :3;
        __IO  uint32_t  INTSSI                   :1;
        __IO  uint32_t  INTSI                    :1;
        __IO  uint32_t  INTMI                    :1;
        __IO  uint32_t  INTHI                    :1;
        __IO  uint32_t  INTTMI                   :1;
        __IO  uint32_t  INTALI                   :1;
        __IO  uint32_t  INTERI                   :1;
        __IO  uint32_t  INTCRI                   :1;
        __IO  uint32_t  INTSSIE                  :1;
        __IO  uint32_t  INTSIE                   :1;
        __IO  uint32_t  INTMIE                   :1;
        __IO  uint32_t  INTHIE                   :1;
        __IO  uint32_t  INTTMIE                  :1;
        __IO  uint32_t  INTALIE                  :1;
        __IO  uint32_t  INTERIE                  :1;
        __IO  uint32_t  INTCRIE                  :1;
} stc_rtc_wtcr1_field_t;

typedef struct stc_rtc_wtcr2_field
{
        __IO  uint32_t  CREAD                    :1;
        __IO  uint32_t  RESERVED0                :7;
        __IO  uint32_t  TMST                     :1;
        __IO  uint32_t  TMEN                     :1;
        __IO  uint32_t  TMRUN                    :1;
        __IO  uint32_t  RESERVED1                :21;
} stc_rtc_wtcr2_field_t;

typedef struct stc_rtc_wtbr_field
{
        __IO  uint32_t  BR0                      :1;
        __IO  uint32_t  BR1                      :1;
        __IO  uint32_t  BR2                      :1;
        __IO  uint32_t  BR3                      :1;
        __IO  uint32_t  BR4                      :1;
        __IO  uint32_t  BR5                      :1;
        __IO  uint32_t  BR6                      :1;
        __IO  uint32_t  BR7                      :1;
        __IO  uint32_t  BR8                      :1;
        __IO  uint32_t  BR9                      :1;
        __IO  uint32_t  BR10                     :1;
        __IO  uint32_t  BR11                     :1;
        __IO  uint32_t  BR12                     :1;
        __IO  uint32_t  BR13                     :1;
        __IO  uint32_t  BR14                     :1;
        __IO  uint32_t  BR15                     :1;
        __IO  uint32_t  BR16                     :1;
        __IO  uint32_t  BR17                     :1;
        __IO  uint32_t  BR18                     :1;
        __IO  uint32_t  BR19                     :1;
        __IO  uint32_t  BR20                     :1;
        __IO  uint32_t  BR21                     :1;
        __IO  uint32_t  BR22                     :1;
        __IO  uint32_t  BR23                     :1;
        __IO  uint32_t  RESERVED0                :8;
} stc_rtc_wtbr_field_t;

typedef struct stc_rtc_wtsr_field
{
    union {
        struct {
            __IO   uint8_t  S                    :4;
            __IO   uint8_t  TS                   :3;
            __IO   uint8_t  RESERVED0            :1;
        };
        struct {
            __IO   uint8_t  S0                   :1;
            __IO   uint8_t  S1                   :1;
            __IO   uint8_t  S2                   :1;
            __IO   uint8_t  S3                   :1;
            __IO   uint8_t  TS0                  :1;
            __IO   uint8_t  TS1                  :1;
            __IO   uint8_t  TS2                  :1;
            __IO   uint8_t  RESERVED1            :1;
        };
    };
} stc_rtc_wtsr_field_t;

typedef struct stc_rtc_wtmir_field
{
    union {
        struct {
            __IO   uint8_t  MI                   :4;
            __IO   uint8_t  TMI                  :3;
            __IO   uint8_t  RESERVED0            :1;
        };
        struct {
            __IO   uint8_t  MI0                  :1;
            __IO   uint8_t  MI1                  :1;
            __IO   uint8_t  MI2                  :1;
            __IO   uint8_t  MI3                  :1;
            __IO   uint8_t  TMI0                 :1;
            __IO   uint8_t  TMI1                 :1;
            __IO   uint8_t  TMI2                 :1;
            __IO   uint8_t  RESERVED1            :1;
        };
    };
} stc_rtc_wtmir_field_t;

typedef struct stc_rtc_wthr_field
{
    union {
        struct {
            __IO   uint8_t  H                    :4;
            __IO   uint8_t  TH                   :2;
            __IO   uint8_t  RESERVED0            :2;
        };
        struct {
            __IO   uint8_t  H0                   :1;
            __IO   uint8_t  H1                   :1;
            __IO   uint8_t  H2                   :1;
            __IO   uint8_t  H3                   :1;
            __IO   uint8_t  TH0                  :1;
            __IO   uint8_t  TH1                  :1;
            __IO   uint8_t  RESERVED1            :2;
        };
    };
} stc_rtc_wthr_field_t;

