lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
        __IO uint32_t IRQ39MON;
        stc_intreq_irq39mon_field_t IRQ39MON_f;
        struct {
          union {
            __IO uint16_t IRQ39MONL;
            struct {
              __IO uint8_t IRQ39MONLL;
              __IO uint8_t IRQ39MONLH;
            };
          };
          union {
            __IO uint16_t IRQ39MONH;
            struct {
              __IO uint8_t IRQ39MONHL;
              __IO uint8_t IRQ39MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ40MON;
        stc_intreq_irq40mon_field_t IRQ40MON_f;
        struct {
          union {
            __IO uint16_t IRQ40MONL;
            struct {
              __IO uint8_t IRQ40MONLL;
              __IO uint8_t IRQ40MONLH;
            };
          };
          union {
            __IO uint16_t IRQ40MONH;
            struct {
              __IO uint8_t IRQ40MONHL;
              __IO uint8_t IRQ40MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ41MON;
        stc_intreq_irq41mon_field_t IRQ41MON_f;
        struct {
          union {
            __IO uint16_t IRQ41MONL;
            struct {
              __IO uint8_t IRQ41MONLL;
              __IO uint8_t IRQ41MONLH;
            };
          };
          union {
            __IO uint16_t IRQ41MONH;
            struct {
              __IO uint8_t IRQ41MONHL;
              __IO uint8_t IRQ41MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ42MON;
        stc_intreq_irq42mon_field_t IRQ42MON_f;
        struct {
          union {
            __IO uint16_t IRQ42MONL;
            struct {
              __IO uint8_t IRQ42MONLL;
              __IO uint8_t IRQ42MONLH;
            };
          };
          union {
            __IO uint16_t IRQ42MONH;
            struct {
              __IO uint8_t IRQ42MONHL;
              __IO uint8_t IRQ42MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ43MON;
        stc_intreq_irq43mon_field_t IRQ43MON_f;
        struct {
          union {
            __IO uint16_t IRQ43MONL;
            struct {
              __IO uint8_t IRQ43MONLL;
              __IO uint8_t IRQ43MONLH;
            };
          };
          union {
            __IO uint16_t IRQ43MONH;
            struct {
              __IO uint8_t IRQ43MONHL;
              __IO uint8_t IRQ43MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ44MON;
        stc_intreq_irq44mon_field_t IRQ44MON_f;
        struct {
          union {
            __IO uint16_t IRQ44MONL;
            struct {
              __IO uint8_t IRQ44MONLL;
              __IO uint8_t IRQ44MONLH;
            };
          };
          union {
            __IO uint16_t IRQ44MONH;
            struct {
              __IO uint8_t IRQ44MONHL;
              __IO uint8_t IRQ44MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ45MON;
        stc_intreq_irq45mon_field_t IRQ45MON_f;
        struct {
          union {
            __IO uint16_t IRQ45MONL;
            struct {
              __IO uint8_t IRQ45MONLL;
              __IO uint8_t IRQ45MONLH;
            };
          };
          union {
            __IO uint16_t IRQ45MONH;
            struct {
              __IO uint8_t IRQ45MONHL;
              __IO uint8_t IRQ45MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ46MON;
        stc_intreq_irq46mon_field_t IRQ46MON_f;
        struct {
          union {
            __IO uint16_t IRQ46MONL;
            struct {
              __IO uint8_t IRQ46MONLL;
              __IO uint8_t IRQ46MONLH;
            };
          };
          union {
            __IO uint16_t IRQ46MONH;
            struct {
              __IO uint8_t IRQ46MONHL;
              __IO uint8_t IRQ46MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ47MON;
        stc_intreq_irq47mon_field_t IRQ47MON_f;
        struct {
          union {
            __IO uint16_t IRQ47MONL;
            struct {
              __IO uint8_t IRQ47MONLL;
              __IO uint8_t IRQ47MONLH;
            };
          };
          union {
            __IO uint16_t IRQ47MONH;
            struct {
              __IO uint8_t IRQ47MONHL;
              __IO uint8_t IRQ47MONHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED1[300];
    union {
        __IO uint32_t DRQSEL1;
        stc_intreq_drqsel1_field_t DRQSEL1_f;
        struct {
          union {
            __IO uint16_t DRQSEL1L;
            struct {
              __IO uint8_t DRQSEL1LL;
              __IO uint8_t DRQSEL1LH;
            };
          };
          union {
            __IO uint16_t DRQSEL1H;
            struct {
              __IO uint8_t DRQSEL1HL;
              __IO uint8_t DRQSEL1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t DQESEL;
        stc_intreq_dqesel_field_t DQESEL_f;
        struct {
          union {
            __IO uint16_t DQESELL;
            struct {
              __IO uint8_t DQESELLL;
              __IO uint8_t DQESELLH;
            };
          };
          union {
            __IO uint16_t DQESELH;
            struct {
              __IO uint8_t DQESELHL;
              __IO uint8_t DQESELHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED2[7];
    union {
        __IO  uint8_t ODDPKS1;
        stc_intreq_oddpks1_field_t ODDPKS1_f;
    };
    union {
        __IO uint32_t RCINTSEL0;
        stc_intreq_rcintsel0_field_t RCINTSEL0_f;
        struct {
          union {
            __IO uint16_t RCINTSEL0L;
            struct {
              __IO uint8_t RCINTSEL0LL;
              __IO uint8_t RCINTSEL0LH;
            };
          };
          union {
            __IO uint16_t RCINTSEL0H;
            struct {
              __IO uint8_t RCINTSEL0HL;
              __IO uint8_t RCINTSEL0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RCINTSEL1;
        stc_intreq_rcintsel1_field_t RCINTSEL1_f;
        struct {
          union {
            __IO uint16_t RCINTSEL1L;
            struct {
              __IO uint8_t RCINTSEL1LL;
              __IO uint8_t RCINTSEL1LH;
            };
          };
          union {
            __IO uint16_t RCINTSEL1H;
            struct {
              __IO uint8_t RCINTSEL1HL;
              __IO uint8_t RCINTSEL1HH;
            };
          };
        };
    };
} FM_INTREQ_TypeDef, FM3_INTREQ_TypeDef;

