lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
/******************************************************************************
 ** MFS_NFC_MODULE
 ** 
 **   register structur
 ******************************************************************************/
typedef struct
{
    union {
        __IO uint16_t I2CDNF;
        stc_mfs_nfc_i2cdnf_field_t I2CDNF_f;
        struct {
            __IO  uint8_t I2CDNFL;
            __IO  uint8_t I2CDNFH;
        };
    };
} FM_MFS_NFC_TypeDef, FM3_MFS_NFC_TypeDef;

/******************************************************************************
 ** MFT_MODULE
 ** 
 **   register structur
 ******************************************************************************/
typedef struct
{
    union {
        __IO uint16_t OCCP0;
        struct {
            __IO  uint8_t OCCP0L;
            __IO  uint8_t OCCP0H;
        };
        __IO uint16_t OCU_OCCP0;
        struct {
            __IO  uint8_t OCU_OCCP0L;
            __IO  uint8_t OCU_OCCP0H;
        };
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO uint16_t OCCP1;
        struct {
            __IO  uint8_t OCCP1L;
            __IO  uint8_t OCCP1H;
        };
        __IO uint16_t OCU_OCCP1;
        struct {
            __IO  uint8_t OCU_OCCP1L;
            __IO  uint8_t OCU_OCCP1H;
        };
    };
        __IO  uint8_t RESERVED1[2];
    union {
        __IO uint16_t OCCP2;
        struct {
            __IO  uint8_t OCCP2L;
            __IO  uint8_t OCCP2H;
        };
        __IO uint16_t OCU_OCCP2;
        struct {
            __IO  uint8_t OCU_OCCP2L;
            __IO  uint8_t OCU_OCCP2H;
        };
    };
        __IO  uint8_t RESERVED2[2];
    union {
        __IO uint16_t OCCP3;
        struct {
            __IO  uint8_t OCCP3L;
            __IO  uint8_t OCCP3H;
        };
        __IO uint16_t OCU_OCCP3;
        struct {
            __IO  uint8_t OCU_OCCP3L;
            __IO  uint8_t OCU_OCCP3H;
        };
    };
        __IO  uint8_t RESERVED3[2];
    union {
        __IO uint16_t OCCP4;
        struct {
            __IO  uint8_t OCCP4L;
            __IO  uint8_t OCCP4H;
        };
        __IO uint16_t OCU_OCCP4;
        struct {
            __IO  uint8_t OCU_OCCP4L;
            __IO  uint8_t OCU_OCCP4H;
        };
    };
        __IO  uint8_t RESERVED4[2];
    union {
        __IO uint16_t OCCP5;
        struct {
            __IO  uint8_t OCCP5L;
            __IO  uint8_t OCCP5H;
        };
        __IO uint16_t OCU_OCCP5;
        struct {
            __IO  uint8_t OCU_OCCP5L;
            __IO  uint8_t OCU_OCCP5H;
        };
    };
        __IO  uint8_t RESERVED5[2];
    union {
        __IO  uint8_t OCSA10;
        stc_mft_ocsa10_field_t OCSA10_f;
        __IO  uint8_t OCU_OCSA10;
        stc_mft_ocu_ocsa10_field_t OCU_OCSA10_f;
    };
    union {
        __IO  uint8_t OCSB10;
        stc_mft_ocsb10_field_t OCSB10_f;
        __IO  uint8_t OCU_OCSB10;
        stc_mft_ocu_ocsb10_field_t OCU_OCSB10_f;
    };
        __IO  uint8_t RESERVED6[2];
    union {
        __IO  uint8_t OCSA32;
        stc_mft_ocsa32_field_t OCSA32_f;
        __IO  uint8_t OCU_OCSA32;
        stc_mft_ocu_ocsa32_field_t OCU_OCSA32_f;
    };
    union {
        __IO  uint8_t OCSB32;
        stc_mft_ocsb32_field_t OCSB32_f;
        __IO  uint8_t OCU_OCSB32;
        stc_mft_ocu_ocsb32_field_t OCU_OCSB32_f;
    };
        __IO  uint8_t RESERVED7[2];
    union {
        __IO  uint8_t OCSA54;
        stc_mft_ocsa54_field_t OCSA54_f;
        __IO  uint8_t OCU_OCSA54;
        stc_mft_ocu_ocsa54_field_t OCU_OCSA54_f;
    };
    union {
        __IO  uint8_t OCSB54;
        stc_mft_ocsb54_field_t OCSB54_f;
        __IO  uint8_t OCU_OCSB54;
        stc_mft_ocu_ocsb54_field_t OCU_OCSB54_f;
    };
        __IO  uint8_t RESERVED8[3];
    union {
        __IO  uint8_t OCSC;
        stc_mft_ocsc_field_t OCSC_f;
        __IO  uint8_t OCU_OCSC;
        stc_mft_ocu_ocsc_field_t OCU_OCSC_f;
    };
        __IO  uint8_t RESERVED9[2];
    union {
        __IO uint16_t TCCP0;
        stc_mft_tccp0_field_t TCCP0_f;
        struct {
            __IO  uint8_t TCCP0L;
            __IO  uint8_t TCCP0H;
        };
        __IO uint16_t FRT_TCCP0;
        stc_mft_frt_tccp0_field_t FRT_TCCP0_f;
        struct {
            __IO  uint8_t FRT_TCCP0L;
            __IO  uint8_t FRT_TCCP0H;
        };
    };
        __IO  uint8_t RESERVED10[2];
    union {
        __IO uint16_t TCDT0;
        struct {
            __IO  uint8_t TCDT0L;
            __IO  uint8_t TCDT0H;
        };
        __IO uint16_t FRT_TCDT0;
        struct {
            __IO  uint8_t FRT_TCDT0L;
            __IO  uint8_t FRT_TCDT0H;
        };
    };
        __IO  uint8_t RESERVED11[2];
    union {
        __IO uint16_t TCSA0;
        stc_mft_tcsa0_field_t TCSA0_f;
        struct {
            __IO  uint8_t TCSA0L;
            __IO  uint8_t TCSA0H;
        };
        __IO uint16_t FRT_TCSA0;
        stc_mft_frt_tcsa0_field_t FRT_TCSA0_f;
        struct {
            __IO  uint8_t FRT_TCSA0L;
            __IO  uint8_t FRT_TCSA0H;
        };
    };
        __IO  uint8_t RESERVED12[2];
    union {
        __IO uint16_t TCSB0;
        stc_mft_tcsb0_field_t TCSB0_f;
        struct {
            __IO  uint8_t TCSB0L;
            __IO  uint8_t TCSB0H;
        };
        __IO uint16_t FRT_TCSB0;
        stc_mft_frt_tcsb0_field_t FRT_TCSB0_f;
        struct {
            __IO  uint8_t FRT_TCSB0L;
            __IO  uint8_t FRT_TCSB0H;
        };
    };
        __IO  uint8_t RESERVED13[2];
    union {
        __IO uint16_t TCCP1;
        stc_mft_tccp1_field_t TCCP1_f;
        struct {
            __IO  uint8_t TCCP1L;
            __IO  uint8_t TCCP1H;
        };
        __IO uint16_t FRT_TCCP1;
        stc_mft_frt_tccp1_field_t FRT_TCCP1_f;
        struct {
            __IO  uint8_t FRT_TCCP1L;
            __IO  uint8_t FRT_TCCP1H;
        };
    };
        __IO  uint8_t RESERVED14[2];
    union {
        __IO uint16_t TCDT1;
        struct {
            __IO  uint8_t TCDT1L;
            __IO  uint8_t TCDT1H;
        };
        __IO uint16_t FRT_TCDT1;
        struct {
            __IO  uint8_t FRT_TCDT1L;
            __IO  uint8_t FRT_TCDT1H;
        };
    };
        __IO  uint8_t RESERVED15[2];
    union {
        __IO uint16_t TCSA1;
        stc_mft_tcsa1_field_t TCSA1_f;
        struct {
            __IO  uint8_t TCSA1L;
            __IO  uint8_t TCSA1H;
        };
        __IO uint16_t FRT_TCSA1;
        stc_mft_frt_tcsa1_field_t FRT_TCSA1_f;
        struct {
            __IO  uint8_t FRT_TCSA1L;
            __IO  uint8_t FRT_TCSA1H;
        };
    };
        __IO  uint8_t RESERVED16[2];
    union {
        __IO uint16_t TCSB1;
        stc_mft_tcsb1_field_t TCSB1_f;
        struct {
            __IO  uint8_t TCSB1L;
            __IO  uint8_t TCSB1H;
        };
        __IO uint16_t FRT_TCSB1;
        stc_mft_frt_tcsb1_field_t FRT_TCSB1_f;
        struct {
            __IO  uint8_t FRT_TCSB1L;
            __IO  uint8_t FRT_TCSB1H;
        };
    };
        __IO  uint8_t RESERVED17[2];
    union {
        __IO uint16_t TCCP2;
        stc_mft_tccp2_field_t TCCP2_f;
        struct {
            __IO  uint8_t TCCP2L;
            __IO  uint8_t TCCP2H;
        };
        __IO uint16_t FRT_TCCP2;
        stc_mft_frt_tccp2_field_t FRT_TCCP2_f;
        struct {
            __IO  uint8_t FRT_TCCP2L;
            __IO  uint8_t FRT_TCCP2H;
        };
    };
        __IO  uint8_t RESERVED18[2];
    union {
        __IO uint16_t TCDT2;
        struct {
            __IO  uint8_t TCDT2L;
            __IO  uint8_t TCDT2H;
        };
        __IO uint16_t FRT_TCDT2;
        struct {
            __IO  uint8_t FRT_TCDT2L;
            __IO  uint8_t FRT_TCDT2H;
        };
    };
        __IO  uint8_t RESERVED19[2];
    union {
        __IO uint16_t TCSA2;
        stc_mft_tcsa2_field_t TCSA2_f;
        struct {
            __IO  uint8_t TCSA2L;
            __IO  uint8_t TCSA2H;
        };
        __IO uint16_t FRT_TCSA2;
        stc_mft_frt_tcsa2_field_t FRT_TCSA2_f;
        struct {
            __IO  uint8_t FRT_TCSA2L;
            __IO  uint8_t FRT_TCSA2H;
        };
    };
        __IO  uint8_t RESERVED20[2];
    union {
        __IO uint16_t TCSB2;
        stc_mft_tcsb2_field_t TCSB2_f;
        struct {
            __IO  uint8_t TCSB2L;
            __IO  uint8_t TCSB2H;
        };
        __IO uint16_t FRT_TCSB2;
        stc_mft_frt_tcsb2_field_t FRT_TCSB2_f;
        struct {
            __IO  uint8_t FRT_TCSB2L;
            __IO  uint8_t FRT_TCSB2H;
        };
    };
        __IO  uint8_t RESERVED21[2];
    union {
        __IO  uint8_t OCFS10;
        stc_mft_ocfs10_field_t OCFS10_f;
        __IO  uint8_t OCU_OCFS10;
        stc_mft_ocu_ocfs10_field_t OCU_OCFS10_f;
    };
    union {
        __IO  uint8_t OCFS32;
        stc_mft_ocfs32_field_t OCFS32_f;
        __IO  uint8_t OCU_OCFS32;
        stc_mft_ocu_ocfs32_field_t OCU_OCFS32_f;
    };
        __IO  uint8_t RESERVED22[2];
    union {
        __IO  uint8_t OCFS54;
        stc_mft_ocfs54_field_t OCFS54_f;
        __IO  uint8_t OCU_OCFS54;
        stc_mft_ocu_ocfs54_field_t OCU_OCFS54_f;
    };
        __IO  uint8_t RESERVED23[3];
    union {
        __IO  uint8_t ICFS10;
        stc_mft_icfs10_field_t ICFS10_f;
        __IO  uint8_t ICU_ICFS10;
        stc_mft_icu_icfs10_field_t ICU_ICFS10_f;
    };
    union {
        __IO  uint8_t ICFS32;
        stc_mft_icfs32_field_t ICFS32_f;
        __IO  uint8_t ICU_ICFS32;
        stc_mft_icu_icfs32_field_t ICU_ICFS32_f;
    };
        __IO  uint8_t RESERVED24[6];
    union {
        __IO uint16_t ICCP0;
        struct {
            __IO  uint8_t ICCP0L;
            __IO  uint8_t ICCP0H;
        };
        __IO uint16_t ICU_ICCP0;
        struct {
            __IO  uint8_t ICU_ICCP0L;
            __IO  uint8_t ICU_ICCP0H;
        };
    };
        __IO  uint8_t RESERVED25[2];
    union {
        __IO uint16_t ICCP1;
        struct {
            __IO  uint8_t ICCP1L;
            __IO  uint8_t ICCP1H;
        };
        __IO uint16_t ICU_ICCP1;
        struct {
            __IO  uint8_t ICU_ICCP1L;
            __IO  uint8_t ICU_ICCP1H;
        };
    };
        __IO  uint8_t RESERVED26[2];
    union {
        __IO uint16_t ICCP2;
        struct {
            __IO  uint8_t ICCP2L;
            __IO  uint8_t ICCP2H;
        };
        __IO uint16_t ICU_ICCP2;
        struct {
            __IO  uint8_t ICU_ICCP2L;
            __IO  uint8_t ICU_ICCP2H;
        };
    };
        __IO  uint8_t RESERVED27[2];
    union {
        __IO uint16_t ICCP3;
        struct {
            __IO  uint8_t ICCP3L;
            __IO  uint8_t ICCP3H;
        };
        __IO uint16_t ICU_ICCP3;
        struct {
            __IO  uint8_t ICU_ICCP3L;
            __IO  uint8_t ICU_ICCP3H;
        };
    };
        __IO  uint8_t RESERVED28[2];
    union {
        __IO  uint8_t ICSA10;
        stc_mft_icsa10_field_t ICSA10_f;
        __IO  uint8_t ICU_ICSA10;
        stc_mft_icu_icsa10_field_t ICU_ICSA10_f;
    };
    union {
        __IO  uint8_t ICSB10;
        stc_mft_icsb10_field_t ICSB10_f;
        __IO  uint8_t ICU_ICSB10;
        stc_mft_icu_icsb10_field_t ICU_ICSB10_f;
    };
        __IO  uint8_t RESERVED29[2];
    union {
        __IO  uint8_t ICSA32;
        stc_mft_icsa32_field_t ICSA32_f;
        __IO  uint8_t ICU_ICSA32;
        stc_mft_icu_icsa32_field_t ICU_ICSA32_f;
    };
    union {
        __IO  uint8_t ICSB32;
        stc_mft_icsb32_field_t ICSB32_f;
        __IO  uint8_t ICU_ICSB32;
        stc_mft_icu_icsb32_field_t ICU_ICSB32_f;
    };
        __IO  uint8_t RESERVED30[2];
    union {
        __IO uint16_t WFTM10;
        struct {
            __IO  uint8_t WFTM10L;
            __IO  uint8_t WFTM10H;
        };
        __IO uint16_t WFG_WFTM10;
        struct {
            __IO  uint8_t WFG_WFTM10L;
            __IO  uint8_t WFG_WFTM10H;
        };
    };
        __IO  uint8_t RESERVED31[2];
    union {
        __IO uint16_t WFTM32;
        struct {
            __IO  uint8_t WFTM32L;
            __IO  uint8_t WFTM32H;
        };
        __IO uint16_t WFG_WFTM32;
        struct {
            __IO  uint8_t WFG_WFTM32L;
            __IO  uint8_t WFG_WFTM32H;
        };
    };
        __IO  uint8_t RESERVED32[2];
    union {
        __IO uint16_t WFTM54;
        struct {
            __IO  uint8_t WFTM54L;
            __IO  uint8_t WFTM54H;
        };
        __IO uint16_t WFG_WFTM54;
        struct {
            __IO  uint8_t WFG_WFTM54L;
            __IO  uint8_t WFG_WFTM54H;
        };
    };
        __IO  uint8_t RESERVED33[2];
    union {
        __IO uint16_t WFSA10;
        stc_mft_wfsa10_field_t WFSA10_f;
        struct {
            __IO  uint8_t WFSA10L;
            __IO  uint8_t WFSA10H;
        };
        __IO uint16_t WFG_WFSA10;
        stc_mft_wfg_wfsa10_field_t WFG_WFSA10_f;
        struct {
            __IO  uint8_t WFG_WFSA10L;
            __IO  uint8_t WFG_WFSA10H;
        };
    };
        __IO  uint8_t RESERVED34[2];
    union {
        __IO uint16_t WFSA32;
        stc_mft_wfsa32_field_t WFSA32_f;
        struct {
            __IO  uint8_t WFSA32L;
            __IO  uint8_t WFSA32H;
        };
        __IO uint16_t WFG_WFSA32;
        stc_mft_wfg_wfsa32_field_t WFG_WFSA32_f;
        struct {
            __IO  uint8_t WFG_WFSA32L;
            __IO  uint8_t WFG_WFSA32H;
        };
    };
        __IO  uint8_t RESERVED35[2];
    union {
        __IO uint16_t WFSA54;
        stc_mft_wfsa54_field_t WFSA54_f;
        struct {
            __IO  uint8_t WFSA54L;
            __IO  uint8_t WFSA54H;
        };
        __IO uint16_t WFG_WFSA54;
        stc_mft_wfg_wfsa54_field_t WFG_WFSA54_f;
        struct {
            __IO  uint8_t WFG_WFSA54L;
            __IO  uint8_t WFG_WFSA54H;
        };
    };
        __IO  uint8_t RESERVED36[2];
    union {
        __IO uint16_t WFIR;
        stc_mft_wfir_field_t WFIR_f;
        struct {
            __IO  uint8_t WFIRL;
            __IO  uint8_t WFIRH;
        };
        __IO uint16_t WFG_WFIR;
        stc_mft_wfg_wfir_field_t WFG_WFIR_f;
        struct {
            __IO  uint8_t WFG_WFIRL;
            __IO  uint8_t WFG_WFIRH;
        };
    };
        __IO  uint8_t RESERVED37[2];
    union {
        __IO uint16_t NZCL;
        stc_mft_nzcl_field_t NZCL_f;
        struct {
            __IO  uint8_t NZCLL;
            __IO  uint8_t NZCLH;
        };
        __IO uint16_t WFG_NZCL;
        stc_mft_wfg_nzcl_field_t WFG_NZCL_f;
        struct {
            __IO  uint8_t WFG_NZCLL;
            __IO  uint8_t WFG_NZCLH;
        };
    };
        __IO  uint8_t RESERVED38[2];
    union {
        __IO uint16_t ACCP0;
        struct {
            __IO  uint8_t ACCP0L;
            __IO  uint8_t ACCP0H;
        };
        __IO uint16_t ADCMP_ACCP0;
        struct {
            __IO  uint8_t ADCMP_ACCP0L;
            __IO  uint8_t ADCMP_ACCP0H;
        };
    };
        __IO  uint8_t RESERVED39[2];
    union {
        __IO uint16_t ACCPDN0;
        struct {
            __IO  uint8_t ACCPDN0L;
            __IO  uint8_t ACCPDN0H;
        };
        __IO uint16_t ADCMP_ACCPDN0;
        struct {
            __IO  uint8_t ADCMP_ACCPDN0L;
            __IO  uint8_t ADCMP_ACCPDN0H;
        };
    };
        __IO  uint8_t RESERVED40[2];
    union {
        __IO uint16_t ACCP1;
        struct {
            __IO  uint8_t ACCP1L;
            __IO  uint8_t ACCP1H;
        };
        __IO uint16_t ADCMP_ACCP1;
        struct {
            __IO  uint8_t ADCMP_ACCP1L;
            __IO  uint8_t ADCMP_ACCP1H;
        };
    };
        __IO  uint8_t RESERVED41[2];
    union {
        __IO uint16_t ACCPDN1;
        struct {
            __IO  uint8_t ACCPDN1L;
            __IO  uint8_t ACCPDN1H;
        };
        __IO uint16_t ADCMP_ACCPDN1;
        struct {
            __IO  uint8_t ADCMP_ACCPDN1L;
            __IO  uint8_t ADCMP_ACCPDN1H;
        };
    };
        __IO  uint8_t RESERVED42[2];
    union {
        __IO uint16_t ACCP2;
        struct {
            __IO  uint8_t ACCP2L;
            __IO  uint8_t ACCP2H;
        };
        __IO uint16_t ADCMP_ACCP2;
        struct {
            __IO  uint8_t ADCMP_ACCP2L;
            __IO  uint8_t ADCMP_ACCP2H;
        };
    };
        __IO  uint8_t RESERVED43[2];
    union {
        __IO uint16_t ACCPDN2;
        struct {
            __IO  uint8_t ACCPDN2L;
            __IO  uint8_t ACCPDN2H;
        };
        __IO uint16_t ADCMP_ACCPDN2;
        struct {
            __IO  uint8_t ADCMP_ACCPDN2L;
            __IO  uint8_t ADCMP_ACCPDN2H;
        };
    };
        __IO  uint8_t RESERVED44[2];
    union {
        __IO  uint8_t ACSB;
        stc_mft_acsb_field_t ACSB_f;
        __IO  uint8_t ADCMP_ACSB;
        stc_mft_adcmp_acsb_field_t ADCMP_ACSB_f;
    };
        __IO  uint8_t RESERVED45[3];
    union {
        __IO uint16_t ACSA;
        stc_mft_acsa_field_t ACSA_f;
        struct {
            __IO  uint8_t ACSAL;
            __IO  uint8_t ACSAH;
        };
        __IO uint16_t ADCMP_ACSA;
        stc_mft_adcmp_acsa_field_t ADCMP_ACSA_f;
        struct {
            __IO  uint8_t ADCMP_ACSAL;
            __IO  uint8_t ADCMP_ACSAH;
        };
    };
        __IO  uint8_t RESERVED46[2];
    union {
        __IO uint16_t ATSA;
        stc_mft_atsa_field_t ATSA_f;
        struct {
            __IO  uint8_t ATSAL;
            __IO  uint8_t ATSAH;
        };
        __IO uint16_t ADCMP_ATSA;
        stc_mft_adcmp_atsa_field_t ADCMP_ATSA_f;
        struct {
            __IO  uint8_t ADCMP_ATSAL;
            __IO  uint8_t ADCMP_ATSAH;
        };
    };
} FM_MFT_TypeDef, FM3_MFT_TypeDef;

