lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
/******************************************************************************
 ** MFT_ADCMP_MODULE
 ** 
 **   register structur
 ******************************************************************************/
typedef struct
{
        __IO  uint8_t RESERVED47[160];
    union {
        __IO uint16_t ACCP0;
        struct {
            __IO  uint8_t ACCP0L;
            __IO  uint8_t ACCP0H;
        };
    };
        __IO  uint8_t RESERVED48[2];
    union {
        __IO uint16_t ACCPDN0;
        struct {
            __IO  uint8_t ACCPDN0L;
            __IO  uint8_t ACCPDN0H;
        };
    };
        __IO  uint8_t RESERVED49[2];
    union {
        __IO uint16_t ACCP1;
        struct {
            __IO  uint8_t ACCP1L;
            __IO  uint8_t ACCP1H;
        };
    };
        __IO  uint8_t RESERVED50[2];
    union {
        __IO uint16_t ACCPDN1;
        struct {
            __IO  uint8_t ACCPDN1L;
            __IO  uint8_t ACCPDN1H;
        };
    };
        __IO  uint8_t RESERVED51[2];
    union {
        __IO uint16_t ACCP2;
        struct {
            __IO  uint8_t ACCP2L;
            __IO  uint8_t ACCP2H;
        };
    };
        __IO  uint8_t RESERVED52[2];
    union {
        __IO uint16_t ACCPDN2;
        struct {
            __IO  uint8_t ACCPDN2L;
            __IO  uint8_t ACCPDN2H;
        };
    };
        __IO  uint8_t RESERVED53[2];
    union {
        __IO  uint8_t ACSB;
        stc_mft_adcmp_acsb_field_t ACSB_f;
    };
        __IO  uint8_t RESERVED54[3];
    union {
        __IO uint16_t ACSA;
        stc_mft_adcmp_acsa_field_t ACSA_f;
        struct {
            __IO  uint8_t ACSAL;
            __IO  uint8_t ACSAH;
        };
    };
        __IO  uint8_t RESERVED55[2];
    union {
        __IO uint16_t ATSA;
        stc_mft_adcmp_atsa_field_t ATSA_f;
        struct {
            __IO  uint8_t ATSAL;
            __IO  uint8_t ATSAH;
        };
    };
} FM_MFT_ADCMP_TypeDef, FM3_MFT_ADCMP_TypeDef;

/******************************************************************************
 ** MFT_FRT_MODULE
 ** 
 **   register structur
 ******************************************************************************/
typedef struct
{
        __IO  uint8_t RESERVED56[40];
    union {
        __IO uint16_t TCCP0;
        stc_mft_frt_tccp0_field_t TCCP0_f;
        struct {
            __IO  uint8_t TCCP0L;
            __IO  uint8_t TCCP0H;
        };
    };
        __IO  uint8_t RESERVED57[2];
    union {
        __IO uint16_t TCDT0;
        struct {
            __IO  uint8_t TCDT0L;
            __IO  uint8_t TCDT0H;
        };
    };
        __IO  uint8_t RESERVED58[2];
    union {
        __IO uint16_t TCSA0;
        stc_mft_frt_tcsa0_field_t TCSA0_f;
        struct {
            __IO  uint8_t TCSA0L;
            __IO  uint8_t TCSA0H;
        };
    };
        __IO  uint8_t RESERVED59[2];
    union {
        __IO uint16_t TCSB0;
        stc_mft_frt_tcsb0_field_t TCSB0_f;
        struct {
            __IO  uint8_t TCSB0L;
            __IO  uint8_t TCSB0H;
        };
    };
        __IO  uint8_t RESERVED60[2];
    union {
        __IO uint16_t TCCP1;
        stc_mft_frt_tccp1_field_t TCCP1_f;
        struct {
            __IO  uint8_t TCCP1L;
            __IO  uint8_t TCCP1H;
        };
    };
        __IO  uint8_t RESERVED61[2];
    union {
        __IO uint16_t TCDT1;
        struct {
            __IO  uint8_t TCDT1L;
            __IO  uint8_t TCDT1H;
        };
    };
        __IO  uint8_t RESERVED62[2];
    union {
        __IO uint16_t TCSA1;
        stc_mft_frt_tcsa1_field_t TCSA1_f;
        struct {
            __IO  uint8_t TCSA1L;
            __IO  uint8_t TCSA1H;
        };
    };
        __IO  uint8_t RESERVED63[2];
    union {
        __IO uint16_t TCSB1;
        stc_mft_frt_tcsb1_field_t TCSB1_f;
        struct {
            __IO  uint8_t TCSB1L;
            __IO  uint8_t TCSB1H;
        };
    };
        __IO  uint8_t RESERVED64[2];
    union {
        __IO uint16_t TCCP2;
        stc_mft_frt_tccp2_field_t TCCP2_f;
        struct {
            __IO  uint8_t TCCP2L;
            __IO  uint8_t TCCP2H;
        };
    };
        __IO  uint8_t RESERVED65[2];
    union {
        __IO uint16_t TCDT2;
        struct {
            __IO  uint8_t TCDT2L;
            __IO  uint8_t TCDT2H;
        };
    };
        __IO  uint8_t RESERVED66[2];
    union {
        __IO uint16_t TCSA2;
        stc_mft_frt_tcsa2_field_t TCSA2_f;
        struct {
            __IO  uint8_t TCSA2L;
            __IO  uint8_t TCSA2H;
        };
    };
        __IO  uint8_t RESERVED67[2];
    union {
        __IO uint16_t TCSB2;
        stc_mft_frt_tcsb2_field_t TCSB2_f;
        struct {
            __IO  uint8_t TCSB2L;
            __IO  uint8_t TCSB2H;
        };
    };
} FM_MFT_FRT_TypeDef, FM3_MFT_FRT_TypeDef;

/******************************************************************************
 ** MFT_ICU_MODULE
 ** 
 **   register structur
 ******************************************************************************/
typedef struct
{
        __IO  uint8_t RESERVED68[96];
    union {
        __IO  uint8_t ICFS10;
        stc_mft_icu_icfs10_field_t ICFS10_f;
    };
    union {
        __IO  uint8_t ICFS32;
        stc_mft_icu_icfs32_field_t ICFS32_f;
    };
        __IO  uint8_t RESERVED69[6];
    union {
        __IO uint16_t ICCP0;
        struct {
            __IO  uint8_t ICCP0L;
            __IO  uint8_t ICCP0H;
        };
    };
        __IO  uint8_t RESERVED70[2];
    union {
        __IO uint16_t ICCP1;
        struct {
            __IO  uint8_t ICCP1L;
            __IO  uint8_t ICCP1H;
        };
    };
        __IO  uint8_t RESERVED71[2];
    union {
        __IO uint16_t ICCP2;
        struct {
            __IO  uint8_t ICCP2L;
            __IO  uint8_t ICCP2H;
        };
    };
        __IO  uint8_t RESERVED72[2];
    union {
        __IO uint16_t ICCP3;
        struct {
            __IO  uint8_t ICCP3L;
            __IO  uint8_t ICCP3H;
        };
    };
        __IO  uint8_t RESERVED73[2];
    union {
        __IO  uint8_t ICSA10;
        stc_mft_icu_icsa10_field_t ICSA10_f;
    };
    union {
        __IO  uint8_t ICSB10;
        stc_mft_icu_icsb10_field_t ICSB10_f;
    };
        __IO  uint8_t RESERVED74[2];
    union {
        __IO  uint8_t ICSA32;
        stc_mft_icu_icsa32_field_t ICSA32_f;
    };
    union {
        __IO  uint8_t ICSB32;
        stc_mft_icu_icsb32_field_t ICSB32_f;
    };
} FM_MFT_ICU_TypeDef, FM3_MFT_ICU_TypeDef;

