lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define FM_BT2_PWM                                ((FM_BT_PWM_TypeDef *)FM3_BT2_BASE)
#define FM3_BT2_RT                                ((FM_BT_RT_TypeDef *)FM3_BT2_BASE)
#define FM_BT2_RT                                 ((FM_BT_RT_TypeDef *)FM3_BT2_BASE)
#define FM3_BT3                                   ((FM_BT_TypeDef *)FM3_BT3_BASE)
#define FM_BT3                                    ((FM_BT_TypeDef *)FM3_BT3_BASE)
#define FM3_BT3_PPG                               ((FM_BT_PPG_TypeDef *)FM3_BT3_BASE)
#define FM_BT3_PPG                                ((FM_BT_PPG_TypeDef *)FM3_BT3_BASE)
#define FM3_BT3_PWC                               ((FM_BT_PWC_TypeDef *)FM3_BT3_BASE)
#define FM_BT3_PWC                                ((FM_BT_PWC_TypeDef *)FM3_BT3_BASE)
#define FM3_BT3_PWM                               ((FM_BT_PWM_TypeDef *)FM3_BT3_BASE)
#define FM_BT3_PWM                                ((FM_BT_PWM_TypeDef *)FM3_BT3_BASE)
#define FM3_BT3_RT                                ((FM_BT_RT_TypeDef *)FM3_BT3_BASE)
#define FM_BT3_RT                                 ((FM_BT_RT_TypeDef *)FM3_BT3_BASE)
#define FM3_BT4                                   ((FM_BT_TypeDef *)FM3_BT4_BASE)
#define FM_BT4                                    ((FM_BT_TypeDef *)FM3_BT4_BASE)
#define FM3_BT4_PPG                               ((FM_BT_PPG_TypeDef *)FM3_BT4_BASE)
#define FM_BT4_PPG                                ((FM_BT_PPG_TypeDef *)FM3_BT4_BASE)
#define FM3_BT4_PWC                               ((FM_BT_PWC_TypeDef *)FM3_BT4_BASE)
#define FM_BT4_PWC                                ((FM_BT_PWC_TypeDef *)FM3_BT4_BASE)
#define FM3_BT4_PWM                               ((FM_BT_PWM_TypeDef *)FM3_BT4_BASE)
#define FM_BT4_PWM                                ((FM_BT_PWM_TypeDef *)FM3_BT4_BASE)
#define FM3_BT4_RT                                ((FM_BT_RT_TypeDef *)FM3_BT4_BASE)
#define FM_BT4_RT                                 ((FM_BT_RT_TypeDef *)FM3_BT4_BASE)
#define FM3_BT5                                   ((FM_BT_TypeDef *)FM3_BT5_BASE)
#define FM_BT5                                    ((FM_BT_TypeDef *)FM3_BT5_BASE)
#define FM3_BT5_PPG                               ((FM_BT_PPG_TypeDef *)FM3_BT5_BASE)
#define FM_BT5_PPG                                ((FM_BT_PPG_TypeDef *)FM3_BT5_BASE)
#define FM3_BT5_PWC                               ((FM_BT_PWC_TypeDef *)FM3_BT5_BASE)
#define FM_BT5_PWC                                ((FM_BT_PWC_TypeDef *)FM3_BT5_BASE)
#define FM3_BT5_PWM                               ((FM_BT_PWM_TypeDef *)FM3_BT5_BASE)
#define FM_BT5_PWM                                ((FM_BT_PWM_TypeDef *)FM3_BT5_BASE)
#define FM3_BT5_RT                                ((FM_BT_RT_TypeDef *)FM3_BT5_BASE)
#define FM_BT5_RT                                 ((FM_BT_RT_TypeDef *)FM3_BT5_BASE)
#define FM3_BT6                                   ((FM_BT_TypeDef *)FM3_BT6_BASE)
#define FM_BT6                                    ((FM_BT_TypeDef *)FM3_BT6_BASE)
#define FM3_BT6_PPG                               ((FM_BT_PPG_TypeDef *)FM3_BT6_BASE)
#define FM_BT6_PPG                                ((FM_BT_PPG_TypeDef *)FM3_BT6_BASE)
#define FM3_BT6_PWC                               ((FM_BT_PWC_TypeDef *)FM3_BT6_BASE)
#define FM_BT6_PWC                                ((FM_BT_PWC_TypeDef *)FM3_BT6_BASE)
#define FM3_BT6_PWM                               ((FM_BT_PWM_TypeDef *)FM3_BT6_BASE)
#define FM_BT6_PWM                                ((FM_BT_PWM_TypeDef *)FM3_BT6_BASE)
#define FM3_BT6_RT                                ((FM_BT_RT_TypeDef *)FM3_BT6_BASE)
#define FM_BT6_RT                                 ((FM_BT_RT_TypeDef *)FM3_BT6_BASE)
#define FM3_BT7                                   ((FM_BT_TypeDef *)FM3_BT7_BASE)
#define FM_BT7                                    ((FM_BT_TypeDef *)FM3_BT7_BASE)
#define FM3_BT7_PPG                               ((FM_BT_PPG_TypeDef *)FM3_BT7_BASE)
#define FM_BT7_PPG                                ((FM_BT_PPG_TypeDef *)FM3_BT7_BASE)
#define FM3_BT7_PWC                               ((FM_BT_PWC_TypeDef *)FM3_BT7_BASE)
#define FM_BT7_PWC                                ((FM_BT_PWC_TypeDef *)FM3_BT7_BASE)
#define FM3_BT7_PWM                               ((FM_BT_PWM_TypeDef *)FM3_BT7_BASE)
#define FM_BT7_PWM                                ((FM_BT_PWM_TypeDef *)FM3_BT7_BASE)
#define FM3_BT7_RT                                ((FM_BT_RT_TypeDef *)FM3_BT7_BASE)
#define FM_BT7_RT                                 ((FM_BT_RT_TypeDef *)FM3_BT7_BASE)
#define FM3_BTIOSEL03                             ((FM_BTIOSEL03_TypeDef *)FM3_BTIOSEL03_BASE)
#define FM_BTIOSEL03                              ((FM_BTIOSEL03_TypeDef *)FM3_BTIOSEL03_BASE)
#define FM3_BTIOSEL47                             ((FM_BTIOSEL47_TypeDef *)FM3_BTIOSEL47_BASE)
#define FM_BTIOSEL47                              ((FM_BTIOSEL47_TypeDef *)FM3_BTIOSEL47_BASE)
#define FM3_CRC                                   ((FM_CRC_TypeDef *)FM3_CRC_BASE)
#define FM_CRC                                    ((FM_CRC_TypeDef *)FM3_CRC_BASE)
#define FM3_CRG                                   ((FM_CRG_TypeDef *)FM3_CRG_BASE)
#define FM_CRG                                    ((FM_CRG_TypeDef *)FM3_CRG_BASE)
#define FM3_CRTRIM                                ((FM_CRTRIM_TypeDef *)FM3_CRTRIM_BASE)
#define FM_CRTRIM                                 ((FM_CRTRIM_TypeDef *)FM3_CRTRIM_BASE)
#define FM3_DMAC                                  ((FM_DMAC_TypeDef *)FM3_DMAC_BASE)
#define FM_DMAC                                   ((FM_DMAC_TypeDef *)FM3_DMAC_BASE)
#define FM3_DS                                    ((FM_DS_TypeDef *)FM3_DS_BASE)
#define FM_DS                                     ((FM_DS_TypeDef *)FM3_DS_BASE)
#define FM3_DT                                    ((FM_DT_TypeDef *)FM3_DT_BASE)
#define FM_DT                                     ((FM_DT_TypeDef *)FM3_DT_BASE)
#define FM3_EXTI                                  ((FM_EXTI_TypeDef *)FM3_EXTI_BASE)
#define FM_EXTI                                   ((FM_EXTI_TypeDef *)FM3_EXTI_BASE)
#define FM3_FLASH_IF                              ((FM_FLASH_IF_TypeDef *)FM3_FLASH_IF_BASE)
#define FM_FLASH_IF                               ((FM_FLASH_IF_TypeDef *)FM3_FLASH_IF_BASE)
#define FM3_GPIO                                  ((FM_GPIO_TypeDef *)FM3_GPIO_BASE)
#define FM_GPIO                                   ((FM_GPIO_TypeDef *)FM3_GPIO_BASE)
#define FM3_HWWDT                                 ((FM_HWWDT_TypeDef *)FM3_HWWDT_BASE)
#define FM_HWWDT                                  ((FM_HWWDT_TypeDef *)FM3_HWWDT_BASE)
#define FM3_INTREQ                                ((FM_INTREQ_TypeDef *)FM3_INTREQ_BASE)
#define FM_INTREQ                                 ((FM_INTREQ_TypeDef *)FM3_INTREQ_BASE)
#define FM3_LVD                                   ((FM_LVD_TypeDef *)FM3_LVD_BASE)
#define FM_LVD                                    ((FM_LVD_TypeDef *)FM3_LVD_BASE)
#define FM3_MFS_NFC                               ((FM_MFS_NFC_TypeDef *)FM3_MFS_NFC_BASE)
#define FM_MFS_NFC                                ((FM_MFS_NFC_TypeDef *)FM3_MFS_NFC_BASE)
#define FM3_MFS0                                  ((FM_MFS_TypeDef *)FM3_MFS0_BASE)
#define FM_MFS0                                   ((FM_MFS_TypeDef *)FM3_MFS0_BASE)
#define FM3_MFS0_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM3_MFS0_BASE)
#define FM_MFS0_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM3_MFS0_BASE)
#define FM3_MFS0_I2C                              ((FM_MFS_I2C_TypeDef *)FM3_MFS0_BASE)
#define FM_MFS0_I2C                               ((FM_MFS_I2C_TypeDef *)FM3_MFS0_BASE)
#define FM3_MFS0_LIN                              ((FM_MFS_LIN_TypeDef *)FM3_MFS0_BASE)
#define FM_MFS0_LIN                               ((FM_MFS_LIN_TypeDef *)FM3_MFS0_BASE)
#define FM3_MFS0_UART                             ((FM_MFS_UART_TypeDef *)FM3_MFS0_BASE)
#define FM_MFS0_UART                              ((FM_MFS_UART_TypeDef *)FM3_MFS0_BASE)
#define FM3_MFS1                                  ((FM_MFS_TypeDef *)FM3_MFS1_BASE)
#define FM_MFS1                                   ((FM_MFS_TypeDef *)FM3_MFS1_BASE)
#define FM3_MFS1_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM3_MFS1_BASE)
#define FM_MFS1_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM3_MFS1_BASE)
#define FM3_MFS1_I2C                              ((FM_MFS_I2C_TypeDef *)FM3_MFS1_BASE)
#define FM_MFS1_I2C                               ((FM_MFS_I2C_TypeDef *)FM3_MFS1_BASE)
#define FM3_MFS1_LIN                              ((FM_MFS_LIN_TypeDef *)FM3_MFS1_BASE)
#define FM_MFS1_LIN                               ((FM_MFS_LIN_TypeDef *)FM3_MFS1_BASE)
#define FM3_MFS1_UART                             ((FM_MFS_UART_TypeDef *)FM3_MFS1_BASE)
#define FM_MFS1_UART                              ((FM_MFS_UART_TypeDef *)FM3_MFS1_BASE)
#define FM3_MFS3                                  ((FM_MFS_TypeDef *)FM3_MFS3_BASE)
#define FM_MFS3                                   ((FM_MFS_TypeDef *)FM3_MFS3_BASE)
#define FM3_MFS3_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM3_MFS3_BASE)
#define FM_MFS3_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM3_MFS3_BASE)
#define FM3_MFS3_I2C                              ((FM_MFS_I2C_TypeDef *)FM3_MFS3_BASE)
#define FM_MFS3_I2C                               ((FM_MFS_I2C_TypeDef *)FM3_MFS3_BASE)
#define FM3_MFS3_LIN                              ((FM_MFS_LIN_TypeDef *)FM3_MFS3_BASE)
#define FM_MFS3_LIN                               ((FM_MFS_LIN_TypeDef *)FM3_MFS3_BASE)
#define FM3_MFS3_UART                             ((FM_MFS_UART_TypeDef *)FM3_MFS3_BASE)
#define FM_MFS3_UART                              ((FM_MFS_UART_TypeDef *)FM3_MFS3_BASE)
#define FM3_MFS5                                  ((FM_MFS_TypeDef *)FM3_MFS5_BASE)
#define FM_MFS5                                   ((FM_MFS_TypeDef *)FM3_MFS5_BASE)
#define FM3_MFS5_LIN                              ((FM_MFS_LIN_TypeDef *)FM3_MFS5_BASE)
#define FM_MFS5_LIN                               ((FM_MFS_LIN_TypeDef *)FM3_MFS5_BASE)
#define FM3_MFS5_UART                             ((FM_MFS_UART_TypeDef *)FM3_MFS5_BASE)
#define FM_MFS5_UART                              ((FM_MFS_UART_TypeDef *)FM3_MFS5_BASE)
#define FM3_MFT_PPG                               ((FM_MFT_PPG_TypeDef *)FM3_MFT_PPG_BASE)
#define FM_MFT_PPG                                ((FM_MFT_PPG_TypeDef *)FM3_MFT_PPG_BASE)
#define FM3_MFT0                                  ((FM_MFT_TypeDef *)FM3_MFT0_BASE)
#define FM_MFT0                                   ((FM_MFT_TypeDef *)FM3_MFT0_BASE)
#define FM3_MFT0_ADCMP                            ((FM_MFT_ADCMP_TypeDef *)FM3_MFT0_BASE)
#define FM_MFT0_ADCMP                             ((FM_MFT_ADCMP_TypeDef *)FM3_MFT0_BASE)
#define FM3_MFT0_FRT                              ((FM_MFT_FRT_TypeDef *)FM3_MFT0_BASE)
#define FM_MFT0_FRT                               ((FM_MFT_FRT_TypeDef *)FM3_MFT0_BASE)
#define FM3_MFT0_ICU                              ((FM_MFT_ICU_TypeDef *)FM3_MFT0_BASE)
#define FM_MFT0_ICU                               ((FM_MFT_ICU_TypeDef *)FM3_MFT0_BASE)
#define FM3_MFT0_OCU                              ((FM_MFT_OCU_TypeDef *)FM3_MFT0_BASE)
#define FM_MFT0_OCU                               ((FM_MFT_OCU_TypeDef *)FM3_MFT0_BASE)
#define FM3_MFT0_WFG                              ((FM_MFT_WFG_TypeDef *)FM3_MFT0_BASE)
#define FM_MFT0_WFG                               ((FM_MFT_WFG_TypeDef *)FM3_MFT0_BASE)
#define FM3_QPRC0                                 ((FM_QPRC_TypeDef *)FM3_QPRC0_BASE)
#define FM_QPRC0                                  ((FM_QPRC_TypeDef *)FM3_QPRC0_BASE)
#define FM3_RTC                                   ((FM_RTC_TypeDef *)FM3_RTC_BASE)
#define FM_RTC                                    ((FM_RTC_TypeDef *)FM3_RTC_BASE)
#define FM3_SBSSR                                 ((FM_SBSSR_TypeDef *)FM3_SBSSR_BASE)
#define FM_SBSSR                                  ((FM_SBSSR_TypeDef *)FM3_SBSSR_BASE)
#define FM3_SWWDT                                 ((FM_SWWDT_TypeDef *)FM3_SWWDT_BASE)
#define FM_SWWDT                                  ((FM_SWWDT_TypeDef *)FM3_SWWDT_BASE)
#define FM3_UNIQUE_ID                             ((FM_UNIQUE_ID_TypeDef *)FM3_UNIQUE_ID_BASE)
#define FM_UNIQUE_ID                              ((FM_UNIQUE_ID_TypeDef *)FM3_UNIQUE_ID_BASE)
#define FM3_USB0                                  ((FM_USB_TypeDef *)FM3_USB0_BASE)
#define FM_USB0                                   ((FM_USB_TypeDef *)FM3_USB0_BASE)
#define FM3_USBCLK                                ((FM_USBCLK_TypeDef *)FM3_USBCLK_BASE)
#define FM_USBCLK                                 ((FM_USBCLK_TypeDef *)FM3_USBCLK_BASE)
#define FM3_WC                                    ((FM_WC_TypeDef *)FM3_WC_BASE)
#define FM_WC                                     ((FM_WC_TypeDef *)FM3_WC_BASE)
#define FM3_WORKFLASH_IF                          ((FM_WORKFLASH_IF_TypeDef *)FM3_WORKFLASH_IF_BASE)
#define FM_WORKFLASH_IF                           ((FM_WORKFLASH_IF_TypeDef *)FM3_WORKFLASH_IF_BASE)
/******************************************************************************
 ** Register Definitions
 ** 
 ******************************************************************************/
/******************************************************************************
 ** ADC Registers ADC0
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_ADC0_ADSR                              *((volatile  uint8_t*)(0x40027000UL))
#define FM3_ADC0_ADSR                             *((volatile  uint8_t*)(0x40027000UL))
#define FM_ADC0_ADCR                              *((volatile  uint8_t*)(0x40027001UL))
#define FM3_ADC0_ADCR                             *((volatile  uint8_t*)(0x40027001UL))
#define FM_ADC0_SFNS                              *((volatile  uint8_t*)(0x40027008UL))
#define FM3_ADC0_SFNS                             *((volatile  uint8_t*)(0x40027008UL))
#define FM_ADC0_SCCR                              *((volatile  uint8_t*)(0x40027009UL))
#define FM3_ADC0_SCCR                             *((volatile  uint8_t*)(0x40027009UL))
#define FM_ADC0_SCFD                              *((volatile uint32_t*)(0x4002700CUL))
#define FM3_ADC0_SCFD                             *((volatile uint32_t*)(0x4002700CUL))
#define FM_ADC0_SCFD_FDAS1                        *((volatile uint32_t*)(0x4002700CUL))
#define FM3_ADC0_SCFD_FDAS1                       *((volatile uint32_t*)(0x4002700CUL))
#define FM_ADC0_SCIS23                            *((volatile uint16_t*)(0x40027010UL))
#define FM3_ADC0_SCIS23                           *((volatile uint16_t*)(0x40027010UL))
#define FM_ADC0_SCIS01                            *((volatile uint16_t*)(0x40027014UL))
#define FM3_ADC0_SCIS01                           *((volatile uint16_t*)(0x40027014UL))
#define FM_ADC0_PFNS                              *((volatile  uint8_t*)(0x40027018UL))
#define FM3_ADC0_PFNS                             *((volatile  uint8_t*)(0x40027018UL))
#define FM_ADC0_PCCR                              *((volatile  uint8_t*)(0x40027019UL))
#define FM3_ADC0_PCCR                             *((volatile  uint8_t*)(0x40027019UL))
#define FM_ADC0_PCFD                              *((volatile uint32_t*)(0x4002701CUL))
#define FM3_ADC0_PCFD                             *((volatile uint32_t*)(0x4002701CUL))
#define FM_ADC0_PCFD_FDAS1                        *((volatile uint32_t*)(0x4002701CUL))
#define FM3_ADC0_PCFD_FDAS1                       *((volatile uint32_t*)(0x4002701CUL))
#define FM_ADC0_PCIS                              *((volatile  uint8_t*)(0x40027020UL))
#define FM3_ADC0_PCIS                             *((volatile  uint8_t*)(0x40027020UL))
#define FM_ADC0_CMPCR                             *((volatile  uint8_t*)(0x40027024UL))
#define FM3_ADC0_CMPCR                            *((volatile  uint8_t*)(0x40027024UL))
#define FM_ADC0_CMPD                              *((volatile uint16_t*)(0x40027026UL))
#define FM3_ADC0_CMPD                             *((volatile uint16_t*)(0x40027026UL))
#define FM_ADC0_ADSS23                            *((volatile uint16_t*)(0x40027028UL))
#define FM3_ADC0_ADSS23                           *((volatile uint16_t*)(0x40027028UL))
#define FM_ADC0_ADSS01                            *((volatile uint16_t*)(0x4002702CUL))
#define FM3_ADC0_ADSS01                           *((volatile uint16_t*)(0x4002702CUL))
#define FM_ADC0_ADST01                            *((volatile uint16_t*)(0x40027030UL))
#define FM3_ADC0_ADST01                           *((volatile uint16_t*)(0x40027030UL))
#define FM_ADC0_ADCT                              *((volatile  uint8_t*)(0x40027034UL))
#define FM3_ADC0_ADCT                             *((volatile  uint8_t*)(0x40027034UL))
#define FM_ADC0_PRTSL                             *((volatile  uint8_t*)(0x40027038UL))
#define FM3_ADC0_PRTSL                            *((volatile  uint8_t*)(0x40027038UL))
#define FM_ADC0_SCTSL                             *((volatile  uint8_t*)(0x40027039UL))
#define FM3_ADC0_SCTSL                            *((volatile  uint8_t*)(0x40027039UL))
#define FM_ADC0_ADCEN                             *((volatile  uint8_t*)(0x4002703CUL))
#define FM3_ADC0_ADCEN                            *((volatile  uint8_t*)(0x4002703CUL))

