lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
/******************************************************************************
 ** HWWDT Registers HWWDT
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_HWWDT_WDG_LDR                          *((volatile uint32_t*)(0x40011000UL))
#define FM3_HWWDT_WDG_LDR                         *((volatile uint32_t*)(0x40011000UL))
#define FM_HWWDT_WDG_VLR                          *((volatile uint32_t*)(0x40011004UL))
#define FM3_HWWDT_WDG_VLR                         *((volatile uint32_t*)(0x40011004UL))
#define FM_HWWDT_WDG_CTL                          *((volatile uint32_t*)(0x40011008UL))
#define FM3_HWWDT_WDG_CTL                         *((volatile uint32_t*)(0x40011008UL))
#define FM_HWWDT_WDG_ICL                          *((volatile uint32_t*)(0x4001100CUL))
#define FM3_HWWDT_WDG_ICL                         *((volatile uint32_t*)(0x4001100CUL))
#define FM_HWWDT_WDG_RIS                          *((volatile uint32_t*)(0x40011010UL))
#define FM3_HWWDT_WDG_RIS                         *((volatile uint32_t*)(0x40011010UL))
#define FM_HWWDT_WDG_LCK                          *((volatile uint32_t*)(0x40011C00UL))
#define FM3_HWWDT_WDG_LCK                         *((volatile uint32_t*)(0x40011C00UL))

/******************************************************************************
 ** INTREQ Registers INTREQ
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_INTREQ_DRQSEL                          *((volatile uint32_t*)(0x40031000UL))
#define FM3_INTREQ_DRQSEL                         *((volatile uint32_t*)(0x40031000UL))
#define FM_INTREQ_ODDPKS                          *((volatile  uint8_t*)(0x4003100BUL))
#define FM3_INTREQ_ODDPKS                         *((volatile  uint8_t*)(0x4003100BUL))
#define FM_INTREQ_IRQCMODE                        *((volatile uint32_t*)(0x4003100CUL))
#define FM3_INTREQ_IRQCMODE                       *((volatile uint32_t*)(0x4003100CUL))
#define FM_INTREQ_EXC02MON                        *((volatile uint32_t*)(0x40031010UL))
#define FM3_INTREQ_EXC02MON                       *((volatile uint32_t*)(0x40031010UL))
#define FM_INTREQ_IRQ00MON                        *((volatile uint32_t*)(0x40031014UL))
#define FM3_INTREQ_IRQ00MON                       *((volatile uint32_t*)(0x40031014UL))
#define FM_INTREQ_IRQ01MON                        *((volatile uint32_t*)(0x40031018UL))
#define FM3_INTREQ_IRQ01MON                       *((volatile uint32_t*)(0x40031018UL))
#define FM_INTREQ_IRQ02MON                        *((volatile uint32_t*)(0x4003101CUL))
#define FM3_INTREQ_IRQ02MON                       *((volatile uint32_t*)(0x4003101CUL))
#define FM_INTREQ_IRQ03MON                        *((volatile uint32_t*)(0x40031020UL))
#define FM3_INTREQ_IRQ03MON                       *((volatile uint32_t*)(0x40031020UL))
#define FM_INTREQ_IRQ04MON                        *((volatile uint32_t*)(0x40031024UL))
#define FM3_INTREQ_IRQ04MON                       *((volatile uint32_t*)(0x40031024UL))
#define FM_INTREQ_IRQ05MON                        *((volatile uint32_t*)(0x40031028UL))
#define FM3_INTREQ_IRQ05MON                       *((volatile uint32_t*)(0x40031028UL))
#define FM_INTREQ_IRQ06MON                        *((volatile uint32_t*)(0x4003102CUL))
#define FM3_INTREQ_IRQ06MON                       *((volatile uint32_t*)(0x4003102CUL))
#define FM_INTREQ_IRQ07MON                        *((volatile uint32_t*)(0x40031030UL))
#define FM3_INTREQ_IRQ07MON                       *((volatile uint32_t*)(0x40031030UL))
#define FM_INTREQ_IRQ08MON                        *((volatile uint32_t*)(0x40031034UL))
#define FM3_INTREQ_IRQ08MON                       *((volatile uint32_t*)(0x40031034UL))
#define FM_INTREQ_IRQ09MON                        *((volatile uint32_t*)(0x40031038UL))
#define FM3_INTREQ_IRQ09MON                       *((volatile uint32_t*)(0x40031038UL))
#define FM_INTREQ_IRQ10MON                        *((volatile uint32_t*)(0x4003103CUL))
#define FM3_INTREQ_IRQ10MON                       *((volatile uint32_t*)(0x4003103CUL))
#define FM_INTREQ_IRQ11MON                        *((volatile uint32_t*)(0x40031040UL))
#define FM3_INTREQ_IRQ11MON                       *((volatile uint32_t*)(0x40031040UL))
#define FM_INTREQ_IRQ12MON                        *((volatile uint32_t*)(0x40031044UL))
#define FM3_INTREQ_IRQ12MON                       *((volatile uint32_t*)(0x40031044UL))
#define FM_INTREQ_IRQ13MON                        *((volatile uint32_t*)(0x40031048UL))
#define FM3_INTREQ_IRQ13MON                       *((volatile uint32_t*)(0x40031048UL))
#define FM_INTREQ_IRQ14MON                        *((volatile uint32_t*)(0x4003104CUL))
#define FM3_INTREQ_IRQ14MON                       *((volatile uint32_t*)(0x4003104CUL))
#define FM_INTREQ_IRQ15MON                        *((volatile uint32_t*)(0x40031050UL))
#define FM3_INTREQ_IRQ15MON                       *((volatile uint32_t*)(0x40031050UL))
#define FM_INTREQ_IRQ16MON                        *((volatile uint32_t*)(0x40031054UL))
#define FM3_INTREQ_IRQ16MON                       *((volatile uint32_t*)(0x40031054UL))
#define FM_INTREQ_IRQ17MON                        *((volatile uint32_t*)(0x40031058UL))
#define FM3_INTREQ_IRQ17MON                       *((volatile uint32_t*)(0x40031058UL))
#define FM_INTREQ_IRQ18MON                        *((volatile uint32_t*)(0x4003105CUL))
#define FM3_INTREQ_IRQ18MON                       *((volatile uint32_t*)(0x4003105CUL))
#define FM_INTREQ_IRQ19MON                        *((volatile uint32_t*)(0x40031060UL))
#define FM3_INTREQ_IRQ19MON                       *((volatile uint32_t*)(0x40031060UL))
#define FM_INTREQ_IRQ20MON                        *((volatile uint32_t*)(0x40031064UL))
#define FM3_INTREQ_IRQ20MON                       *((volatile uint32_t*)(0x40031064UL))
#define FM_INTREQ_IRQ21MON                        *((volatile uint32_t*)(0x40031068UL))
#define FM3_INTREQ_IRQ21MON                       *((volatile uint32_t*)(0x40031068UL))
#define FM_INTREQ_IRQ22MON                        *((volatile uint32_t*)(0x4003106CUL))
#define FM3_INTREQ_IRQ22MON                       *((volatile uint32_t*)(0x4003106CUL))
#define FM_INTREQ_IRQ23MON                        *((volatile uint32_t*)(0x40031070UL))
#define FM3_INTREQ_IRQ23MON                       *((volatile uint32_t*)(0x40031070UL))
#define FM_INTREQ_IRQ24MON                        *((volatile uint32_t*)(0x40031074UL))
#define FM3_INTREQ_IRQ24MON                       *((volatile uint32_t*)(0x40031074UL))
#define FM_INTREQ_IRQ25MON                        *((volatile uint32_t*)(0x40031078UL))
#define FM3_INTREQ_IRQ25MON                       *((volatile uint32_t*)(0x40031078UL))
#define FM_INTREQ_IRQ26MON                        *((volatile uint32_t*)(0x4003107CUL))
#define FM3_INTREQ_IRQ26MON                       *((volatile uint32_t*)(0x4003107CUL))
#define FM_INTREQ_IRQ27MON                        *((volatile uint32_t*)(0x40031080UL))
#define FM3_INTREQ_IRQ27MON                       *((volatile uint32_t*)(0x40031080UL))
#define FM_INTREQ_IRQ28MON                        *((volatile uint32_t*)(0x40031084UL))
#define FM3_INTREQ_IRQ28MON                       *((volatile uint32_t*)(0x40031084UL))
#define FM_INTREQ_IRQ29MON                        *((volatile uint32_t*)(0x40031088UL))
#define FM3_INTREQ_IRQ29MON                       *((volatile uint32_t*)(0x40031088UL))
#define FM_INTREQ_IRQ30MON                        *((volatile uint32_t*)(0x4003108CUL))
#define FM3_INTREQ_IRQ30MON                       *((volatile uint32_t*)(0x4003108CUL))
#define FM_INTREQ_IRQ31MON                        *((volatile uint32_t*)(0x40031090UL))
#define FM3_INTREQ_IRQ31MON                       *((volatile uint32_t*)(0x40031090UL))
#define FM_INTREQ_IRQ32MON                        *((volatile uint32_t*)(0x40031094UL))
#define FM3_INTREQ_IRQ32MON                       *((volatile uint32_t*)(0x40031094UL))
#define FM_INTREQ_IRQ33MON                        *((volatile uint32_t*)(0x40031098UL))
#define FM3_INTREQ_IRQ33MON                       *((volatile uint32_t*)(0x40031098UL))
#define FM_INTREQ_IRQ34MON                        *((volatile uint32_t*)(0x4003109CUL))
#define FM3_INTREQ_IRQ34MON                       *((volatile uint32_t*)(0x4003109CUL))
#define FM_INTREQ_IRQ35MON                        *((volatile uint32_t*)(0x400310A0UL))
#define FM3_INTREQ_IRQ35MON                       *((volatile uint32_t*)(0x400310A0UL))
#define FM_INTREQ_IRQ36MON                        *((volatile uint32_t*)(0x400310A4UL))
#define FM3_INTREQ_IRQ36MON                       *((volatile uint32_t*)(0x400310A4UL))
#define FM_INTREQ_IRQ37MON                        *((volatile uint32_t*)(0x400310A8UL))
#define FM3_INTREQ_IRQ37MON                       *((volatile uint32_t*)(0x400310A8UL))
#define FM_INTREQ_IRQ38MON                        *((volatile uint32_t*)(0x400310ACUL))
#define FM3_INTREQ_IRQ38MON                       *((volatile uint32_t*)(0x400310ACUL))
#define FM_INTREQ_IRQ39MON                        *((volatile uint32_t*)(0x400310B0UL))
#define FM3_INTREQ_IRQ39MON                       *((volatile uint32_t*)(0x400310B0UL))
#define FM_INTREQ_IRQ40MON                        *((volatile uint32_t*)(0x400310B4UL))
#define FM3_INTREQ_IRQ40MON                       *((volatile uint32_t*)(0x400310B4UL))
#define FM_INTREQ_IRQ41MON                        *((volatile uint32_t*)(0x400310B8UL))
#define FM3_INTREQ_IRQ41MON                       *((volatile uint32_t*)(0x400310B8UL))
#define FM_INTREQ_IRQ42MON                        *((volatile uint32_t*)(0x400310BCUL))
#define FM3_INTREQ_IRQ42MON                       *((volatile uint32_t*)(0x400310BCUL))
#define FM_INTREQ_IRQ43MON                        *((volatile uint32_t*)(0x400310C0UL))
#define FM3_INTREQ_IRQ43MON                       *((volatile uint32_t*)(0x400310C0UL))
#define FM_INTREQ_IRQ44MON                        *((volatile uint32_t*)(0x400310C4UL))
#define FM3_INTREQ_IRQ44MON                       *((volatile uint32_t*)(0x400310C4UL))
#define FM_INTREQ_IRQ45MON                        *((volatile uint32_t*)(0x400310C8UL))
#define FM3_INTREQ_IRQ45MON                       *((volatile uint32_t*)(0x400310C8UL))
#define FM_INTREQ_IRQ46MON                        *((volatile uint32_t*)(0x400310CCUL))
#define FM3_INTREQ_IRQ46MON                       *((volatile uint32_t*)(0x400310CCUL))
#define FM_INTREQ_IRQ47MON                        *((volatile uint32_t*)(0x400310D0UL))
#define FM3_INTREQ_IRQ47MON                       *((volatile uint32_t*)(0x400310D0UL))
#define FM_INTREQ_DRQSEL1                         *((volatile uint32_t*)(0x40031200UL))
#define FM3_INTREQ_DRQSEL1                        *((volatile uint32_t*)(0x40031200UL))
#define FM_INTREQ_DQESEL                          *((volatile uint32_t*)(0x40031204UL))
#define FM3_INTREQ_DQESEL                         *((volatile uint32_t*)(0x40031204UL))
#define FM_INTREQ_ODDPKS1                         *((volatile  uint8_t*)(0x4003120FUL))
#define FM3_INTREQ_ODDPKS1                        *((volatile  uint8_t*)(0x4003120FUL))
#define FM_INTREQ_RCINTSEL0                       *((volatile uint32_t*)(0x40031210UL))
#define FM3_INTREQ_RCINTSEL0                      *((volatile uint32_t*)(0x40031210UL))
#define FM_INTREQ_RCINTSEL1                       *((volatile uint32_t*)(0x40031214UL))
#define FM3_INTREQ_RCINTSEL1                      *((volatile uint32_t*)(0x40031214UL))

