lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
/******************************************************************************
 ** MFT Registers MFT0
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_MFT0_OCU_OCCP0                         *((volatile uint16_t*)(0x40020000UL))
#define FM3_MFT0_OCU_OCCP0                        *((volatile uint16_t*)(0x40020000UL))
#define FM_MFT0_OCU_OCCP1                         *((volatile uint16_t*)(0x40020004UL))
#define FM3_MFT0_OCU_OCCP1                        *((volatile uint16_t*)(0x40020004UL))
#define FM_MFT0_OCU_OCCP2                         *((volatile uint16_t*)(0x40020008UL))
#define FM3_MFT0_OCU_OCCP2                        *((volatile uint16_t*)(0x40020008UL))
#define FM_MFT0_OCU_OCCP3                         *((volatile uint16_t*)(0x4002000CUL))
#define FM3_MFT0_OCU_OCCP3                        *((volatile uint16_t*)(0x4002000CUL))
#define FM_MFT0_OCU_OCCP4                         *((volatile uint16_t*)(0x40020010UL))
#define FM3_MFT0_OCU_OCCP4                        *((volatile uint16_t*)(0x40020010UL))
#define FM_MFT0_OCU_OCCP5                         *((volatile uint16_t*)(0x40020014UL))
#define FM3_MFT0_OCU_OCCP5                        *((volatile uint16_t*)(0x40020014UL))
#define FM_MFT0_OCU_OCSA10                        *((volatile  uint8_t*)(0x40020018UL))
#define FM3_MFT0_OCU_OCSA10                       *((volatile  uint8_t*)(0x40020018UL))
#define FM_MFT0_OCU_OCSB10                        *((volatile  uint8_t*)(0x40020019UL))
#define FM3_MFT0_OCU_OCSB10                       *((volatile  uint8_t*)(0x40020019UL))
#define FM_MFT0_OCU_OCSA32                        *((volatile  uint8_t*)(0x4002001CUL))
#define FM3_MFT0_OCU_OCSA32                       *((volatile  uint8_t*)(0x4002001CUL))
#define FM_MFT0_OCU_OCSB32                        *((volatile  uint8_t*)(0x4002001DUL))
#define FM3_MFT0_OCU_OCSB32                       *((volatile  uint8_t*)(0x4002001DUL))
#define FM_MFT0_OCU_OCSA54                        *((volatile  uint8_t*)(0x40020020UL))
#define FM3_MFT0_OCU_OCSA54                       *((volatile  uint8_t*)(0x40020020UL))
#define FM_MFT0_OCU_OCSB54                        *((volatile  uint8_t*)(0x40020021UL))
#define FM3_MFT0_OCU_OCSB54                       *((volatile  uint8_t*)(0x40020021UL))
#define FM_MFT0_OCU_OCSC                          *((volatile  uint8_t*)(0x40020025UL))
#define FM3_MFT0_OCU_OCSC                         *((volatile  uint8_t*)(0x40020025UL))
#define FM_MFT0_FRT_TCCP0                         *((volatile uint16_t*)(0x40020028UL))
#define FM3_MFT0_FRT_TCCP0                        *((volatile uint16_t*)(0x40020028UL))
#define FM_MFT0_FRT_TCDT0                         *((volatile uint16_t*)(0x4002002CUL))
#define FM3_MFT0_FRT_TCDT0                        *((volatile uint16_t*)(0x4002002CUL))
#define FM_MFT0_FRT_TCSA0                         *((volatile uint16_t*)(0x40020030UL))
#define FM3_MFT0_FRT_TCSA0                        *((volatile uint16_t*)(0x40020030UL))
#define FM_MFT0_FRT_TCSB0                         *((volatile uint16_t*)(0x40020034UL))
#define FM3_MFT0_FRT_TCSB0                        *((volatile uint16_t*)(0x40020034UL))
#define FM_MFT0_FRT_TCCP1                         *((volatile uint16_t*)(0x40020038UL))
#define FM3_MFT0_FRT_TCCP1                        *((volatile uint16_t*)(0x40020038UL))
#define FM_MFT0_FRT_TCDT1                         *((volatile uint16_t*)(0x4002003CUL))
#define FM3_MFT0_FRT_TCDT1                        *((volatile uint16_t*)(0x4002003CUL))
#define FM_MFT0_FRT_TCSA1                         *((volatile uint16_t*)(0x40020040UL))
#define FM3_MFT0_FRT_TCSA1                        *((volatile uint16_t*)(0x40020040UL))
#define FM_MFT0_FRT_TCSB1                         *((volatile uint16_t*)(0x40020044UL))
#define FM3_MFT0_FRT_TCSB1                        *((volatile uint16_t*)(0x40020044UL))
#define FM_MFT0_FRT_TCCP2                         *((volatile uint16_t*)(0x40020048UL))
#define FM3_MFT0_FRT_TCCP2                        *((volatile uint16_t*)(0x40020048UL))
#define FM_MFT0_FRT_TCDT2                         *((volatile uint16_t*)(0x4002004CUL))
#define FM3_MFT0_FRT_TCDT2                        *((volatile uint16_t*)(0x4002004CUL))
#define FM_MFT0_FRT_TCSA2                         *((volatile uint16_t*)(0x40020050UL))
#define FM3_MFT0_FRT_TCSA2                        *((volatile uint16_t*)(0x40020050UL))
#define FM_MFT0_FRT_TCSB2                         *((volatile uint16_t*)(0x40020054UL))
#define FM3_MFT0_FRT_TCSB2                        *((volatile uint16_t*)(0x40020054UL))
#define FM_MFT0_OCU_OCFS10                        *((volatile  uint8_t*)(0x40020058UL))
#define FM3_MFT0_OCU_OCFS10                       *((volatile  uint8_t*)(0x40020058UL))
#define FM_MFT0_OCU_OCFS32                        *((volatile  uint8_t*)(0x40020059UL))
#define FM3_MFT0_OCU_OCFS32                       *((volatile  uint8_t*)(0x40020059UL))
#define FM_MFT0_OCU_OCFS54                        *((volatile  uint8_t*)(0x4002005CUL))
#define FM3_MFT0_OCU_OCFS54                       *((volatile  uint8_t*)(0x4002005CUL))
#define FM_MFT0_ICU_ICFS10                        *((volatile  uint8_t*)(0x40020060UL))
#define FM3_MFT0_ICU_ICFS10                       *((volatile  uint8_t*)(0x40020060UL))
#define FM_MFT0_ICU_ICFS32                        *((volatile  uint8_t*)(0x40020061UL))
#define FM3_MFT0_ICU_ICFS32                       *((volatile  uint8_t*)(0x40020061UL))
#define FM_MFT0_ICU_ICCP0                         *((volatile uint16_t*)(0x40020068UL))
#define FM3_MFT0_ICU_ICCP0                        *((volatile uint16_t*)(0x40020068UL))
#define FM_MFT0_ICU_ICCP1                         *((volatile uint16_t*)(0x4002006CUL))
#define FM3_MFT0_ICU_ICCP1                        *((volatile uint16_t*)(0x4002006CUL))
#define FM_MFT0_ICU_ICCP2                         *((volatile uint16_t*)(0x40020070UL))
#define FM3_MFT0_ICU_ICCP2                        *((volatile uint16_t*)(0x40020070UL))
#define FM_MFT0_ICU_ICCP3                         *((volatile uint16_t*)(0x40020074UL))
#define FM3_MFT0_ICU_ICCP3                        *((volatile uint16_t*)(0x40020074UL))
#define FM_MFT0_ICU_ICSA10                        *((volatile  uint8_t*)(0x40020078UL))
#define FM3_MFT0_ICU_ICSA10                       *((volatile  uint8_t*)(0x40020078UL))
#define FM_MFT0_ICU_ICSB10                        *((volatile  uint8_t*)(0x40020079UL))
#define FM3_MFT0_ICU_ICSB10                       *((volatile  uint8_t*)(0x40020079UL))
#define FM_MFT0_ICU_ICSA32                        *((volatile  uint8_t*)(0x4002007CUL))
#define FM3_MFT0_ICU_ICSA32                       *((volatile  uint8_t*)(0x4002007CUL))
#define FM_MFT0_ICU_ICSB32                        *((volatile  uint8_t*)(0x4002007DUL))
#define FM3_MFT0_ICU_ICSB32                       *((volatile  uint8_t*)(0x4002007DUL))
#define FM_MFT0_WFG_WFTM10                        *((volatile uint16_t*)(0x40020080UL))
#define FM3_MFT0_WFG_WFTM10                       *((volatile uint16_t*)(0x40020080UL))
#define FM_MFT0_WFG_WFTM32                        *((volatile uint16_t*)(0x40020084UL))
#define FM3_MFT0_WFG_WFTM32                       *((volatile uint16_t*)(0x40020084UL))
#define FM_MFT0_WFG_WFTM54                        *((volatile uint16_t*)(0x40020088UL))
#define FM3_MFT0_WFG_WFTM54                       *((volatile uint16_t*)(0x40020088UL))
#define FM_MFT0_WFG_WFSA10                        *((volatile uint16_t*)(0x4002008CUL))
#define FM3_MFT0_WFG_WFSA10                       *((volatile uint16_t*)(0x4002008CUL))
#define FM_MFT0_WFG_WFSA32                        *((volatile uint16_t*)(0x40020090UL))
#define FM3_MFT0_WFG_WFSA32                       *((volatile uint16_t*)(0x40020090UL))
#define FM_MFT0_WFG_WFSA54                        *((volatile uint16_t*)(0x40020094UL))
#define FM3_MFT0_WFG_WFSA54                       *((volatile uint16_t*)(0x40020094UL))
#define FM_MFT0_WFG_WFIR                          *((volatile uint16_t*)(0x40020098UL))
#define FM3_MFT0_WFG_WFIR                         *((volatile uint16_t*)(0x40020098UL))
#define FM_MFT0_WFG_NZCL                          *((volatile uint16_t*)(0x4002009CUL))
#define FM3_MFT0_WFG_NZCL                         *((volatile uint16_t*)(0x4002009CUL))
#define FM_MFT0_ADCMP_ACCP0                       *((volatile uint16_t*)(0x400200A0UL))
#define FM3_MFT0_ADCMP_ACCP0                      *((volatile uint16_t*)(0x400200A0UL))
#define FM_MFT0_ADCMP_ACCPDN0                     *((volatile uint16_t*)(0x400200A4UL))
#define FM3_MFT0_ADCMP_ACCPDN0                    *((volatile uint16_t*)(0x400200A4UL))
#define FM_MFT0_ADCMP_ACCP1                       *((volatile uint16_t*)(0x400200A8UL))
#define FM3_MFT0_ADCMP_ACCP1                      *((volatile uint16_t*)(0x400200A8UL))
#define FM_MFT0_ADCMP_ACCPDN1                     *((volatile uint16_t*)(0x400200ACUL))
#define FM3_MFT0_ADCMP_ACCPDN1                    *((volatile uint16_t*)(0x400200ACUL))
#define FM_MFT0_ADCMP_ACCP2                       *((volatile uint16_t*)(0x400200B0UL))
#define FM3_MFT0_ADCMP_ACCP2                      *((volatile uint16_t*)(0x400200B0UL))
#define FM_MFT0_ADCMP_ACCPDN2                     *((volatile uint16_t*)(0x400200B4UL))
#define FM3_MFT0_ADCMP_ACCPDN2                    *((volatile uint16_t*)(0x400200B4UL))
#define FM_MFT0_ADCMP_ACSB                        *((volatile  uint8_t*)(0x400200B8UL))
#define FM3_MFT0_ADCMP_ACSB                       *((volatile  uint8_t*)(0x400200B8UL))
#define FM_MFT0_ADCMP_ACSA                        *((volatile uint16_t*)(0x400200BCUL))
#define FM3_MFT0_ADCMP_ACSA                       *((volatile uint16_t*)(0x400200BCUL))
#define FM_MFT0_ADCMP_ATSA                        *((volatile uint16_t*)(0x400200C0UL))
#define FM3_MFT0_ADCMP_ATSA                       *((volatile uint16_t*)(0x400200C0UL))

