lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
/******************************************************************************
 ** QPRC Registers QPRC0
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_QPRC0_QPCR                             *((volatile uint16_t*)(0x40026000UL))
#define FM3_QPRC0_QPCR                            *((volatile uint16_t*)(0x40026000UL))
#define FM_QPRC0_QRCR                             *((volatile uint16_t*)(0x40026004UL))
#define FM3_QPRC0_QRCR                            *((volatile uint16_t*)(0x40026004UL))
#define FM_QPRC0_QPCCR                            *((volatile uint16_t*)(0x40026008UL))
#define FM3_QPRC0_QPCCR                           *((volatile uint16_t*)(0x40026008UL))
#define FM_QPRC0_QPRCR                            *((volatile uint16_t*)(0x4002600CUL))
#define FM3_QPRC0_QPRCR                           *((volatile uint16_t*)(0x4002600CUL))
#define FM_QPRC0_QMPR                             *((volatile uint16_t*)(0x40026010UL))
#define FM3_QPRC0_QMPR                            *((volatile uint16_t*)(0x40026010UL))
#define FM_QPRC0_QICRL                            *((volatile  uint8_t*)(0x40026014UL))
#define FM3_QPRC0_QICRL                           *((volatile  uint8_t*)(0x40026014UL))
#define FM_QPRC0_QICRH                            *((volatile  uint8_t*)(0x40026015UL))
#define FM3_QPRC0_QICRH                           *((volatile  uint8_t*)(0x40026015UL))
#define FM_QPRC0_QCR                              *((volatile uint16_t*)(0x40026018UL))
#define FM3_QPRC0_QCR                             *((volatile uint16_t*)(0x40026018UL))
#define FM_QPRC0_QECR                             *((volatile uint16_t*)(0x4002601CUL))
#define FM3_QPRC0_QECR                            *((volatile uint16_t*)(0x4002601CUL))
#define FM_QPRC0_QPRCRR                           *((volatile uint32_t*)(0x4002603CUL))
#define FM3_QPRC0_QPRCRR                          *((volatile uint32_t*)(0x4002603CUL))

/******************************************************************************
 ** RTC Registers RTC
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_RTC_WTCR1                              *((volatile uint32_t*)(0x4003B000UL))
#define FM3_RTC_WTCR1                             *((volatile uint32_t*)(0x4003B000UL))
#define FM_RTC_WTCR2                              *((volatile uint32_t*)(0x4003B004UL))
#define FM3_RTC_WTCR2                             *((volatile uint32_t*)(0x4003B004UL))
#define FM_RTC_WTBR                               *((volatile uint32_t*)(0x4003B008UL))
#define FM3_RTC_WTBR                              *((volatile uint32_t*)(0x4003B008UL))
#define FM_RTC_WTSR                               *((volatile  uint8_t*)(0x4003B00CUL))
#define FM3_RTC_WTSR                              *((volatile  uint8_t*)(0x4003B00CUL))
#define FM_RTC_WTMIR                              *((volatile  uint8_t*)(0x4003B00DUL))
#define FM3_RTC_WTMIR                             *((volatile  uint8_t*)(0x4003B00DUL))
#define FM_RTC_WTHR                               *((volatile  uint8_t*)(0x4003B00EUL))
#define FM3_RTC_WTHR                              *((volatile  uint8_t*)(0x4003B00EUL))
#define FM_RTC_WTDR                               *((volatile  uint8_t*)(0x4003B00FUL))
#define FM3_RTC_WTDR                              *((volatile  uint8_t*)(0x4003B00FUL))
#define FM_RTC_WTDW                               *((volatile  uint8_t*)(0x4003B010UL))
#define FM3_RTC_WTDW                              *((volatile  uint8_t*)(0x4003B010UL))
#define FM_RTC_WTMOR                              *((volatile  uint8_t*)(0x4003B011UL))
#define FM3_RTC_WTMOR                             *((volatile  uint8_t*)(0x4003B011UL))
#define FM_RTC_WTYR                               *((volatile  uint8_t*)(0x4003B012UL))
#define FM3_RTC_WTYR                              *((volatile  uint8_t*)(0x4003B012UL))
#define FM_RTC_ALMIR                              *((volatile  uint8_t*)(0x4003B015UL))
#define FM3_RTC_ALMIR                             *((volatile  uint8_t*)(0x4003B015UL))
#define FM_RTC_ALHR                               *((volatile  uint8_t*)(0x4003B016UL))
#define FM3_RTC_ALHR                              *((volatile  uint8_t*)(0x4003B016UL))
#define FM_RTC_ALDR                               *((volatile  uint8_t*)(0x4003B017UL))
#define FM3_RTC_ALDR                              *((volatile  uint8_t*)(0x4003B017UL))
#define FM_RTC_ALMOR                              *((volatile  uint8_t*)(0x4003B019UL))
#define FM3_RTC_ALMOR                             *((volatile  uint8_t*)(0x4003B019UL))
#define FM_RTC_ALYR                               *((volatile  uint8_t*)(0x4003B01AUL))
#define FM3_RTC_ALYR                              *((volatile  uint8_t*)(0x4003B01AUL))
#define FM_RTC_WTTR                               *((volatile uint32_t*)(0x4003B01CUL))
#define FM3_RTC_WTTR                              *((volatile uint32_t*)(0x4003B01CUL))
#define FM_RTC_WTCLKS                             *((volatile  uint8_t*)(0x4003B020UL))
#define FM3_RTC_WTCLKS                            *((volatile  uint8_t*)(0x4003B020UL))
#define FM_RTC_WTCLKM                             *((volatile  uint8_t*)(0x4003B021UL))
#define FM3_RTC_WTCLKM                            *((volatile  uint8_t*)(0x4003B021UL))
#define FM_RTC_WTCAL                              *((volatile  uint8_t*)(0x4003B024UL))
#define FM3_RTC_WTCAL                             *((volatile  uint8_t*)(0x4003B024UL))
#define FM_RTC_WTCALEN                            *((volatile  uint8_t*)(0x4003B025UL))
#define FM3_RTC_WTCALEN                           *((volatile  uint8_t*)(0x4003B025UL))
#define FM_RTC_WTDIV                              *((volatile  uint8_t*)(0x4003B028UL))
#define FM3_RTC_WTDIV                             *((volatile  uint8_t*)(0x4003B028UL))
#define FM_RTC_WTDIVEN                            *((volatile  uint8_t*)(0x4003B029UL))
#define FM3_RTC_WTDIVEN                           *((volatile  uint8_t*)(0x4003B029UL))

