lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define FM3_GPIO_DDRB_AVAILABLE                   1
#define FM_GPIO_DDRB_AVAILABLE                    1
#define FM3_GPIO_DDRC_AVAILABLE                   1
#define FM_GPIO_DDRC_AVAILABLE                    1
#define FM3_GPIO_DDRD_AVAILABLE                   1
#define FM_GPIO_DDRD_AVAILABLE                    1
#define FM3_GPIO_DDRE_AVAILABLE                   1
#define FM_GPIO_DDRE_AVAILABLE                    1
#define FM3_GPIO_DDRF_AVAILABLE                   1
#define FM_GPIO_DDRF_AVAILABLE                    1
#define FM3_GPIO_EPFR00_AVAILABLE                 1
#define FM_GPIO_EPFR00_AVAILABLE                  1
#define FM3_GPIO_EPFR01_AVAILABLE                 1
#define FM_GPIO_EPFR01_AVAILABLE                  1
#define FM3_GPIO_EPFR02_AVAILABLE                 1
#define FM_GPIO_EPFR02_AVAILABLE                  1
#define FM3_GPIO_EPFR03_AVAILABLE                 1
#define FM_GPIO_EPFR03_AVAILABLE                  1
#define FM3_GPIO_EPFR04_AVAILABLE                 1
#define FM_GPIO_EPFR04_AVAILABLE                  1
#define FM3_GPIO_EPFR05_AVAILABLE                 1
#define FM_GPIO_EPFR05_AVAILABLE                  1
#define FM3_GPIO_EPFR06_AVAILABLE                 1
#define FM_GPIO_EPFR06_AVAILABLE                  1
#define FM3_GPIO_EPFR07_AVAILABLE                 1
#define FM_GPIO_EPFR07_AVAILABLE                  1
#define FM3_GPIO_EPFR08_AVAILABLE                 1
#define FM_GPIO_EPFR08_AVAILABLE                  1
#define FM3_GPIO_EPFR09_AVAILABLE                 1
#define FM_GPIO_EPFR09_AVAILABLE                  1
#define FM3_GPIO_EPFR10_AVAILABLE                 1
#define FM_GPIO_EPFR10_AVAILABLE                  1
#define FM3_GPIO_EPFR11_AVAILABLE                 1
#define FM_GPIO_EPFR11_AVAILABLE                  1
#define FM3_GPIO_PCR0_AVAILABLE                   1
#define FM_GPIO_PCR0_AVAILABLE                    1
#define FM3_GPIO_PCR1_AVAILABLE                   1
#define FM_GPIO_PCR1_AVAILABLE                    1
#define FM3_GPIO_PCR2_AVAILABLE                   1
#define FM_GPIO_PCR2_AVAILABLE                    1
#define FM3_GPIO_PCR3_AVAILABLE                   1
#define FM_GPIO_PCR3_AVAILABLE                    1
#define FM3_GPIO_PCR4_AVAILABLE                   1
#define FM_GPIO_PCR4_AVAILABLE                    1
#define FM3_GPIO_PCR5_AVAILABLE                   1
#define FM_GPIO_PCR5_AVAILABLE                    1
#define FM3_GPIO_PCR6_AVAILABLE                   1
#define FM_GPIO_PCR6_AVAILABLE                    1
#define FM3_GPIO_PCR7_AVAILABLE                   1
#define FM_GPIO_PCR7_AVAILABLE                    1
#define FM3_GPIO_PCR9_AVAILABLE                   1
#define FM_GPIO_PCR9_AVAILABLE                    1
#define FM3_GPIO_PCRA_AVAILABLE                   1
#define FM_GPIO_PCRA_AVAILABLE                    1
#define FM3_GPIO_PCRB_AVAILABLE                   1
#define FM_GPIO_PCRB_AVAILABLE                    1
#define FM3_GPIO_PCRC_AVAILABLE                   1
#define FM_GPIO_PCRC_AVAILABLE                    1
#define FM3_GPIO_PCRD_AVAILABLE                   1
#define FM_GPIO_PCRD_AVAILABLE                    1
#define FM3_GPIO_PCRE_AVAILABLE                   1
#define FM_GPIO_PCRE_AVAILABLE                    1
#define FM3_GPIO_PCRF_AVAILABLE                   1
#define FM_GPIO_PCRF_AVAILABLE                    1
#define FM3_GPIO_PDIR0_AVAILABLE                  1
#define FM_GPIO_PDIR0_AVAILABLE                   1
#define FM3_GPIO_PDIR1_AVAILABLE                  1
#define FM_GPIO_PDIR1_AVAILABLE                   1
#define FM3_GPIO_PDIR2_AVAILABLE                  1
#define FM_GPIO_PDIR2_AVAILABLE                   1
#define FM3_GPIO_PDIR3_AVAILABLE                  1
#define FM_GPIO_PDIR3_AVAILABLE                   1
#define FM3_GPIO_PDIR4_AVAILABLE                  1
#define FM_GPIO_PDIR4_AVAILABLE                   1
#define FM3_GPIO_PDIR5_AVAILABLE                  1
#define FM_GPIO_PDIR5_AVAILABLE                   1
#define FM3_GPIO_PDIR6_AVAILABLE                  1
#define FM_GPIO_PDIR6_AVAILABLE                   1
#define FM3_GPIO_PDIR7_AVAILABLE                  1
#define FM_GPIO_PDIR7_AVAILABLE                   1
#define FM3_GPIO_PDIR8_AVAILABLE                  1
#define FM_GPIO_PDIR8_AVAILABLE                   1
#define FM3_GPIO_PDIR9_AVAILABLE                  1
#define FM_GPIO_PDIR9_AVAILABLE                   1
#define FM3_GPIO_PDIRA_AVAILABLE                  1
#define FM_GPIO_PDIRA_AVAILABLE                   1
#define FM3_GPIO_PDIRB_AVAILABLE                  1
#define FM_GPIO_PDIRB_AVAILABLE                   1
#define FM3_GPIO_PDIRC_AVAILABLE                  1
#define FM_GPIO_PDIRC_AVAILABLE                   1
#define FM3_GPIO_PDIRD_AVAILABLE                  1
#define FM_GPIO_PDIRD_AVAILABLE                   1
#define FM3_GPIO_PDIRE_AVAILABLE                  1
#define FM_GPIO_PDIRE_AVAILABLE                   1
#define FM3_GPIO_PDIRF_AVAILABLE                  1
#define FM_GPIO_PDIRF_AVAILABLE                   1
#define FM3_GPIO_PDOR0_AVAILABLE                  1
#define FM_GPIO_PDOR0_AVAILABLE                   1
#define FM3_GPIO_PDOR1_AVAILABLE                  1
#define FM_GPIO_PDOR1_AVAILABLE                   1
#define FM3_GPIO_PDOR2_AVAILABLE                  1
#define FM_GPIO_PDOR2_AVAILABLE                   1
#define FM3_GPIO_PDOR3_AVAILABLE                  1
#define FM_GPIO_PDOR3_AVAILABLE                   1
#define FM3_GPIO_PDOR4_AVAILABLE                  1
#define FM_GPIO_PDOR4_AVAILABLE                   1
#define FM3_GPIO_PDOR5_AVAILABLE                  1
#define FM_GPIO_PDOR5_AVAILABLE                   1
#define FM3_GPIO_PDOR6_AVAILABLE                  1
#define FM_GPIO_PDOR6_AVAILABLE                   1
#define FM3_GPIO_PDOR7_AVAILABLE                  1
#define FM_GPIO_PDOR7_AVAILABLE                   1
#define FM3_GPIO_PDOR8_AVAILABLE                  1
#define FM_GPIO_PDOR8_AVAILABLE                   1
#define FM3_GPIO_PDOR9_AVAILABLE                  1
#define FM_GPIO_PDOR9_AVAILABLE                   1
#define FM3_GPIO_PDORA_AVAILABLE                  1
#define FM_GPIO_PDORA_AVAILABLE                   1
#define FM3_GPIO_PDORB_AVAILABLE                  1
#define FM_GPIO_PDORB_AVAILABLE                   1
#define FM3_GPIO_PDORC_AVAILABLE                  1
#define FM_GPIO_PDORC_AVAILABLE                   1
#define FM3_GPIO_PDORD_AVAILABLE                  1
#define FM_GPIO_PDORD_AVAILABLE                   1
#define FM3_GPIO_PDORE_AVAILABLE                  1
#define FM_GPIO_PDORE_AVAILABLE                   1
#define FM3_GPIO_PDORF_AVAILABLE                  1
#define FM_GPIO_PDORF_AVAILABLE                   1
#define FM3_GPIO_PFR0_AVAILABLE                   1
#define FM_GPIO_PFR0_AVAILABLE                    1
#define FM3_GPIO_PFR1_AVAILABLE                   1
#define FM_GPIO_PFR1_AVAILABLE                    1
#define FM3_GPIO_PFR2_AVAILABLE                   1
#define FM_GPIO_PFR2_AVAILABLE                    1
#define FM3_GPIO_PFR3_AVAILABLE                   1
#define FM_GPIO_PFR3_AVAILABLE                    1
#define FM3_GPIO_PFR4_AVAILABLE                   1
#define FM_GPIO_PFR4_AVAILABLE                    1
#define FM3_GPIO_PFR5_AVAILABLE                   1
#define FM_GPIO_PFR5_AVAILABLE                    1
#define FM3_GPIO_PFR6_AVAILABLE                   1
#define FM_GPIO_PFR6_AVAILABLE                    1
#define FM3_GPIO_PFR7_AVAILABLE                   1
#define FM_GPIO_PFR7_AVAILABLE                    1
#define FM3_GPIO_PFR8_AVAILABLE                   1
#define FM_GPIO_PFR8_AVAILABLE                    1
#define FM3_GPIO_PFR9_AVAILABLE                   1
#define FM_GPIO_PFR9_AVAILABLE                    1
#define FM3_GPIO_PFRA_AVAILABLE                   1
#define FM_GPIO_PFRA_AVAILABLE                    1
#define FM3_GPIO_PFRB_AVAILABLE                   1
#define FM_GPIO_PFRB_AVAILABLE                    1
#define FM3_GPIO_PFRC_AVAILABLE                   1
#define FM_GPIO_PFRC_AVAILABLE                    1
#define FM3_GPIO_PFRD_AVAILABLE                   1
#define FM_GPIO_PFRD_AVAILABLE                    1
#define FM3_GPIO_PFRE_AVAILABLE                   1
#define FM_GPIO_PFRE_AVAILABLE                    1
#define FM3_GPIO_PFRF_AVAILABLE                   1
#define FM_GPIO_PFRF_AVAILABLE                    1
#define FM3_GPIO_PZR0_AVAILABLE                   1
#define FM_GPIO_PZR0_AVAILABLE                    1
#define FM3_GPIO_PZR1_AVAILABLE                   1
#define FM_GPIO_PZR1_AVAILABLE                    1
#define FM3_GPIO_PZR2_AVAILABLE                   1
#define FM_GPIO_PZR2_AVAILABLE                    1
#define FM3_GPIO_PZR3_AVAILABLE                   1
#define FM_GPIO_PZR3_AVAILABLE                    1
#define FM3_GPIO_PZR4_AVAILABLE                   1
#define FM_GPIO_PZR4_AVAILABLE                    1
#define FM3_GPIO_PZR5_AVAILABLE                   1
#define FM_GPIO_PZR5_AVAILABLE                    1
#define FM3_GPIO_PZR6_AVAILABLE                   1
#define FM_GPIO_PZR6_AVAILABLE                    1
#define FM3_GPIO_PZR7_AVAILABLE                   1
#define FM_GPIO_PZR7_AVAILABLE                    1
#define FM3_GPIO_PZR8_AVAILABLE                   1
#define FM_GPIO_PZR8_AVAILABLE                    1
#define FM3_GPIO_PZR9_AVAILABLE                   1
#define FM_GPIO_PZR9_AVAILABLE                    1
#define FM3_GPIO_PZRA_AVAILABLE                   1
#define FM_GPIO_PZRA_AVAILABLE                    1
#define FM3_GPIO_PZRB_AVAILABLE                   1
#define FM_GPIO_PZRB_AVAILABLE                    1
#define FM3_GPIO_PZRC_AVAILABLE                   1
#define FM_GPIO_PZRC_AVAILABLE                    1
#define FM3_GPIO_PZRD_AVAILABLE                   1
#define FM_GPIO_PZRD_AVAILABLE                    1
#define FM3_GPIO_PZRE_AVAILABLE                   1
#define FM_GPIO_PZRE_AVAILABLE                    1
#define FM3_GPIO_PZRF_AVAILABLE                   1
#define FM_GPIO_PZRF_AVAILABLE                    1
#define FM3_GPIO_SPSR_AVAILABLE                   1
#define FM_GPIO_SPSR_AVAILABLE                    1
/******************************************************************************
 ** HWWDT
 ** 
 ******************************************************************************/
#define FM3_HWWDT_WDG_CTL_AVAILABLE               1
#define FM_HWWDT_WDG_CTL_AVAILABLE                1
#define FM3_HWWDT_WDG_ICL_AVAILABLE               1
#define FM_HWWDT_WDG_ICL_AVAILABLE                1
#define FM3_HWWDT_WDG_LCK_AVAILABLE               1
#define FM_HWWDT_WDG_LCK_AVAILABLE                1
#define FM3_HWWDT_WDG_LDR_AVAILABLE               1
#define FM_HWWDT_WDG_LDR_AVAILABLE                1
#define FM3_HWWDT_WDG_RIS_AVAILABLE               1
#define FM_HWWDT_WDG_RIS_AVAILABLE                1
#define FM3_HWWDT_WDG_VLR_AVAILABLE               1
#define FM_HWWDT_WDG_VLR_AVAILABLE                1
/******************************************************************************
 ** INTREQ
 ** 
 ******************************************************************************/
#define FM3_INTREQ_DQESEL_AVAILABLE               1
#define FM_INTREQ_DQESEL_AVAILABLE                1
#define FM3_INTREQ_DRQSEL_AVAILABLE               1
#define FM_INTREQ_DRQSEL_AVAILABLE                1
#define FM3_INTREQ_DRQSEL1_AVAILABLE              1
#define FM_INTREQ_DRQSEL1_AVAILABLE               1
#define FM3_INTREQ_EXC02MON_AVAILABLE             1
#define FM_INTREQ_EXC02MON_AVAILABLE              1
#define FM3_INTREQ_IRQ00MON_AVAILABLE             1
#define FM_INTREQ_IRQ00MON_AVAILABLE              1
#define FM3_INTREQ_IRQ01MON_AVAILABLE             1
#define FM_INTREQ_IRQ01MON_AVAILABLE              1
#define FM3_INTREQ_IRQ02MON_AVAILABLE             1
#define FM_INTREQ_IRQ02MON_AVAILABLE              1
#define FM3_INTREQ_IRQ03MON_AVAILABLE             1
#define FM_INTREQ_IRQ03MON_AVAILABLE              1
#define FM3_INTREQ_IRQ04MON_AVAILABLE             1
#define FM_INTREQ_IRQ04MON_AVAILABLE              1
#define FM3_INTREQ_IRQ05MON_AVAILABLE             1
#define FM_INTREQ_IRQ05MON_AVAILABLE              1
#define FM3_INTREQ_IRQ06MON_AVAILABLE             1
#define FM_INTREQ_IRQ06MON_AVAILABLE              1
#define FM3_INTREQ_IRQ07MON_AVAILABLE             1
#define FM_INTREQ_IRQ07MON_AVAILABLE              1
#define FM3_INTREQ_IRQ08MON_AVAILABLE             1
#define FM_INTREQ_IRQ08MON_AVAILABLE              1
#define FM3_INTREQ_IRQ09MON_AVAILABLE             1
#define FM_INTREQ_IRQ09MON_AVAILABLE              1
#define FM3_INTREQ_IRQ10MON_AVAILABLE             1
#define FM_INTREQ_IRQ10MON_AVAILABLE              1
#define FM3_INTREQ_IRQ11MON_AVAILABLE             1
#define FM_INTREQ_IRQ11MON_AVAILABLE              1
#define FM3_INTREQ_IRQ12MON_AVAILABLE             1
#define FM_INTREQ_IRQ12MON_AVAILABLE              1
#define FM3_INTREQ_IRQ13MON_AVAILABLE             1
#define FM_INTREQ_IRQ13MON_AVAILABLE              1
#define FM3_INTREQ_IRQ14MON_AVAILABLE             1
#define FM_INTREQ_IRQ14MON_AVAILABLE              1
#define FM3_INTREQ_IRQ15MON_AVAILABLE             1
#define FM_INTREQ_IRQ15MON_AVAILABLE              1
#define FM3_INTREQ_IRQ16MON_AVAILABLE             1
#define FM_INTREQ_IRQ16MON_AVAILABLE              1
#define FM3_INTREQ_IRQ17MON_AVAILABLE             1
#define FM_INTREQ_IRQ17MON_AVAILABLE              1
#define FM3_INTREQ_IRQ18MON_AVAILABLE             1
#define FM_INTREQ_IRQ18MON_AVAILABLE              1
#define FM3_INTREQ_IRQ19MON_AVAILABLE             1
#define FM_INTREQ_IRQ19MON_AVAILABLE              1
#define FM3_INTREQ_IRQ20MON_AVAILABLE             1
#define FM_INTREQ_IRQ20MON_AVAILABLE              1
#define FM3_INTREQ_IRQ21MON_AVAILABLE             1
#define FM_INTREQ_IRQ21MON_AVAILABLE              1
#define FM3_INTREQ_IRQ22MON_AVAILABLE             1
#define FM_INTREQ_IRQ22MON_AVAILABLE              1
#define FM3_INTREQ_IRQ23MON_AVAILABLE             1
#define FM_INTREQ_IRQ23MON_AVAILABLE              1
#define FM3_INTREQ_IRQ24MON_AVAILABLE             1
#define FM_INTREQ_IRQ24MON_AVAILABLE              1
#define FM3_INTREQ_IRQ25MON_AVAILABLE             1
#define FM_INTREQ_IRQ25MON_AVAILABLE              1
#define FM3_INTREQ_IRQ26MON_AVAILABLE             1
#define FM_INTREQ_IRQ26MON_AVAILABLE              1
#define FM3_INTREQ_IRQ27MON_AVAILABLE             1
#define FM_INTREQ_IRQ27MON_AVAILABLE              1
#define FM3_INTREQ_IRQ28MON_AVAILABLE             1
#define FM_INTREQ_IRQ28MON_AVAILABLE              1
#define FM3_INTREQ_IRQ29MON_AVAILABLE             1
#define FM_INTREQ_IRQ29MON_AVAILABLE              1
#define FM3_INTREQ_IRQ30MON_AVAILABLE             1
#define FM_INTREQ_IRQ30MON_AVAILABLE              1
#define FM3_INTREQ_IRQ31MON_AVAILABLE             1
#define FM_INTREQ_IRQ31MON_AVAILABLE              1
#define FM3_INTREQ_IRQ32MON_AVAILABLE             1
#define FM_INTREQ_IRQ32MON_AVAILABLE              1
#define FM3_INTREQ_IRQ33MON_AVAILABLE             1
#define FM_INTREQ_IRQ33MON_AVAILABLE              1
#define FM3_INTREQ_IRQ34MON_AVAILABLE             1
#define FM_INTREQ_IRQ34MON_AVAILABLE              1
#define FM3_INTREQ_IRQ35MON_AVAILABLE             1
#define FM_INTREQ_IRQ35MON_AVAILABLE              1
#define FM3_INTREQ_IRQ36MON_AVAILABLE             1
#define FM_INTREQ_IRQ36MON_AVAILABLE              1
#define FM3_INTREQ_IRQ37MON_AVAILABLE             1
#define FM_INTREQ_IRQ37MON_AVAILABLE              1
#define FM3_INTREQ_IRQ38MON_AVAILABLE             1
#define FM_INTREQ_IRQ38MON_AVAILABLE              1
#define FM3_INTREQ_IRQ39MON_AVAILABLE             1
#define FM_INTREQ_IRQ39MON_AVAILABLE              1
#define FM3_INTREQ_IRQ40MON_AVAILABLE             1
#define FM_INTREQ_IRQ40MON_AVAILABLE              1
#define FM3_INTREQ_IRQ41MON_AVAILABLE             1
#define FM_INTREQ_IRQ41MON_AVAILABLE              1
#define FM3_INTREQ_IRQ42MON_AVAILABLE             1
#define FM_INTREQ_IRQ42MON_AVAILABLE              1
#define FM3_INTREQ_IRQ43MON_AVAILABLE             1
#define FM_INTREQ_IRQ43MON_AVAILABLE              1
#define FM3_INTREQ_IRQ44MON_AVAILABLE             1
#define FM_INTREQ_IRQ44MON_AVAILABLE              1
#define FM3_INTREQ_IRQ45MON_AVAILABLE             1
#define FM_INTREQ_IRQ45MON_AVAILABLE              1
#define FM3_INTREQ_IRQ46MON_AVAILABLE             1
#define FM_INTREQ_IRQ46MON_AVAILABLE              1
#define FM3_INTREQ_IRQ47MON_AVAILABLE             1
#define FM_INTREQ_IRQ47MON_AVAILABLE              1
#define FM3_INTREQ_IRQCMODE_AVAILABLE             1
#define FM_INTREQ_IRQCMODE_AVAILABLE              1
#define FM3_INTREQ_ODDPKS_AVAILABLE               1
#define FM_INTREQ_ODDPKS_AVAILABLE                1
#define FM3_INTREQ_ODDPKS1_AVAILABLE              1
#define FM_INTREQ_ODDPKS1_AVAILABLE               1
#define FM3_INTREQ_RCINTSEL0_AVAILABLE            1
#define FM_INTREQ_RCINTSEL0_AVAILABLE             1
#define FM3_INTREQ_RCINTSEL1_AVAILABLE            1
#define FM_INTREQ_RCINTSEL1_AVAILABLE             1
/******************************************************************************
 ** LVD
 ** 
 ******************************************************************************/
#define FM3_LVD_LVD_CLR_AVAILABLE                 1
#define FM_LVD_LVD_CLR_AVAILABLE                  1
#define FM3_LVD_LVD_CTL_AVAILABLE                 1
#define FM_LVD_LVD_CTL_AVAILABLE                  1
#define FM3_LVD_LVD_RLR_AVAILABLE                 1
#define FM_LVD_LVD_RLR_AVAILABLE                  1
#define FM3_LVD_LVD_STR_AVAILABLE                 1
#define FM_LVD_LVD_STR_AVAILABLE                  1
#define FM3_LVD_LVD_STR2_AVAILABLE                1
#define FM_LVD_LVD_STR2_AVAILABLE                 1
/******************************************************************************
 ** MFS0
 ** 
 ******************************************************************************/
#define FM3_MFS_CSIO_BGR_AVAILABLE                1
#define FM_MFS_CSIO_BGR_AVAILABLE                 1
#define FM3_MFS_CSIO_ESCR_AVAILABLE               1
#define FM_MFS_CSIO_ESCR_AVAILABLE                1
#define FM3_MFS_CSIO_FBYTE1_AVAILABLE             1
#define FM_MFS_CSIO_FBYTE1_AVAILABLE              1
#define FM3_MFS_CSIO_FBYTE2_AVAILABLE             1
#define FM_MFS_CSIO_FBYTE2_AVAILABLE              1
#define FM3_MFS_CSIO_FCR_AVAILABLE                1
#define FM_MFS_CSIO_FCR_AVAILABLE                 1
#define FM3_MFS_CSIO_RDR_AVAILABLE                1
#define FM_MFS_CSIO_RDR_AVAILABLE                 1
#define FM3_MFS_CSIO_SCR_AVAILABLE                1
#define FM_MFS_CSIO_SCR_AVAILABLE                 1
#define FM3_MFS_CSIO_SMR_AVAILABLE                1
#define FM_MFS_CSIO_SMR_AVAILABLE                 1
#define FM3_MFS_CSIO_SSR_AVAILABLE                1
#define FM_MFS_CSIO_SSR_AVAILABLE                 1
#define FM3_MFS_CSIO_TDR_AVAILABLE                1
#define FM_MFS_CSIO_TDR_AVAILABLE                 1
#define FM3_MFS_I2C_BGR_AVAILABLE                 1
#define FM_MFS_I2C_BGR_AVAILABLE                  1
#define FM3_MFS_I2C_FBYTE1_AVAILABLE              1
#define FM_MFS_I2C_FBYTE1_AVAILABLE               1
#define FM3_MFS_I2C_FBYTE2_AVAILABLE              1
#define FM_MFS_I2C_FBYTE2_AVAILABLE               1
#define FM3_MFS_I2C_FCR_AVAILABLE                 1
#define FM_MFS_I2C_FCR_AVAILABLE                  1
#define FM3_MFS_I2C_IBCR_AVAILABLE                1
#define FM_MFS_I2C_IBCR_AVAILABLE                 1
#define FM3_MFS_I2C_IBSR_AVAILABLE                1
#define FM_MFS_I2C_IBSR_AVAILABLE                 1
#define FM3_MFS_I2C_ISBA_AVAILABLE                1
#define FM_MFS_I2C_ISBA_AVAILABLE                 1
#define FM3_MFS_I2C_ISMK_AVAILABLE                1
#define FM_MFS_I2C_ISMK_AVAILABLE                 1
#define FM3_MFS_I2C_RDR_AVAILABLE                 1
#define FM_MFS_I2C_RDR_AVAILABLE                  1
#define FM3_MFS_I2C_SMR_AVAILABLE                 1
#define FM_MFS_I2C_SMR_AVAILABLE                  1
#define FM3_MFS_I2C_SSR_AVAILABLE                 1
#define FM_MFS_I2C_SSR_AVAILABLE                  1
#define FM3_MFS_I2C_TDR_AVAILABLE                 1
#define FM_MFS_I2C_TDR_AVAILABLE                  1
#define FM3_MFS_LIN_BGR_AVAILABLE                 1
#define FM_MFS_LIN_BGR_AVAILABLE                  1
#define FM3_MFS_LIN_ESCR_AVAILABLE                1
#define FM_MFS_LIN_ESCR_AVAILABLE                 1
#define FM3_MFS_LIN_FBYTE1_AVAILABLE              1
#define FM_MFS_LIN_FBYTE1_AVAILABLE               1
#define FM3_MFS_LIN_FBYTE2_AVAILABLE              1
#define FM_MFS_LIN_FBYTE2_AVAILABLE               1
#define FM3_MFS_LIN_FCR_AVAILABLE                 1
#define FM_MFS_LIN_FCR_AVAILABLE                  1
#define FM3_MFS_LIN_RDR_AVAILABLE                 1
#define FM_MFS_LIN_RDR_AVAILABLE                  1
#define FM3_MFS_LIN_SCR_AVAILABLE                 1
#define FM_MFS_LIN_SCR_AVAILABLE                  1
#define FM3_MFS_LIN_SMR_AVAILABLE                 1
#define FM_MFS_LIN_SMR_AVAILABLE                  1
#define FM3_MFS_LIN_SSR_AVAILABLE                 1
#define FM_MFS_LIN_SSR_AVAILABLE                  1
#define FM3_MFS_LIN_TDR_AVAILABLE                 1
#define FM_MFS_LIN_TDR_AVAILABLE                  1
#define FM3_MFS_UART_BGR_AVAILABLE                1
#define FM_MFS_UART_BGR_AVAILABLE                 1
#define FM3_MFS_UART_ESCR_AVAILABLE               1
#define FM_MFS_UART_ESCR_AVAILABLE                1
#define FM3_MFS_UART_FBYTE1_AVAILABLE             1
#define FM_MFS_UART_FBYTE1_AVAILABLE              1
#define FM3_MFS_UART_FBYTE2_AVAILABLE             1
#define FM_MFS_UART_FBYTE2_AVAILABLE              1
#define FM3_MFS_UART_FCR_AVAILABLE                1
#define FM_MFS_UART_FCR_AVAILABLE                 1
#define FM3_MFS_UART_RDR_AVAILABLE                1
#define FM_MFS_UART_RDR_AVAILABLE                 1
#define FM3_MFS_UART_SCR_AVAILABLE                1
#define FM_MFS_UART_SCR_AVAILABLE                 1
#define FM3_MFS_UART_SMR_AVAILABLE                1
#define FM_MFS_UART_SMR_AVAILABLE                 1
#define FM3_MFS_UART_SSR_AVAILABLE                1
#define FM_MFS_UART_SSR_AVAILABLE                 1
#define FM3_MFS_UART_TDR_AVAILABLE                1
#define FM_MFS_UART_TDR_AVAILABLE                 1
/******************************************************************************
 ** MFS_NFC
 ** 
 ******************************************************************************/
#define FM3_MFS_NFC_I2CDNF_AVAILABLE              1
#define FM_MFS_NFC_I2CDNF_AVAILABLE               1
/******************************************************************************
 ** MFT0
 ** 
 ******************************************************************************/
#define FM3_MFT_ADCMP_ACCP0_AVAILABLE             1
#define FM_MFT_ADCMP_ACCP0_AVAILABLE              1
#define FM3_MFT_ADCMP_ACCP1_AVAILABLE             1
#define FM_MFT_ADCMP_ACCP1_AVAILABLE              1
#define FM3_MFT_ADCMP_ACCP2_AVAILABLE             1
#define FM_MFT_ADCMP_ACCP2_AVAILABLE              1
#define FM3_MFT_ADCMP_ACCPDN0_AVAILABLE           1
#define FM_MFT_ADCMP_ACCPDN0_AVAILABLE            1
#define FM3_MFT_ADCMP_ACCPDN1_AVAILABLE           1
#define FM_MFT_ADCMP_ACCPDN1_AVAILABLE            1
#define FM3_MFT_ADCMP_ACCPDN2_AVAILABLE           1
#define FM_MFT_ADCMP_ACCPDN2_AVAILABLE            1
#define FM3_MFT_ADCMP_ACSA_AVAILABLE              1
#define FM_MFT_ADCMP_ACSA_AVAILABLE               1
#define FM3_MFT_ADCMP_ACSB_AVAILABLE              1
#define FM_MFT_ADCMP_ACSB_AVAILABLE               1
#define FM3_MFT_ADCMP_ATSA_AVAILABLE              1
#define FM_MFT_ADCMP_ATSA_AVAILABLE               1
#define FM3_MFT_FRT_TCCP0_AVAILABLE               1
#define FM_MFT_FRT_TCCP0_AVAILABLE                1
#define FM3_MFT_FRT_TCCP1_AVAILABLE               1
#define FM_MFT_FRT_TCCP1_AVAILABLE                1
#define FM3_MFT_FRT_TCCP2_AVAILABLE               1
#define FM_MFT_FRT_TCCP2_AVAILABLE                1
#define FM3_MFT_FRT_TCDT0_AVAILABLE               1
