lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define bFM_EXTI_NMICL_NCL                        *((volatile  uint8_t *)(0x42600300UL))
#define bFM3_EXTI_NMICL_NCL                       *((volatile  uint8_t *)(0x42600300UL))

#define bFM_EXTI_NMIRR_NR                         *((volatile  uint8_t *)(0x42600280UL))
#define bFM3_EXTI_NMIRR_NR                        *((volatile  uint8_t *)(0x42600280UL))


/******************************************************************************
 ** FLASH_IF Registers FLASH_IF
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_FLASH_IF_FSTR_RDY                     *((volatile  uint8_t *)(0x42000100UL))
#define bFM3_FLASH_IF_FSTR_RDY                    *((volatile  uint8_t *)(0x42000100UL))
#define bFM_FLASH_IF_FSTR_HNG                     *((volatile  uint8_t *)(0x42000104UL))
#define bFM3_FLASH_IF_FSTR_HNG                    *((volatile  uint8_t *)(0x42000104UL))
#define bFM_FLASH_IF_FSTR_ERR                     *((volatile  uint8_t *)(0x42000108UL))
#define bFM3_FLASH_IF_FSTR_ERR                    *((volatile  uint8_t *)(0x42000108UL))


/******************************************************************************
 ** GPIO Registers GPIO
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_GPIO_ADE_AN00                         *((volatile  uint8_t *)(0x4266A000UL))
#define bFM3_GPIO_ADE_AN00                        *((volatile  uint8_t *)(0x4266A000UL))
#define bFM_GPIO_ADE_AN01                         *((volatile  uint8_t *)(0x4266A004UL))
#define bFM3_GPIO_ADE_AN01                        *((volatile  uint8_t *)(0x4266A004UL))
#define bFM_GPIO_ADE_AN02                         *((volatile  uint8_t *)(0x4266A008UL))
#define bFM3_GPIO_ADE_AN02                        *((volatile  uint8_t *)(0x4266A008UL))
#define bFM_GPIO_ADE_AN03                         *((volatile  uint8_t *)(0x4266A00CUL))
#define bFM3_GPIO_ADE_AN03                        *((volatile  uint8_t *)(0x4266A00CUL))
#define bFM_GPIO_ADE_AN04                         *((volatile  uint8_t *)(0x4266A010UL))
#define bFM3_GPIO_ADE_AN04                        *((volatile  uint8_t *)(0x4266A010UL))
#define bFM_GPIO_ADE_AN05                         *((volatile  uint8_t *)(0x4266A014UL))
#define bFM3_GPIO_ADE_AN05                        *((volatile  uint8_t *)(0x4266A014UL))
#define bFM_GPIO_ADE_AN06                         *((volatile  uint8_t *)(0x4266A018UL))
#define bFM3_GPIO_ADE_AN06                        *((volatile  uint8_t *)(0x4266A018UL))
#define bFM_GPIO_ADE_AN07                         *((volatile  uint8_t *)(0x4266A01CUL))
#define bFM3_GPIO_ADE_AN07                        *((volatile  uint8_t *)(0x4266A01CUL))

#define bFM_GPIO_DDR0_P0                          *((volatile  uint8_t *)(0x42664000UL))
#define bFM3_GPIO_DDR0_P0                         *((volatile  uint8_t *)(0x42664000UL))
#define bFM_GPIO_DDR0_P1                          *((volatile  uint8_t *)(0x42664004UL))
#define bFM3_GPIO_DDR0_P1                         *((volatile  uint8_t *)(0x42664004UL))
#define bFM_GPIO_DDR0_P2                          *((volatile  uint8_t *)(0x42664008UL))
#define bFM3_GPIO_DDR0_P2                         *((volatile  uint8_t *)(0x42664008UL))
#define bFM_GPIO_DDR0_P3                          *((volatile  uint8_t *)(0x4266400CUL))
#define bFM3_GPIO_DDR0_P3                         *((volatile  uint8_t *)(0x4266400CUL))
#define bFM_GPIO_DDR0_P4                          *((volatile  uint8_t *)(0x42664010UL))
#define bFM3_GPIO_DDR0_P4                         *((volatile  uint8_t *)(0x42664010UL))
#define bFM_GPIO_DDR0_PF                          *((volatile  uint8_t *)(0x4266403CUL))
#define bFM3_GPIO_DDR0_PF                         *((volatile  uint8_t *)(0x4266403CUL))

#define bFM_GPIO_DDR1_P0                          *((volatile  uint8_t *)(0x42664080UL))
#define bFM3_GPIO_DDR1_P0                         *((volatile  uint8_t *)(0x42664080UL))
#define bFM_GPIO_DDR1_P1                          *((volatile  uint8_t *)(0x42664084UL))
#define bFM3_GPIO_DDR1_P1                         *((volatile  uint8_t *)(0x42664084UL))
#define bFM_GPIO_DDR1_P2                          *((volatile  uint8_t *)(0x42664088UL))
#define bFM3_GPIO_DDR1_P2                         *((volatile  uint8_t *)(0x42664088UL))
#define bFM_GPIO_DDR1_P3                          *((volatile  uint8_t *)(0x4266408CUL))
#define bFM3_GPIO_DDR1_P3                         *((volatile  uint8_t *)(0x4266408CUL))
#define bFM_GPIO_DDR1_P4                          *((volatile  uint8_t *)(0x42664090UL))
#define bFM3_GPIO_DDR1_P4                         *((volatile  uint8_t *)(0x42664090UL))
#define bFM_GPIO_DDR1_P5                          *((volatile  uint8_t *)(0x42664094UL))
#define bFM3_GPIO_DDR1_P5                         *((volatile  uint8_t *)(0x42664094UL))

#define bFM_GPIO_DDR2_P1                          *((volatile  uint8_t *)(0x42664104UL))
#define bFM3_GPIO_DDR2_P1                         *((volatile  uint8_t *)(0x42664104UL))
#define bFM_GPIO_DDR2_P2                          *((volatile  uint8_t *)(0x42664108UL))
#define bFM3_GPIO_DDR2_P2                         *((volatile  uint8_t *)(0x42664108UL))
#define bFM_GPIO_DDR2_P3                          *((volatile  uint8_t *)(0x4266410CUL))
#define bFM3_GPIO_DDR2_P3                         *((volatile  uint8_t *)(0x4266410CUL))

#define bFM_GPIO_DDR3_P9                          *((volatile  uint8_t *)(0x426641A4UL))
#define bFM3_GPIO_DDR3_P9                         *((volatile  uint8_t *)(0x426641A4UL))
#define bFM_GPIO_DDR3_PA                          *((volatile  uint8_t *)(0x426641A8UL))
#define bFM3_GPIO_DDR3_PA                         *((volatile  uint8_t *)(0x426641A8UL))
#define bFM_GPIO_DDR3_PB                          *((volatile  uint8_t *)(0x426641ACUL))
#define bFM3_GPIO_DDR3_PB                         *((volatile  uint8_t *)(0x426641ACUL))
#define bFM_GPIO_DDR3_PC                          *((volatile  uint8_t *)(0x426641B0UL))
#define bFM3_GPIO_DDR3_PC                         *((volatile  uint8_t *)(0x426641B0UL))
#define bFM_GPIO_DDR3_PD                          *((volatile  uint8_t *)(0x426641B4UL))
#define bFM3_GPIO_DDR3_PD                         *((volatile  uint8_t *)(0x426641B4UL))
#define bFM_GPIO_DDR3_PE                          *((volatile  uint8_t *)(0x426641B8UL))
#define bFM3_GPIO_DDR3_PE                         *((volatile  uint8_t *)(0x426641B8UL))
#define bFM_GPIO_DDR3_PF                          *((volatile  uint8_t *)(0x426641BCUL))
#define bFM3_GPIO_DDR3_PF                         *((volatile  uint8_t *)(0x426641BCUL))

#define bFM_GPIO_DDR4_P6                          *((volatile  uint8_t *)(0x42664218UL))
#define bFM3_GPIO_DDR4_P6                         *((volatile  uint8_t *)(0x42664218UL))
#define bFM_GPIO_DDR4_P7                          *((volatile  uint8_t *)(0x4266421CUL))
#define bFM3_GPIO_DDR4_P7                         *((volatile  uint8_t *)(0x4266421CUL))
#define bFM_GPIO_DDR4_P9                          *((volatile  uint8_t *)(0x42664224UL))
#define bFM3_GPIO_DDR4_P9                         *((volatile  uint8_t *)(0x42664224UL))
#define bFM_GPIO_DDR4_PA                          *((volatile  uint8_t *)(0x42664228UL))
#define bFM3_GPIO_DDR4_PA                         *((volatile  uint8_t *)(0x42664228UL))

#define bFM_GPIO_DDR5_P0                          *((volatile  uint8_t *)(0x42664280UL))
#define bFM3_GPIO_DDR5_P0                         *((volatile  uint8_t *)(0x42664280UL))
#define bFM_GPIO_DDR5_P1                          *((volatile  uint8_t *)(0x42664284UL))
#define bFM3_GPIO_DDR5_P1                         *((volatile  uint8_t *)(0x42664284UL))
#define bFM_GPIO_DDR5_P2                          *((volatile  uint8_t *)(0x42664288UL))
#define bFM3_GPIO_DDR5_P2                         *((volatile  uint8_t *)(0x42664288UL))

#define bFM_GPIO_DDR6_P0                          *((volatile  uint8_t *)(0x42664300UL))
#define bFM3_GPIO_DDR6_P0                         *((volatile  uint8_t *)(0x42664300UL))
#define bFM_GPIO_DDR6_P1                          *((volatile  uint8_t *)(0x42664304UL))
#define bFM3_GPIO_DDR6_P1                         *((volatile  uint8_t *)(0x42664304UL))

