lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define bFM_GPIO_DDR8_P0                          *((volatile  uint8_t *)(0x42664400UL))
#define bFM3_GPIO_DDR8_P0                         *((volatile  uint8_t *)(0x42664400UL))
#define bFM_GPIO_DDR8_P1                          *((volatile  uint8_t *)(0x42664404UL))
#define bFM3_GPIO_DDR8_P1                         *((volatile  uint8_t *)(0x42664404UL))

#define bFM_GPIO_DDRE_P0                          *((volatile  uint8_t *)(0x42664700UL))
#define bFM3_GPIO_DDRE_P0                         *((volatile  uint8_t *)(0x42664700UL))
#define bFM_GPIO_DDRE_P2                          *((volatile  uint8_t *)(0x42664708UL))
#define bFM3_GPIO_DDRE_P2                         *((volatile  uint8_t *)(0x42664708UL))
#define bFM_GPIO_DDRE_P3                          *((volatile  uint8_t *)(0x4266470CUL))
#define bFM3_GPIO_DDRE_P3                         *((volatile  uint8_t *)(0x4266470CUL))

#define bFM_GPIO_EPFR00_NMIS                      *((volatile  uint8_t *)(0x4266C000UL))
#define bFM3_GPIO_EPFR00_NMIS                     *((volatile  uint8_t *)(0x4266C000UL))
#define bFM_GPIO_EPFR00_USBP0E                    *((volatile  uint8_t *)(0x4266C024UL))
#define bFM3_GPIO_EPFR00_USBP0E                   *((volatile  uint8_t *)(0x4266C024UL))
#define bFM_GPIO_EPFR00_USBP1E                    *((volatile  uint8_t *)(0x4266C034UL))
#define bFM3_GPIO_EPFR00_USBP1E                   *((volatile  uint8_t *)(0x4266C034UL))
#define bFM_GPIO_EPFR00_JTAGEN0B                  *((volatile  uint8_t *)(0x4266C040UL))
#define bFM3_GPIO_EPFR00_JTAGEN0B                 *((volatile  uint8_t *)(0x4266C040UL))
#define bFM_GPIO_EPFR00_JTAGEN1S                  *((volatile  uint8_t *)(0x4266C044UL))
#define bFM3_GPIO_EPFR00_JTAGEN1S                 *((volatile  uint8_t *)(0x4266C044UL))
#define bFM_GPIO_EPFR00_TRC0E                     *((volatile  uint8_t *)(0x4266C060UL))
#define bFM3_GPIO_EPFR00_TRC0E                    *((volatile  uint8_t *)(0x4266C060UL))
#define bFM_GPIO_EPFR00_TRC1E                     *((volatile  uint8_t *)(0x4266C064UL))
#define bFM3_GPIO_EPFR00_TRC1E                    *((volatile  uint8_t *)(0x4266C064UL))

#define bFM_GPIO_EPFR01_DTTI0C                    *((volatile  uint8_t *)(0x4266C0B0UL))
#define bFM3_GPIO_EPFR01_DTTI0C                   *((volatile  uint8_t *)(0x4266C0B0UL))

#define bFM_GPIO_EPFR02_DTTI1C                    *((volatile  uint8_t *)(0x4266C130UL))
#define bFM3_GPIO_EPFR02_DTTI1C                   *((volatile  uint8_t *)(0x4266C130UL))

#define bFM_GPIO_EPFR03_DTTI2C                    *((volatile  uint8_t *)(0x4266C1B0UL))
#define bFM3_GPIO_EPFR03_DTTI2C                   *((volatile  uint8_t *)(0x4266C1B0UL))

#define bFM_GPIO_EPFR10_UEDEFB                    *((volatile  uint8_t *)(0x4266C500UL))
#define bFM3_GPIO_EPFR10_UEDEFB                   *((volatile  uint8_t *)(0x4266C500UL))
#define bFM_GPIO_EPFR10_UEDTHB                    *((volatile  uint8_t *)(0x4266C504UL))
#define bFM3_GPIO_EPFR10_UEDTHB                   *((volatile  uint8_t *)(0x4266C504UL))
#define bFM_GPIO_EPFR10_UECLKE                    *((volatile  uint8_t *)(0x4266C508UL))
#define bFM3_GPIO_EPFR10_UECLKE                   *((volatile  uint8_t *)(0x4266C508UL))
#define bFM_GPIO_EPFR10_UEWEXE                    *((volatile  uint8_t *)(0x4266C50CUL))
#define bFM3_GPIO_EPFR10_UEWEXE                   *((volatile  uint8_t *)(0x4266C50CUL))
#define bFM_GPIO_EPFR10_UEDQME                    *((volatile  uint8_t *)(0x4266C510UL))
#define bFM3_GPIO_EPFR10_UEDQME                   *((volatile  uint8_t *)(0x4266C510UL))
#define bFM_GPIO_EPFR10_UEOEXE                    *((volatile  uint8_t *)(0x4266C514UL))
#define bFM3_GPIO_EPFR10_UEOEXE                   *((volatile  uint8_t *)(0x4266C514UL))
#define bFM_GPIO_EPFR10_UEFLSE                    *((volatile  uint8_t *)(0x4266C518UL))
#define bFM3_GPIO_EPFR10_UEFLSE                   *((volatile  uint8_t *)(0x4266C518UL))
#define bFM_GPIO_EPFR10_UECS1E                    *((volatile  uint8_t *)(0x4266C51CUL))
#define bFM3_GPIO_EPFR10_UECS1E                   *((volatile  uint8_t *)(0x4266C51CUL))
#define bFM_GPIO_EPFR10_UECS2E                    *((volatile  uint8_t *)(0x4266C520UL))
#define bFM3_GPIO_EPFR10_UECS2E                   *((volatile  uint8_t *)(0x4266C520UL))
#define bFM_GPIO_EPFR10_UECS3E                    *((volatile  uint8_t *)(0x4266C524UL))
#define bFM3_GPIO_EPFR10_UECS3E                   *((volatile  uint8_t *)(0x4266C524UL))
#define bFM_GPIO_EPFR10_UECS4E                    *((volatile  uint8_t *)(0x4266C528UL))
#define bFM3_GPIO_EPFR10_UECS4E                   *((volatile  uint8_t *)(0x4266C528UL))
#define bFM_GPIO_EPFR10_UECS5E                    *((volatile  uint8_t *)(0x4266C52CUL))
#define bFM3_GPIO_EPFR10_UECS5E                   *((volatile  uint8_t *)(0x4266C52CUL))
#define bFM_GPIO_EPFR10_UECS6E                    *((volatile  uint8_t *)(0x4266C530UL))
#define bFM3_GPIO_EPFR10_UECS6E                   *((volatile  uint8_t *)(0x4266C530UL))
#define bFM_GPIO_EPFR10_UECS7E                    *((volatile  uint8_t *)(0x4266C534UL))
#define bFM3_GPIO_EPFR10_UECS7E                   *((volatile  uint8_t *)(0x4266C534UL))
#define bFM_GPIO_EPFR10_UEAOOE                    *((volatile  uint8_t *)(0x4266C538UL))
#define bFM3_GPIO_EPFR10_UEAOOE                   *((volatile  uint8_t *)(0x4266C538UL))
#define bFM_GPIO_EPFR10_UEA08E                    *((volatile  uint8_t *)(0x4266C53CUL))
#define bFM3_GPIO_EPFR10_UEA08E                   *((volatile  uint8_t *)(0x4266C53CUL))
#define bFM_GPIO_EPFR10_UEA09E                    *((volatile  uint8_t *)(0x4266C540UL))
#define bFM3_GPIO_EPFR10_UEA09E                   *((volatile  uint8_t *)(0x4266C540UL))
#define bFM_GPIO_EPFR10_UEA10E                    *((volatile  uint8_t *)(0x4266C544UL))
#define bFM3_GPIO_EPFR10_UEA10E                   *((volatile  uint8_t *)(0x4266C544UL))
#define bFM_GPIO_EPFR10_UEA11E                    *((volatile  uint8_t *)(0x4266C548UL))
#define bFM3_GPIO_EPFR10_UEA11E                   *((volatile  uint8_t *)(0x4266C548UL))
#define bFM_GPIO_EPFR10_UEA12E                    *((volatile  uint8_t *)(0x4266C54CUL))
#define bFM3_GPIO_EPFR10_UEA12E                   *((volatile  uint8_t *)(0x4266C54CUL))
#define bFM_GPIO_EPFR10_UEA13E                    *((volatile  uint8_t *)(0x4266C550UL))
#define bFM3_GPIO_EPFR10_UEA13E                   *((volatile  uint8_t *)(0x4266C550UL))
#define bFM_GPIO_EPFR10_UEA14E                    *((volatile  uint8_t *)(0x4266C554UL))
#define bFM3_GPIO_EPFR10_UEA14E                   *((volatile  uint8_t *)(0x4266C554UL))
#define bFM_GPIO_EPFR10_UEA15E                    *((volatile  uint8_t *)(0x4266C558UL))
#define bFM3_GPIO_EPFR10_UEA15E                   *((volatile  uint8_t *)(0x4266C558UL))
#define bFM_GPIO_EPFR10_UEA16E                    *((volatile  uint8_t *)(0x4266C55CUL))
#define bFM3_GPIO_EPFR10_UEA16E                   *((volatile  uint8_t *)(0x4266C55CUL))
#define bFM_GPIO_EPFR10_UEA17E                    *((volatile  uint8_t *)(0x4266C560UL))
#define bFM3_GPIO_EPFR10_UEA17E                   *((volatile  uint8_t *)(0x4266C560UL))
#define bFM_GPIO_EPFR10_UEA18E                    *((volatile  uint8_t *)(0x4266C564UL))
#define bFM3_GPIO_EPFR10_UEA18E                   *((volatile  uint8_t *)(0x4266C564UL))
#define bFM_GPIO_EPFR10_UEA19E                    *((volatile  uint8_t *)(0x4266C568UL))
#define bFM3_GPIO_EPFR10_UEA19E                   *((volatile  uint8_t *)(0x4266C568UL))
#define bFM_GPIO_EPFR10_UEA20E                    *((volatile  uint8_t *)(0x4266C56CUL))
#define bFM3_GPIO_EPFR10_UEA20E                   *((volatile  uint8_t *)(0x4266C56CUL))
#define bFM_GPIO_EPFR10_UEA21E                    *((volatile  uint8_t *)(0x4266C570UL))
#define bFM3_GPIO_EPFR10_UEA21E                   *((volatile  uint8_t *)(0x4266C570UL))
#define bFM_GPIO_EPFR10_UEA22E                    *((volatile  uint8_t *)(0x4266C574UL))
#define bFM3_GPIO_EPFR10_UEA22E                   *((volatile  uint8_t *)(0x4266C574UL))
#define bFM_GPIO_EPFR10_UEA23E                    *((volatile  uint8_t *)(0x4266C578UL))
#define bFM3_GPIO_EPFR10_UEA23E                   *((volatile  uint8_t *)(0x4266C578UL))
#define bFM_GPIO_EPFR10_UEA24E                    *((volatile  uint8_t *)(0x4266C57CUL))
#define bFM3_GPIO_EPFR10_UEA24E                   *((volatile  uint8_t *)(0x4266C57CUL))

#define bFM_GPIO_EPFR11_UEALEE                    *((volatile  uint8_t *)(0x4266C580UL))
#define bFM3_GPIO_EPFR11_UEALEE                   *((volatile  uint8_t *)(0x4266C580UL))
#define bFM_GPIO_EPFR11_UECS0E                    *((volatile  uint8_t *)(0x4266C584UL))
#define bFM3_GPIO_EPFR11_UECS0E                   *((volatile  uint8_t *)(0x4266C584UL))
#define bFM_GPIO_EPFR11_UEA01E                    *((volatile  uint8_t *)(0x4266C588UL))
#define bFM3_GPIO_EPFR11_UEA01E                   *((volatile  uint8_t *)(0x4266C588UL))
#define bFM_GPIO_EPFR11_UEA02E                    *((volatile  uint8_t *)(0x4266C58CUL))
#define bFM3_GPIO_EPFR11_UEA02E                   *((volatile  uint8_t *)(0x4266C58CUL))
#define bFM_GPIO_EPFR11_UEA03E                    *((volatile  uint8_t *)(0x4266C590UL))
#define bFM3_GPIO_EPFR11_UEA03E                   *((volatile  uint8_t *)(0x4266C590UL))
#define bFM_GPIO_EPFR11_UEA04E                    *((volatile  uint8_t *)(0x4266C594UL))
#define bFM3_GPIO_EPFR11_UEA04E                   *((volatile  uint8_t *)(0x4266C594UL))
#define bFM_GPIO_EPFR11_UEA05E                    *((volatile  uint8_t *)(0x4266C598UL))
#define bFM3_GPIO_EPFR11_UEA05E                   *((volatile  uint8_t *)(0x4266C598UL))
#define bFM_GPIO_EPFR11_UEA06E                    *((volatile  uint8_t *)(0x4266C59CUL))
#define bFM3_GPIO_EPFR11_UEA06E                   *((volatile  uint8_t *)(0x4266C59CUL))
#define bFM_GPIO_EPFR11_UEA07E                    *((volatile  uint8_t *)(0x4266C5A0UL))
#define bFM3_GPIO_EPFR11_UEA07E                   *((volatile  uint8_t *)(0x4266C5A0UL))
#define bFM_GPIO_EPFR11_UED00B                    *((volatile  uint8_t *)(0x4266C5A4UL))
#define bFM3_GPIO_EPFR11_UED00B                   *((volatile  uint8_t *)(0x4266C5A4UL))
#define bFM_GPIO_EPFR11_UED01B                    *((volatile  uint8_t *)(0x4266C5A8UL))
#define bFM3_GPIO_EPFR11_UED01B                   *((volatile  uint8_t *)(0x4266C5A8UL))
#define bFM_GPIO_EPFR11_UED02B                    *((volatile  uint8_t *)(0x4266C5ACUL))
#define bFM3_GPIO_EPFR11_UED02B                   *((volatile  uint8_t *)(0x4266C5ACUL))
#define bFM_GPIO_EPFR11_UED03B                    *((volatile  uint8_t *)(0x4266C5B0UL))
#define bFM3_GPIO_EPFR11_UED03B                   *((volatile  uint8_t *)(0x4266C5B0UL))
#define bFM_GPIO_EPFR11_UED04B                    *((volatile  uint8_t *)(0x4266C5B4UL))
#define bFM3_GPIO_EPFR11_UED04B                   *((volatile  uint8_t *)(0x4266C5B4UL))
#define bFM_GPIO_EPFR11_UED05B                    *((volatile  uint8_t *)(0x4266C5B8UL))
#define bFM3_GPIO_EPFR11_UED05B                   *((volatile  uint8_t *)(0x4266C5B8UL))
#define bFM_GPIO_EPFR11_UED06B                    *((volatile  uint8_t *)(0x4266C5BCUL))
#define bFM3_GPIO_EPFR11_UED06B                   *((volatile  uint8_t *)(0x4266C5BCUL))
#define bFM_GPIO_EPFR11_UED07B                    *((volatile  uint8_t *)(0x4266C5C0UL))
#define bFM3_GPIO_EPFR11_UED07B                   *((volatile  uint8_t *)(0x4266C5C0UL))
#define bFM_GPIO_EPFR11_UED08B                    *((volatile  uint8_t *)(0x4266C5C4UL))
#define bFM3_GPIO_EPFR11_UED08B                   *((volatile  uint8_t *)(0x4266C5C4UL))
#define bFM_GPIO_EPFR11_UED09B                    *((volatile  uint8_t *)(0x4266C5C8UL))
#define bFM3_GPIO_EPFR11_UED09B                   *((volatile  uint8_t *)(0x4266C5C8UL))
#define bFM_GPIO_EPFR11_UED10B                    *((volatile  uint8_t *)(0x4266C5CCUL))
#define bFM3_GPIO_EPFR11_UED10B                   *((volatile  uint8_t *)(0x4266C5CCUL))
#define bFM_GPIO_EPFR11_UED11B                    *((volatile  uint8_t *)(0x4266C5D0UL))
#define bFM3_GPIO_EPFR11_UED11B                   *((volatile  uint8_t *)(0x4266C5D0UL))
#define bFM_GPIO_EPFR11_UED12B                    *((volatile  uint8_t *)(0x4266C5D4UL))
#define bFM3_GPIO_EPFR11_UED12B                   *((volatile  uint8_t *)(0x4266C5D4UL))
#define bFM_GPIO_EPFR11_UED13B                    *((volatile  uint8_t *)(0x4266C5D8UL))
#define bFM3_GPIO_EPFR11_UED13B                   *((volatile  uint8_t *)(0x4266C5D8UL))
#define bFM_GPIO_EPFR11_UED14B                    *((volatile  uint8_t *)(0x4266C5DCUL))
#define bFM3_GPIO_EPFR11_UED14B                   *((volatile  uint8_t *)(0x4266C5DCUL))
#define bFM_GPIO_EPFR11_UED15B                    *((volatile  uint8_t *)(0x4266C5E0UL))
#define bFM3_GPIO_EPFR11_UED15B                   *((volatile  uint8_t *)(0x4266C5E0UL))
#define bFM_GPIO_EPFR11_UERLC                     *((volatile  uint8_t *)(0x4266C5E4UL))
#define bFM3_GPIO_EPFR11_UERLC                    *((volatile  uint8_t *)(0x4266C5E4UL))

#define bFM_GPIO_PCR0_P0                          *((volatile  uint8_t *)(0x42662000UL))
#define bFM3_GPIO_PCR0_P0                         *((volatile  uint8_t *)(0x42662000UL))
#define bFM_GPIO_PCR0_P1                          *((volatile  uint8_t *)(0x42662004UL))
#define bFM3_GPIO_PCR0_P1                         *((volatile  uint8_t *)(0x42662004UL))
#define bFM_GPIO_PCR0_P2                          *((volatile  uint8_t *)(0x42662008UL))
#define bFM3_GPIO_PCR0_P2                         *((volatile  uint8_t *)(0x42662008UL))
#define bFM_GPIO_PCR0_P3                          *((volatile  uint8_t *)(0x4266200CUL))
#define bFM3_GPIO_PCR0_P3                         *((volatile  uint8_t *)(0x4266200CUL))
#define bFM_GPIO_PCR0_P4                          *((volatile  uint8_t *)(0x42662010UL))
#define bFM3_GPIO_PCR0_P4                         *((volatile  uint8_t *)(0x42662010UL))
#define bFM_GPIO_PCR0_PF                          *((volatile  uint8_t *)(0x4266203CUL))
#define bFM3_GPIO_PCR0_PF                         *((volatile  uint8_t *)(0x4266203CUL))

#define bFM_GPIO_PCR1_P0                          *((volatile  uint8_t *)(0x42662080UL))
#define bFM3_GPIO_PCR1_P0                         *((volatile  uint8_t *)(0x42662080UL))
#define bFM_GPIO_PCR1_P1                          *((volatile  uint8_t *)(0x42662084UL))
#define bFM3_GPIO_PCR1_P1                         *((volatile  uint8_t *)(0x42662084UL))
#define bFM_GPIO_PCR1_P2                          *((volatile  uint8_t *)(0x42662088UL))
#define bFM3_GPIO_PCR1_P2                         *((volatile  uint8_t *)(0x42662088UL))
#define bFM_GPIO_PCR1_P3                          *((volatile  uint8_t *)(0x4266208CUL))
#define bFM3_GPIO_PCR1_P3                         *((volatile  uint8_t *)(0x4266208CUL))
#define bFM_GPIO_PCR1_P4                          *((volatile  uint8_t *)(0x42662090UL))
#define bFM3_GPIO_PCR1_P4                         *((volatile  uint8_t *)(0x42662090UL))
#define bFM_GPIO_PCR1_P5                          *((volatile  uint8_t *)(0x42662094UL))
#define bFM3_GPIO_PCR1_P5                         *((volatile  uint8_t *)(0x42662094UL))

