lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define bFM_GPIO_PCR2_P1                          *((volatile  uint8_t *)(0x42662104UL))
#define bFM3_GPIO_PCR2_P1                         *((volatile  uint8_t *)(0x42662104UL))
#define bFM_GPIO_PCR2_P2                          *((volatile  uint8_t *)(0x42662108UL))
#define bFM3_GPIO_PCR2_P2                         *((volatile  uint8_t *)(0x42662108UL))
#define bFM_GPIO_PCR2_P3                          *((volatile  uint8_t *)(0x4266210CUL))
#define bFM3_GPIO_PCR2_P3                         *((volatile  uint8_t *)(0x4266210CUL))

#define bFM_GPIO_PCR3_P9                          *((volatile  uint8_t *)(0x426621A4UL))
#define bFM3_GPIO_PCR3_P9                         *((volatile  uint8_t *)(0x426621A4UL))
#define bFM_GPIO_PCR3_PA                          *((volatile  uint8_t *)(0x426621A8UL))
#define bFM3_GPIO_PCR3_PA                         *((volatile  uint8_t *)(0x426621A8UL))
#define bFM_GPIO_PCR3_PB                          *((volatile  uint8_t *)(0x426621ACUL))
#define bFM3_GPIO_PCR3_PB                         *((volatile  uint8_t *)(0x426621ACUL))
#define bFM_GPIO_PCR3_PC                          *((volatile  uint8_t *)(0x426621B0UL))
#define bFM3_GPIO_PCR3_PC                         *((volatile  uint8_t *)(0x426621B0UL))
#define bFM_GPIO_PCR3_PD                          *((volatile  uint8_t *)(0x426621B4UL))
#define bFM3_GPIO_PCR3_PD                         *((volatile  uint8_t *)(0x426621B4UL))
#define bFM_GPIO_PCR3_PE                          *((volatile  uint8_t *)(0x426621B8UL))
#define bFM3_GPIO_PCR3_PE                         *((volatile  uint8_t *)(0x426621B8UL))
#define bFM_GPIO_PCR3_PF                          *((volatile  uint8_t *)(0x426621BCUL))
#define bFM3_GPIO_PCR3_PF                         *((volatile  uint8_t *)(0x426621BCUL))

#define bFM_GPIO_PCR4_P6                          *((volatile  uint8_t *)(0x42662218UL))
#define bFM3_GPIO_PCR4_P6                         *((volatile  uint8_t *)(0x42662218UL))
#define bFM_GPIO_PCR4_P7                          *((volatile  uint8_t *)(0x4266221CUL))
#define bFM3_GPIO_PCR4_P7                         *((volatile  uint8_t *)(0x4266221CUL))
#define bFM_GPIO_PCR4_P9                          *((volatile  uint8_t *)(0x42662224UL))
#define bFM3_GPIO_PCR4_P9                         *((volatile  uint8_t *)(0x42662224UL))
#define bFM_GPIO_PCR4_PA                          *((volatile  uint8_t *)(0x42662228UL))
#define bFM3_GPIO_PCR4_PA                         *((volatile  uint8_t *)(0x42662228UL))

#define bFM_GPIO_PCR5_P0                          *((volatile  uint8_t *)(0x42662280UL))
#define bFM3_GPIO_PCR5_P0                         *((volatile  uint8_t *)(0x42662280UL))
#define bFM_GPIO_PCR5_P1                          *((volatile  uint8_t *)(0x42662284UL))
#define bFM3_GPIO_PCR5_P1                         *((volatile  uint8_t *)(0x42662284UL))
#define bFM_GPIO_PCR5_P2                          *((volatile  uint8_t *)(0x42662288UL))
#define bFM3_GPIO_PCR5_P2                         *((volatile  uint8_t *)(0x42662288UL))

#define bFM_GPIO_PCR6_P0                          *((volatile  uint8_t *)(0x42662300UL))
#define bFM3_GPIO_PCR6_P0                         *((volatile  uint8_t *)(0x42662300UL))
#define bFM_GPIO_PCR6_P1                          *((volatile  uint8_t *)(0x42662304UL))
#define bFM3_GPIO_PCR6_P1                         *((volatile  uint8_t *)(0x42662304UL))

#define bFM_GPIO_PCRE_P0                          *((volatile  uint8_t *)(0x42662700UL))
#define bFM3_GPIO_PCRE_P0                         *((volatile  uint8_t *)(0x42662700UL))
#define bFM_GPIO_PCRE_P2                          *((volatile  uint8_t *)(0x42662708UL))
#define bFM3_GPIO_PCRE_P2                         *((volatile  uint8_t *)(0x42662708UL))
#define bFM_GPIO_PCRE_P3                          *((volatile  uint8_t *)(0x4266270CUL))
#define bFM3_GPIO_PCRE_P3                         *((volatile  uint8_t *)(0x4266270CUL))

#define bFM_GPIO_PDIR0_P0                         *((volatile  uint8_t *)(0x42666000UL))
#define bFM3_GPIO_PDIR0_P0                        *((volatile  uint8_t *)(0x42666000UL))
#define bFM_GPIO_PDIR0_P1                         *((volatile  uint8_t *)(0x42666004UL))
#define bFM3_GPIO_PDIR0_P1                        *((volatile  uint8_t *)(0x42666004UL))
#define bFM_GPIO_PDIR0_P2                         *((volatile  uint8_t *)(0x42666008UL))
#define bFM3_GPIO_PDIR0_P2                        *((volatile  uint8_t *)(0x42666008UL))
#define bFM_GPIO_PDIR0_P3                         *((volatile  uint8_t *)(0x4266600CUL))
#define bFM3_GPIO_PDIR0_P3                        *((volatile  uint8_t *)(0x4266600CUL))
#define bFM_GPIO_PDIR0_P4                         *((volatile  uint8_t *)(0x42666010UL))
#define bFM3_GPIO_PDIR0_P4                        *((volatile  uint8_t *)(0x42666010UL))
#define bFM_GPIO_PDIR0_PF                         *((volatile  uint8_t *)(0x4266603CUL))
#define bFM3_GPIO_PDIR0_PF                        *((volatile  uint8_t *)(0x4266603CUL))

#define bFM_GPIO_PDIR1_P0                         *((volatile  uint8_t *)(0x42666080UL))
#define bFM3_GPIO_PDIR1_P0                        *((volatile  uint8_t *)(0x42666080UL))
#define bFM_GPIO_PDIR1_P1                         *((volatile  uint8_t *)(0x42666084UL))
#define bFM3_GPIO_PDIR1_P1                        *((volatile  uint8_t *)(0x42666084UL))
#define bFM_GPIO_PDIR1_P2                         *((volatile  uint8_t *)(0x42666088UL))
#define bFM3_GPIO_PDIR1_P2                        *((volatile  uint8_t *)(0x42666088UL))
#define bFM_GPIO_PDIR1_P3                         *((volatile  uint8_t *)(0x4266608CUL))
#define bFM3_GPIO_PDIR1_P3                        *((volatile  uint8_t *)(0x4266608CUL))
#define bFM_GPIO_PDIR1_P4                         *((volatile  uint8_t *)(0x42666090UL))
#define bFM3_GPIO_PDIR1_P4                        *((volatile  uint8_t *)(0x42666090UL))
#define bFM_GPIO_PDIR1_P5                         *((volatile  uint8_t *)(0x42666094UL))
#define bFM3_GPIO_PDIR1_P5                        *((volatile  uint8_t *)(0x42666094UL))

#define bFM_GPIO_PDIR2_P1                         *((volatile  uint8_t *)(0x42666104UL))
#define bFM3_GPIO_PDIR2_P1                        *((volatile  uint8_t *)(0x42666104UL))
#define bFM_GPIO_PDIR2_P2                         *((volatile  uint8_t *)(0x42666108UL))
#define bFM3_GPIO_PDIR2_P2                        *((volatile  uint8_t *)(0x42666108UL))
#define bFM_GPIO_PDIR2_P3                         *((volatile  uint8_t *)(0x4266610CUL))
#define bFM3_GPIO_PDIR2_P3                        *((volatile  uint8_t *)(0x4266610CUL))

