lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define bFM_GPIO_PDOR5_P0                         *((volatile  uint8_t *)(0x42668280UL))
#define bFM3_GPIO_PDOR5_P0                        *((volatile  uint8_t *)(0x42668280UL))
#define bFM_GPIO_PDOR5_P1                         *((volatile  uint8_t *)(0x42668284UL))
#define bFM3_GPIO_PDOR5_P1                        *((volatile  uint8_t *)(0x42668284UL))
#define bFM_GPIO_PDOR5_P2                         *((volatile  uint8_t *)(0x42668288UL))
#define bFM3_GPIO_PDOR5_P2                        *((volatile  uint8_t *)(0x42668288UL))

#define bFM_GPIO_PDOR6_P0                         *((volatile  uint8_t *)(0x42668300UL))
#define bFM3_GPIO_PDOR6_P0                        *((volatile  uint8_t *)(0x42668300UL))
#define bFM_GPIO_PDOR6_P1                         *((volatile  uint8_t *)(0x42668304UL))
#define bFM3_GPIO_PDOR6_P1                        *((volatile  uint8_t *)(0x42668304UL))

#define bFM_GPIO_PDOR8_P0                         *((volatile  uint8_t *)(0x42668400UL))
#define bFM3_GPIO_PDOR8_P0                        *((volatile  uint8_t *)(0x42668400UL))
#define bFM_GPIO_PDOR8_P1                         *((volatile  uint8_t *)(0x42668404UL))
#define bFM3_GPIO_PDOR8_P1                        *((volatile  uint8_t *)(0x42668404UL))

#define bFM_GPIO_PDORE_P0                         *((volatile  uint8_t *)(0x42668700UL))
#define bFM3_GPIO_PDORE_P0                        *((volatile  uint8_t *)(0x42668700UL))
#define bFM_GPIO_PDORE_P2                         *((volatile  uint8_t *)(0x42668708UL))
#define bFM3_GPIO_PDORE_P2                        *((volatile  uint8_t *)(0x42668708UL))
#define bFM_GPIO_PDORE_P3                         *((volatile  uint8_t *)(0x4266870CUL))
#define bFM3_GPIO_PDORE_P3                        *((volatile  uint8_t *)(0x4266870CUL))

#define bFM_GPIO_PFR0_P0                          *((volatile  uint8_t *)(0x42660000UL))
#define bFM3_GPIO_PFR0_P0                         *((volatile  uint8_t *)(0x42660000UL))
#define bFM_GPIO_PFR0_P1                          *((volatile  uint8_t *)(0x42660004UL))
#define bFM3_GPIO_PFR0_P1                         *((volatile  uint8_t *)(0x42660004UL))
#define bFM_GPIO_PFR0_P2                          *((volatile  uint8_t *)(0x42660008UL))
#define bFM3_GPIO_PFR0_P2                         *((volatile  uint8_t *)(0x42660008UL))
#define bFM_GPIO_PFR0_P3                          *((volatile  uint8_t *)(0x4266000CUL))
#define bFM3_GPIO_PFR0_P3                         *((volatile  uint8_t *)(0x4266000CUL))
#define bFM_GPIO_PFR0_P4                          *((volatile  uint8_t *)(0x42660010UL))
#define bFM3_GPIO_PFR0_P4                         *((volatile  uint8_t *)(0x42660010UL))
#define bFM_GPIO_PFR0_PF                          *((volatile  uint8_t *)(0x4266003CUL))
#define bFM3_GPIO_PFR0_PF                         *((volatile  uint8_t *)(0x4266003CUL))

#define bFM_GPIO_PFR1_P0                          *((volatile  uint8_t *)(0x42660080UL))
#define bFM3_GPIO_PFR1_P0                         *((volatile  uint8_t *)(0x42660080UL))
#define bFM_GPIO_PFR1_P1                          *((volatile  uint8_t *)(0x42660084UL))
#define bFM3_GPIO_PFR1_P1                         *((volatile  uint8_t *)(0x42660084UL))
#define bFM_GPIO_PFR1_P2                          *((volatile  uint8_t *)(0x42660088UL))
#define bFM3_GPIO_PFR1_P2                         *((volatile  uint8_t *)(0x42660088UL))
#define bFM_GPIO_PFR1_P3                          *((volatile  uint8_t *)(0x4266008CUL))
#define bFM3_GPIO_PFR1_P3                         *((volatile  uint8_t *)(0x4266008CUL))
#define bFM_GPIO_PFR1_P4                          *((volatile  uint8_t *)(0x42660090UL))
#define bFM3_GPIO_PFR1_P4                         *((volatile  uint8_t *)(0x42660090UL))
#define bFM_GPIO_PFR1_P5                          *((volatile  uint8_t *)(0x42660094UL))
#define bFM3_GPIO_PFR1_P5                         *((volatile  uint8_t *)(0x42660094UL))

#define bFM_GPIO_PFR2_P1                          *((volatile  uint8_t *)(0x42660104UL))
#define bFM3_GPIO_PFR2_P1                         *((volatile  uint8_t *)(0x42660104UL))
#define bFM_GPIO_PFR2_P2                          *((volatile  uint8_t *)(0x42660108UL))
#define bFM3_GPIO_PFR2_P2                         *((volatile  uint8_t *)(0x42660108UL))
#define bFM_GPIO_PFR2_P3                          *((volatile  uint8_t *)(0x4266010CUL))
#define bFM3_GPIO_PFR2_P3                         *((volatile  uint8_t *)(0x4266010CUL))

#define bFM_GPIO_PFR3_P9                          *((volatile  uint8_t *)(0x426601A4UL))
#define bFM3_GPIO_PFR3_P9                         *((volatile  uint8_t *)(0x426601A4UL))
#define bFM_GPIO_PFR3_PA                          *((volatile  uint8_t *)(0x426601A8UL))
#define bFM3_GPIO_PFR3_PA                         *((volatile  uint8_t *)(0x426601A8UL))
#define bFM_GPIO_PFR3_PB                          *((volatile  uint8_t *)(0x426601ACUL))
#define bFM3_GPIO_PFR3_PB                         *((volatile  uint8_t *)(0x426601ACUL))
#define bFM_GPIO_PFR3_PC                          *((volatile  uint8_t *)(0x426601B0UL))
#define bFM3_GPIO_PFR3_PC                         *((volatile  uint8_t *)(0x426601B0UL))
#define bFM_GPIO_PFR3_PD                          *((volatile  uint8_t *)(0x426601B4UL))
#define bFM3_GPIO_PFR3_PD                         *((volatile  uint8_t *)(0x426601B4UL))
#define bFM_GPIO_PFR3_PE                          *((volatile  uint8_t *)(0x426601B8UL))
#define bFM3_GPIO_PFR3_PE                         *((volatile  uint8_t *)(0x426601B8UL))
#define bFM_GPIO_PFR3_PF                          *((volatile  uint8_t *)(0x426601BCUL))
#define bFM3_GPIO_PFR3_PF                         *((volatile  uint8_t *)(0x426601BCUL))

#define bFM_GPIO_PFR4_P6                          *((volatile  uint8_t *)(0x42660218UL))
#define bFM3_GPIO_PFR4_P6                         *((volatile  uint8_t *)(0x42660218UL))
#define bFM_GPIO_PFR4_P7                          *((volatile  uint8_t *)(0x4266021CUL))
#define bFM3_GPIO_PFR4_P7                         *((volatile  uint8_t *)(0x4266021CUL))
#define bFM_GPIO_PFR4_P9                          *((volatile  uint8_t *)(0x42660224UL))
#define bFM3_GPIO_PFR4_P9                         *((volatile  uint8_t *)(0x42660224UL))
#define bFM_GPIO_PFR4_PA                          *((volatile  uint8_t *)(0x42660228UL))
#define bFM3_GPIO_PFR4_PA                         *((volatile  uint8_t *)(0x42660228UL))

#define bFM_GPIO_PFR5_P0                          *((volatile  uint8_t *)(0x42660280UL))
#define bFM3_GPIO_PFR5_P0                         *((volatile  uint8_t *)(0x42660280UL))
#define bFM_GPIO_PFR5_P1                          *((volatile  uint8_t *)(0x42660284UL))
#define bFM3_GPIO_PFR5_P1                         *((volatile  uint8_t *)(0x42660284UL))
#define bFM_GPIO_PFR5_P2                          *((volatile  uint8_t *)(0x42660288UL))
#define bFM3_GPIO_PFR5_P2                         *((volatile  uint8_t *)(0x42660288UL))

#define bFM_GPIO_PFR6_P0                          *((volatile  uint8_t *)(0x42660300UL))
#define bFM3_GPIO_PFR6_P0                         *((volatile  uint8_t *)(0x42660300UL))
#define bFM_GPIO_PFR6_P1                          *((volatile  uint8_t *)(0x42660304UL))
#define bFM3_GPIO_PFR6_P1                         *((volatile  uint8_t *)(0x42660304UL))

