lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define bFM_GPIO_PFR8_P0                          *((volatile  uint8_t *)(0x42660400UL))
#define bFM3_GPIO_PFR8_P0                         *((volatile  uint8_t *)(0x42660400UL))
#define bFM_GPIO_PFR8_P1                          *((volatile  uint8_t *)(0x42660404UL))
#define bFM3_GPIO_PFR8_P1                         *((volatile  uint8_t *)(0x42660404UL))

#define bFM_GPIO_PFRE_P0                          *((volatile  uint8_t *)(0x42660700UL))
#define bFM3_GPIO_PFRE_P0                         *((volatile  uint8_t *)(0x42660700UL))
#define bFM_GPIO_PFRE_P2                          *((volatile  uint8_t *)(0x42660708UL))
#define bFM3_GPIO_PFRE_P2                         *((volatile  uint8_t *)(0x42660708UL))
#define bFM_GPIO_PFRE_P3                          *((volatile  uint8_t *)(0x4266070CUL))
#define bFM3_GPIO_PFRE_P3                         *((volatile  uint8_t *)(0x4266070CUL))

#define bFM_GPIO_PZR0_P0                          *((volatile  uint8_t *)(0x4266E000UL))
#define bFM3_GPIO_PZR0_P0                         *((volatile  uint8_t *)(0x4266E000UL))
#define bFM_GPIO_PZR0_P1                          *((volatile  uint8_t *)(0x4266E004UL))
#define bFM3_GPIO_PZR0_P1                         *((volatile  uint8_t *)(0x4266E004UL))
#define bFM_GPIO_PZR0_P2                          *((volatile  uint8_t *)(0x4266E008UL))
#define bFM3_GPIO_PZR0_P2                         *((volatile  uint8_t *)(0x4266E008UL))
#define bFM_GPIO_PZR0_P3                          *((volatile  uint8_t *)(0x4266E00CUL))
#define bFM3_GPIO_PZR0_P3                         *((volatile  uint8_t *)(0x4266E00CUL))
#define bFM_GPIO_PZR0_P4                          *((volatile  uint8_t *)(0x4266E010UL))
#define bFM3_GPIO_PZR0_P4                         *((volatile  uint8_t *)(0x4266E010UL))
#define bFM_GPIO_PZR0_PF                          *((volatile  uint8_t *)(0x4266E03CUL))
#define bFM3_GPIO_PZR0_PF                         *((volatile  uint8_t *)(0x4266E03CUL))

#define bFM_GPIO_PZR1_P0                          *((volatile  uint8_t *)(0x4266E080UL))
#define bFM3_GPIO_PZR1_P0                         *((volatile  uint8_t *)(0x4266E080UL))
#define bFM_GPIO_PZR1_P1                          *((volatile  uint8_t *)(0x4266E084UL))
#define bFM3_GPIO_PZR1_P1                         *((volatile  uint8_t *)(0x4266E084UL))
#define bFM_GPIO_PZR1_P2                          *((volatile  uint8_t *)(0x4266E088UL))
#define bFM3_GPIO_PZR1_P2                         *((volatile  uint8_t *)(0x4266E088UL))
#define bFM_GPIO_PZR1_P3                          *((volatile  uint8_t *)(0x4266E08CUL))
#define bFM3_GPIO_PZR1_P3                         *((volatile  uint8_t *)(0x4266E08CUL))
#define bFM_GPIO_PZR1_P4                          *((volatile  uint8_t *)(0x4266E090UL))
#define bFM3_GPIO_PZR1_P4                         *((volatile  uint8_t *)(0x4266E090UL))
#define bFM_GPIO_PZR1_P5                          *((volatile  uint8_t *)(0x4266E094UL))
#define bFM3_GPIO_PZR1_P5                         *((volatile  uint8_t *)(0x4266E094UL))

#define bFM_GPIO_PZR2_P1                          *((volatile  uint8_t *)(0x4266E104UL))
#define bFM3_GPIO_PZR2_P1                         *((volatile  uint8_t *)(0x4266E104UL))
#define bFM_GPIO_PZR2_P2                          *((volatile  uint8_t *)(0x4266E108UL))
#define bFM3_GPIO_PZR2_P2                         *((volatile  uint8_t *)(0x4266E108UL))
#define bFM_GPIO_PZR2_P3                          *((volatile  uint8_t *)(0x4266E10CUL))
#define bFM3_GPIO_PZR2_P3                         *((volatile  uint8_t *)(0x4266E10CUL))

#define bFM_GPIO_PZR3_P9                          *((volatile  uint8_t *)(0x4266E1A4UL))
#define bFM3_GPIO_PZR3_P9                         *((volatile  uint8_t *)(0x4266E1A4UL))
#define bFM_GPIO_PZR3_PA                          *((volatile  uint8_t *)(0x4266E1A8UL))
#define bFM3_GPIO_PZR3_PA                         *((volatile  uint8_t *)(0x4266E1A8UL))
#define bFM_GPIO_PZR3_PB                          *((volatile  uint8_t *)(0x4266E1ACUL))
#define bFM3_GPIO_PZR3_PB                         *((volatile  uint8_t *)(0x4266E1ACUL))
#define bFM_GPIO_PZR3_PC                          *((volatile  uint8_t *)(0x4266E1B0UL))
#define bFM3_GPIO_PZR3_PC                         *((volatile  uint8_t *)(0x4266E1B0UL))
#define bFM_GPIO_PZR3_PD                          *((volatile  uint8_t *)(0x4266E1B4UL))
#define bFM3_GPIO_PZR3_PD                         *((volatile  uint8_t *)(0x4266E1B4UL))
#define bFM_GPIO_PZR3_PE                          *((volatile  uint8_t *)(0x4266E1B8UL))
#define bFM3_GPIO_PZR3_PE                         *((volatile  uint8_t *)(0x4266E1B8UL))
#define bFM_GPIO_PZR3_PF                          *((volatile  uint8_t *)(0x4266E1BCUL))
#define bFM3_GPIO_PZR3_PF                         *((volatile  uint8_t *)(0x4266E1BCUL))

#define bFM_GPIO_PZR4_P6                          *((volatile  uint8_t *)(0x4266E218UL))
#define bFM3_GPIO_PZR4_P6                         *((volatile  uint8_t *)(0x4266E218UL))
#define bFM_GPIO_PZR4_P7                          *((volatile  uint8_t *)(0x4266E21CUL))
#define bFM3_GPIO_PZR4_P7                         *((volatile  uint8_t *)(0x4266E21CUL))
#define bFM_GPIO_PZR4_P9                          *((volatile  uint8_t *)(0x4266E224UL))
#define bFM3_GPIO_PZR4_P9                         *((volatile  uint8_t *)(0x4266E224UL))
#define bFM_GPIO_PZR4_PA                          *((volatile  uint8_t *)(0x4266E228UL))
#define bFM3_GPIO_PZR4_PA                         *((volatile  uint8_t *)(0x4266E228UL))

#define bFM_GPIO_PZR5_P0                          *((volatile  uint8_t *)(0x4266E280UL))
#define bFM3_GPIO_PZR5_P0                         *((volatile  uint8_t *)(0x4266E280UL))
#define bFM_GPIO_PZR5_P1                          *((volatile  uint8_t *)(0x4266E284UL))
#define bFM3_GPIO_PZR5_P1                         *((volatile  uint8_t *)(0x4266E284UL))
#define bFM_GPIO_PZR5_P2                          *((volatile  uint8_t *)(0x4266E288UL))
#define bFM3_GPIO_PZR5_P2                         *((volatile  uint8_t *)(0x4266E288UL))

