lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define bFM_INTREQ_IRQ01MON_SWWDTINT              *((volatile  uint8_t *)(0x42620300UL))
#define bFM3_INTREQ_IRQ01MON_SWWDTINT             *((volatile  uint8_t *)(0x42620300UL))

#define bFM_INTREQ_IRQ02MON_LVDINT                *((volatile  uint8_t *)(0x42620380UL))
#define bFM3_INTREQ_IRQ02MON_LVDINT               *((volatile  uint8_t *)(0x42620380UL))

#define bFM_INTREQ_IRQ04MON_EXTINT0               *((volatile  uint8_t *)(0x42620480UL))
#define bFM3_INTREQ_IRQ04MON_EXTINT0              *((volatile  uint8_t *)(0x42620480UL))
#define bFM_INTREQ_IRQ04MON_EXTINT1               *((volatile  uint8_t *)(0x42620484UL))
#define bFM3_INTREQ_IRQ04MON_EXTINT1              *((volatile  uint8_t *)(0x42620484UL))
#define bFM_INTREQ_IRQ04MON_EXTINT2               *((volatile  uint8_t *)(0x42620488UL))
#define bFM3_INTREQ_IRQ04MON_EXTINT2              *((volatile  uint8_t *)(0x42620488UL))
#define bFM_INTREQ_IRQ04MON_EXTINT3               *((volatile  uint8_t *)(0x4262048CUL))
#define bFM3_INTREQ_IRQ04MON_EXTINT3              *((volatile  uint8_t *)(0x4262048CUL))
#define bFM_INTREQ_IRQ04MON_EXTINT4               *((volatile  uint8_t *)(0x42620490UL))
#define bFM3_INTREQ_IRQ04MON_EXTINT4              *((volatile  uint8_t *)(0x42620490UL))
#define bFM_INTREQ_IRQ04MON_EXTINT5               *((volatile  uint8_t *)(0x42620494UL))
#define bFM3_INTREQ_IRQ04MON_EXTINT5              *((volatile  uint8_t *)(0x42620494UL))
#define bFM_INTREQ_IRQ04MON_EXTINT6               *((volatile  uint8_t *)(0x42620498UL))
#define bFM3_INTREQ_IRQ04MON_EXTINT6              *((volatile  uint8_t *)(0x42620498UL))
#define bFM_INTREQ_IRQ04MON_EXTINT7               *((volatile  uint8_t *)(0x4262049CUL))
#define bFM3_INTREQ_IRQ04MON_EXTINT7              *((volatile  uint8_t *)(0x4262049CUL))

#define bFM_INTREQ_IRQ05MON_EXTINT8               *((volatile  uint8_t *)(0x42620500UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT8              *((volatile  uint8_t *)(0x42620500UL))
#define bFM_INTREQ_IRQ05MON_EXTINT9               *((volatile  uint8_t *)(0x42620504UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT9              *((volatile  uint8_t *)(0x42620504UL))
#define bFM_INTREQ_IRQ05MON_EXTINT10              *((volatile  uint8_t *)(0x42620508UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT10             *((volatile  uint8_t *)(0x42620508UL))
#define bFM_INTREQ_IRQ05MON_EXTINT11              *((volatile  uint8_t *)(0x4262050CUL))
#define bFM3_INTREQ_IRQ05MON_EXTINT11             *((volatile  uint8_t *)(0x4262050CUL))
#define bFM_INTREQ_IRQ05MON_EXTINT12              *((volatile  uint8_t *)(0x42620510UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT12             *((volatile  uint8_t *)(0x42620510UL))
#define bFM_INTREQ_IRQ05MON_EXTINT13              *((volatile  uint8_t *)(0x42620514UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT13             *((volatile  uint8_t *)(0x42620514UL))
#define bFM_INTREQ_IRQ05MON_EXTINT14              *((volatile  uint8_t *)(0x42620518UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT14             *((volatile  uint8_t *)(0x42620518UL))
#define bFM_INTREQ_IRQ05MON_EXTINT15              *((volatile  uint8_t *)(0x4262051CUL))
#define bFM3_INTREQ_IRQ05MON_EXTINT15             *((volatile  uint8_t *)(0x4262051CUL))
#define bFM_INTREQ_IRQ05MON_EXTINT16              *((volatile  uint8_t *)(0x42620520UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT16             *((volatile  uint8_t *)(0x42620520UL))
#define bFM_INTREQ_IRQ05MON_EXTINT17              *((volatile  uint8_t *)(0x42620524UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT17             *((volatile  uint8_t *)(0x42620524UL))
#define bFM_INTREQ_IRQ05MON_EXTINT18              *((volatile  uint8_t *)(0x42620528UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT18             *((volatile  uint8_t *)(0x42620528UL))
#define bFM_INTREQ_IRQ05MON_EXTINT19              *((volatile  uint8_t *)(0x4262052CUL))
#define bFM3_INTREQ_IRQ05MON_EXTINT19             *((volatile  uint8_t *)(0x4262052CUL))
#define bFM_INTREQ_IRQ05MON_EXTINT20              *((volatile  uint8_t *)(0x42620530UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT20             *((volatile  uint8_t *)(0x42620530UL))
#define bFM_INTREQ_IRQ05MON_EXTINT21              *((volatile  uint8_t *)(0x42620534UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT21             *((volatile  uint8_t *)(0x42620534UL))
#define bFM_INTREQ_IRQ05MON_EXTINT22              *((volatile  uint8_t *)(0x42620538UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT22             *((volatile  uint8_t *)(0x42620538UL))
#define bFM_INTREQ_IRQ05MON_EXTINT23              *((volatile  uint8_t *)(0x4262053CUL))
#define bFM3_INTREQ_IRQ05MON_EXTINT23             *((volatile  uint8_t *)(0x4262053CUL))
#define bFM_INTREQ_IRQ05MON_EXTINT24              *((volatile  uint8_t *)(0x42620540UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT24             *((volatile  uint8_t *)(0x42620540UL))
#define bFM_INTREQ_IRQ05MON_EXTINT25              *((volatile  uint8_t *)(0x42620544UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT25             *((volatile  uint8_t *)(0x42620544UL))
#define bFM_INTREQ_IRQ05MON_EXTINT26              *((volatile  uint8_t *)(0x42620548UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT26             *((volatile  uint8_t *)(0x42620548UL))
#define bFM_INTREQ_IRQ05MON_EXTINT27              *((volatile  uint8_t *)(0x4262054CUL))
#define bFM3_INTREQ_IRQ05MON_EXTINT27             *((volatile  uint8_t *)(0x4262054CUL))
#define bFM_INTREQ_IRQ05MON_EXTINT28              *((volatile  uint8_t *)(0x42620550UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT28             *((volatile  uint8_t *)(0x42620550UL))
#define bFM_INTREQ_IRQ05MON_EXTINT29              *((volatile  uint8_t *)(0x42620554UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT29             *((volatile  uint8_t *)(0x42620554UL))
#define bFM_INTREQ_IRQ05MON_EXTINT30              *((volatile  uint8_t *)(0x42620558UL))
#define bFM3_INTREQ_IRQ05MON_EXTINT30             *((volatile  uint8_t *)(0x42620558UL))
#define bFM_INTREQ_IRQ05MON_EXTINT31              *((volatile  uint8_t *)(0x4262055CUL))
#define bFM3_INTREQ_IRQ05MON_EXTINT31             *((volatile  uint8_t *)(0x4262055CUL))

