lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define bFM_INTREQ_IRQ23MON_PPGINT00              *((volatile  uint8_t *)(0x42620E00UL))
#define bFM3_INTREQ_IRQ23MON_PPGINT00             *((volatile  uint8_t *)(0x42620E00UL))
#define bFM_INTREQ_IRQ23MON_PPGINT02              *((volatile  uint8_t *)(0x42620E04UL))
#define bFM3_INTREQ_IRQ23MON_PPGINT02             *((volatile  uint8_t *)(0x42620E04UL))
#define bFM_INTREQ_IRQ23MON_PPGINT04              *((volatile  uint8_t *)(0x42620E08UL))
#define bFM3_INTREQ_IRQ23MON_PPGINT04             *((volatile  uint8_t *)(0x42620E08UL))
#define bFM_INTREQ_IRQ23MON_PPGINT08              *((volatile  uint8_t *)(0x42620E0CUL))
#define bFM3_INTREQ_IRQ23MON_PPGINT08             *((volatile  uint8_t *)(0x42620E0CUL))
#define bFM_INTREQ_IRQ23MON_PPGINT10              *((volatile  uint8_t *)(0x42620E10UL))
#define bFM3_INTREQ_IRQ23MON_PPGINT10             *((volatile  uint8_t *)(0x42620E10UL))
#define bFM_INTREQ_IRQ23MON_PPGINT12              *((volatile  uint8_t *)(0x42620E14UL))
#define bFM3_INTREQ_IRQ23MON_PPGINT12             *((volatile  uint8_t *)(0x42620E14UL))
#define bFM_INTREQ_IRQ23MON_PPGINT16              *((volatile  uint8_t *)(0x42620E18UL))
#define bFM3_INTREQ_IRQ23MON_PPGINT16             *((volatile  uint8_t *)(0x42620E18UL))
#define bFM_INTREQ_IRQ23MON_PPGINT18              *((volatile  uint8_t *)(0x42620E1CUL))
#define bFM3_INTREQ_IRQ23MON_PPGINT18             *((volatile  uint8_t *)(0x42620E1CUL))
#define bFM_INTREQ_IRQ23MON_PPGINT20              *((volatile  uint8_t *)(0x42620E20UL))
#define bFM3_INTREQ_IRQ23MON_PPGINT20             *((volatile  uint8_t *)(0x42620E20UL))

#define bFM_INTREQ_IRQ24MON_MOSCINT               *((volatile  uint8_t *)(0x42620E80UL))
#define bFM3_INTREQ_IRQ24MON_MOSCINT              *((volatile  uint8_t *)(0x42620E80UL))
#define bFM_INTREQ_IRQ24MON_SOSCINT               *((volatile  uint8_t *)(0x42620E84UL))
#define bFM3_INTREQ_IRQ24MON_SOSCINT              *((volatile  uint8_t *)(0x42620E84UL))
#define bFM_INTREQ_IRQ24MON_MPLLINT               *((volatile  uint8_t *)(0x42620E88UL))
#define bFM3_INTREQ_IRQ24MON_MPLLINT              *((volatile  uint8_t *)(0x42620E88UL))
#define bFM_INTREQ_IRQ24MON_UPLLINT               *((volatile  uint8_t *)(0x42620E8CUL))
#define bFM3_INTREQ_IRQ24MON_UPLLINT              *((volatile  uint8_t *)(0x42620E8CUL))
#define bFM_INTREQ_IRQ24MON_WCINT                 *((volatile  uint8_t *)(0x42620E90UL))
#define bFM3_INTREQ_IRQ24MON_WCINT                *((volatile  uint8_t *)(0x42620E90UL))
#define bFM_INTREQ_IRQ24MON_RTCINT                *((volatile  uint8_t *)(0x42620E94UL))
#define bFM3_INTREQ_IRQ24MON_RTCINT               *((volatile  uint8_t *)(0x42620E94UL))

#define bFM_INTREQ_IRQ25MON_ADCINT0               *((volatile  uint8_t *)(0x42620F00UL))
#define bFM3_INTREQ_IRQ25MON_ADCINT0              *((volatile  uint8_t *)(0x42620F00UL))
#define bFM_INTREQ_IRQ25MON_ADCINT1               *((volatile  uint8_t *)(0x42620F04UL))
#define bFM3_INTREQ_IRQ25MON_ADCINT1              *((volatile  uint8_t *)(0x42620F04UL))
#define bFM_INTREQ_IRQ25MON_ADCINT2               *((volatile  uint8_t *)(0x42620F08UL))
#define bFM3_INTREQ_IRQ25MON_ADCINT2              *((volatile  uint8_t *)(0x42620F08UL))
#define bFM_INTREQ_IRQ25MON_ADCINT3               *((volatile  uint8_t *)(0x42620F0CUL))
#define bFM3_INTREQ_IRQ25MON_ADCINT3              *((volatile  uint8_t *)(0x42620F0CUL))

#define bFM_INTREQ_IRQ26MON_ADCINT0               *((volatile  uint8_t *)(0x42620F80UL))
#define bFM3_INTREQ_IRQ26MON_ADCINT0              *((volatile  uint8_t *)(0x42620F80UL))
#define bFM_INTREQ_IRQ26MON_ADCINT1               *((volatile  uint8_t *)(0x42620F84UL))
#define bFM3_INTREQ_IRQ26MON_ADCINT1              *((volatile  uint8_t *)(0x42620F84UL))
#define bFM_INTREQ_IRQ26MON_ADCINT2               *((volatile  uint8_t *)(0x42620F88UL))
#define bFM3_INTREQ_IRQ26MON_ADCINT2              *((volatile  uint8_t *)(0x42620F88UL))
#define bFM_INTREQ_IRQ26MON_ADCINT3               *((volatile  uint8_t *)(0x42620F8CUL))
#define bFM3_INTREQ_IRQ26MON_ADCINT3              *((volatile  uint8_t *)(0x42620F8CUL))

#define bFM_INTREQ_IRQ27MON_ADCINT0               *((volatile  uint8_t *)(0x42621000UL))
#define bFM3_INTREQ_IRQ27MON_ADCINT0              *((volatile  uint8_t *)(0x42621000UL))
#define bFM_INTREQ_IRQ27MON_ADCINT1               *((volatile  uint8_t *)(0x42621004UL))
#define bFM3_INTREQ_IRQ27MON_ADCINT1              *((volatile  uint8_t *)(0x42621004UL))
#define bFM_INTREQ_IRQ27MON_ADCINT2               *((volatile  uint8_t *)(0x42621008UL))
#define bFM3_INTREQ_IRQ27MON_ADCINT2              *((volatile  uint8_t *)(0x42621008UL))
#define bFM_INTREQ_IRQ27MON_ADCINT3               *((volatile  uint8_t *)(0x4262100CUL))
#define bFM3_INTREQ_IRQ27MON_ADCINT3              *((volatile  uint8_t *)(0x4262100CUL))
#define bFM_INTREQ_IRQ27MON_LCDCINT               *((volatile  uint8_t *)(0x42621010UL))
#define bFM3_INTREQ_IRQ27MON_LCDCINT              *((volatile  uint8_t *)(0x42621010UL))

#define bFM_INTREQ_IRQ31MON_BTINT0                *((volatile  uint8_t *)(0x42621200UL))
#define bFM3_INTREQ_IRQ31MON_BTINT0               *((volatile  uint8_t *)(0x42621200UL))
#define bFM_INTREQ_IRQ31MON_BTINT1                *((volatile  uint8_t *)(0x42621204UL))
#define bFM3_INTREQ_IRQ31MON_BTINT1               *((volatile  uint8_t *)(0x42621204UL))
#define bFM_INTREQ_IRQ31MON_BTINT2                *((volatile  uint8_t *)(0x42621208UL))
#define bFM3_INTREQ_IRQ31MON_BTINT2               *((volatile  uint8_t *)(0x42621208UL))
#define bFM_INTREQ_IRQ31MON_BTINT3                *((volatile  uint8_t *)(0x4262120CUL))
#define bFM3_INTREQ_IRQ31MON_BTINT3               *((volatile  uint8_t *)(0x4262120CUL))
#define bFM_INTREQ_IRQ31MON_BTINT4                *((volatile  uint8_t *)(0x42621210UL))
#define bFM3_INTREQ_IRQ31MON_BTINT4               *((volatile  uint8_t *)(0x42621210UL))
#define bFM_INTREQ_IRQ31MON_BTINT5                *((volatile  uint8_t *)(0x42621214UL))
#define bFM3_INTREQ_IRQ31MON_BTINT5               *((volatile  uint8_t *)(0x42621214UL))
#define bFM_INTREQ_IRQ31MON_BTINT6                *((volatile  uint8_t *)(0x42621218UL))
#define bFM3_INTREQ_IRQ31MON_BTINT6               *((volatile  uint8_t *)(0x42621218UL))
#define bFM_INTREQ_IRQ31MON_BTINT7                *((volatile  uint8_t *)(0x4262121CUL))
#define bFM3_INTREQ_IRQ31MON_BTINT7               *((volatile  uint8_t *)(0x4262121CUL))
#define bFM_INTREQ_IRQ31MON_BTINT8                *((volatile  uint8_t *)(0x42621220UL))
#define bFM3_INTREQ_IRQ31MON_BTINT8               *((volatile  uint8_t *)(0x42621220UL))
#define bFM_INTREQ_IRQ31MON_BTINT9                *((volatile  uint8_t *)(0x42621224UL))
#define bFM3_INTREQ_IRQ31MON_BTINT9               *((volatile  uint8_t *)(0x42621224UL))
#define bFM_INTREQ_IRQ31MON_BTINT10               *((volatile  uint8_t *)(0x42621228UL))
#define bFM3_INTREQ_IRQ31MON_BTINT10              *((volatile  uint8_t *)(0x42621228UL))
#define bFM_INTREQ_IRQ31MON_BTINT11               *((volatile  uint8_t *)(0x4262122CUL))
#define bFM3_INTREQ_IRQ31MON_BTINT11              *((volatile  uint8_t *)(0x4262122CUL))
#define bFM_INTREQ_IRQ31MON_BTINT12               *((volatile  uint8_t *)(0x42621230UL))
#define bFM3_INTREQ_IRQ31MON_BTINT12              *((volatile  uint8_t *)(0x42621230UL))
#define bFM_INTREQ_IRQ31MON_BTINT13               *((volatile  uint8_t *)(0x42621234UL))
#define bFM3_INTREQ_IRQ31MON_BTINT13              *((volatile  uint8_t *)(0x42621234UL))
#define bFM_INTREQ_IRQ31MON_BTINT14               *((volatile  uint8_t *)(0x42621238UL))
#define bFM3_INTREQ_IRQ31MON_BTINT14              *((volatile  uint8_t *)(0x42621238UL))
#define bFM_INTREQ_IRQ31MON_BTINT15               *((volatile  uint8_t *)(0x4262123CUL))
#define bFM3_INTREQ_IRQ31MON_BTINT15              *((volatile  uint8_t *)(0x4262123CUL))

#define bFM_INTREQ_IRQ32MON_CAN0INT               *((volatile  uint8_t *)(0x42621280UL))
#define bFM3_INTREQ_IRQ32MON_CAN0INT              *((volatile  uint8_t *)(0x42621280UL))
#define bFM_INTREQ_IRQ32MON_MAC0SBD               *((volatile  uint8_t *)(0x42621284UL))
#define bFM3_INTREQ_IRQ32MON_MAC0SBD              *((volatile  uint8_t *)(0x42621284UL))
#define bFM_INTREQ_IRQ32MON_MAC0PMI               *((volatile  uint8_t *)(0x42621288UL))
#define bFM3_INTREQ_IRQ32MON_MAC0PMI              *((volatile  uint8_t *)(0x42621288UL))
#define bFM_INTREQ_IRQ32MON_MAC0LPI               *((volatile  uint8_t *)(0x4262128CUL))
#define bFM3_INTREQ_IRQ32MON_MAC0LPI              *((volatile  uint8_t *)(0x4262128CUL))

#define bFM_INTREQ_IRQ33MON_CAN1INT               *((volatile  uint8_t *)(0x42621300UL))
#define bFM3_INTREQ_IRQ33MON_CAN1INT              *((volatile  uint8_t *)(0x42621300UL))
#define bFM_INTREQ_IRQ33MON_MAC1SBD               *((volatile  uint8_t *)(0x42621304UL))
#define bFM3_INTREQ_IRQ33MON_MAC1SBD              *((volatile  uint8_t *)(0x42621304UL))
#define bFM_INTREQ_IRQ33MON_MAC1PMI               *((volatile  uint8_t *)(0x42621308UL))
#define bFM3_INTREQ_IRQ33MON_MAC1PMI              *((volatile  uint8_t *)(0x42621308UL))

