lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define bFM_INTREQ_IRQ34MON_USB0INT0              *((volatile  uint8_t *)(0x42621380UL))
#define bFM3_INTREQ_IRQ34MON_USB0INT0             *((volatile  uint8_t *)(0x42621380UL))
#define bFM_INTREQ_IRQ34MON_USB0INT1              *((volatile  uint8_t *)(0x42621384UL))
#define bFM3_INTREQ_IRQ34MON_USB0INT1             *((volatile  uint8_t *)(0x42621384UL))
#define bFM_INTREQ_IRQ34MON_USB0INT2              *((volatile  uint8_t *)(0x42621388UL))
#define bFM3_INTREQ_IRQ34MON_USB0INT2             *((volatile  uint8_t *)(0x42621388UL))
#define bFM_INTREQ_IRQ34MON_USB0INT3              *((volatile  uint8_t *)(0x4262138CUL))
#define bFM3_INTREQ_IRQ34MON_USB0INT3             *((volatile  uint8_t *)(0x4262138CUL))
#define bFM_INTREQ_IRQ34MON_USB0INT4              *((volatile  uint8_t *)(0x42621390UL))
#define bFM3_INTREQ_IRQ34MON_USB0INT4             *((volatile  uint8_t *)(0x42621390UL))

#define bFM_INTREQ_IRQ35MON_USB0INT0              *((volatile  uint8_t *)(0x42621400UL))
#define bFM3_INTREQ_IRQ35MON_USB0INT0             *((volatile  uint8_t *)(0x42621400UL))
#define bFM_INTREQ_IRQ35MON_USB0INT1              *((volatile  uint8_t *)(0x42621404UL))
#define bFM3_INTREQ_IRQ35MON_USB0INT1             *((volatile  uint8_t *)(0x42621404UL))
#define bFM_INTREQ_IRQ35MON_USB0INT2              *((volatile  uint8_t *)(0x42621408UL))
#define bFM3_INTREQ_IRQ35MON_USB0INT2             *((volatile  uint8_t *)(0x42621408UL))
#define bFM_INTREQ_IRQ35MON_USB0INT3              *((volatile  uint8_t *)(0x4262140CUL))
#define bFM3_INTREQ_IRQ35MON_USB0INT3             *((volatile  uint8_t *)(0x4262140CUL))
#define bFM_INTREQ_IRQ35MON_USB0INT4              *((volatile  uint8_t *)(0x42621410UL))
#define bFM3_INTREQ_IRQ35MON_USB0INT4             *((volatile  uint8_t *)(0x42621410UL))
#define bFM_INTREQ_IRQ35MON_USB0INT5              *((volatile  uint8_t *)(0x42621414UL))
#define bFM3_INTREQ_IRQ35MON_USB0INT5             *((volatile  uint8_t *)(0x42621414UL))

#define bFM_INTREQ_IRQ36MON_USB1INT0              *((volatile  uint8_t *)(0x42621480UL))
#define bFM3_INTREQ_IRQ36MON_USB1INT0             *((volatile  uint8_t *)(0x42621480UL))
#define bFM_INTREQ_IRQ36MON_USB1INT1              *((volatile  uint8_t *)(0x42621484UL))
#define bFM3_INTREQ_IRQ36MON_USB1INT1             *((volatile  uint8_t *)(0x42621484UL))
#define bFM_INTREQ_IRQ36MON_USB1INT2              *((volatile  uint8_t *)(0x42621488UL))
#define bFM3_INTREQ_IRQ36MON_USB1INT2             *((volatile  uint8_t *)(0x42621488UL))
#define bFM_INTREQ_IRQ36MON_USB1INT3              *((volatile  uint8_t *)(0x4262148CUL))
#define bFM3_INTREQ_IRQ36MON_USB1INT3             *((volatile  uint8_t *)(0x4262148CUL))
#define bFM_INTREQ_IRQ36MON_USB1INT4              *((volatile  uint8_t *)(0x42621490UL))
#define bFM3_INTREQ_IRQ36MON_USB1INT4             *((volatile  uint8_t *)(0x42621490UL))
#define bFM_INTREQ_IRQ36MON_RCEC0INT              *((volatile  uint8_t *)(0x42621494UL))
#define bFM3_INTREQ_IRQ36MON_RCEC0INT             *((volatile  uint8_t *)(0x42621494UL))

#define bFM_INTREQ_IRQ37MON_USB1INT0              *((volatile  uint8_t *)(0x42621500UL))
#define bFM3_INTREQ_IRQ37MON_USB1INT0             *((volatile  uint8_t *)(0x42621500UL))
#define bFM_INTREQ_IRQ37MON_USB1INT1              *((volatile  uint8_t *)(0x42621504UL))
#define bFM3_INTREQ_IRQ37MON_USB1INT1             *((volatile  uint8_t *)(0x42621504UL))
#define bFM_INTREQ_IRQ37MON_USB1INT2              *((volatile  uint8_t *)(0x42621508UL))
#define bFM3_INTREQ_IRQ37MON_USB1INT2             *((volatile  uint8_t *)(0x42621508UL))
#define bFM_INTREQ_IRQ37MON_USB1INT3              *((volatile  uint8_t *)(0x4262150CUL))
#define bFM3_INTREQ_IRQ37MON_USB1INT3             *((volatile  uint8_t *)(0x4262150CUL))
#define bFM_INTREQ_IRQ37MON_USB1INT4              *((volatile  uint8_t *)(0x42621510UL))
#define bFM3_INTREQ_IRQ37MON_USB1INT4             *((volatile  uint8_t *)(0x42621510UL))
#define bFM_INTREQ_IRQ37MON_USB1INT5              *((volatile  uint8_t *)(0x42621514UL))
#define bFM3_INTREQ_IRQ37MON_USB1INT5             *((volatile  uint8_t *)(0x42621514UL))
#define bFM_INTREQ_IRQ37MON_RCEC1INT              *((volatile  uint8_t *)(0x42621518UL))
#define bFM3_INTREQ_IRQ37MON_RCEC1INT             *((volatile  uint8_t *)(0x42621518UL))

#define bFM_INTREQ_IRQ38MON_DMAINT                *((volatile  uint8_t *)(0x42621580UL))
#define bFM3_INTREQ_IRQ38MON_DMAINT               *((volatile  uint8_t *)(0x42621580UL))

#define bFM_INTREQ_IRQ39MON_DMAINT                *((volatile  uint8_t *)(0x42621600UL))
#define bFM3_INTREQ_IRQ39MON_DMAINT               *((volatile  uint8_t *)(0x42621600UL))

#define bFM_INTREQ_IRQ40MON_DMAINT                *((volatile  uint8_t *)(0x42621680UL))
#define bFM3_INTREQ_IRQ40MON_DMAINT               *((volatile  uint8_t *)(0x42621680UL))

#define bFM_INTREQ_IRQ41MON_DMAINT                *((volatile  uint8_t *)(0x42621700UL))
#define bFM3_INTREQ_IRQ41MON_DMAINT               *((volatile  uint8_t *)(0x42621700UL))

#define bFM_INTREQ_IRQ42MON_DMAINT                *((volatile  uint8_t *)(0x42621780UL))
#define bFM3_INTREQ_IRQ42MON_DMAINT               *((volatile  uint8_t *)(0x42621780UL))

#define bFM_INTREQ_IRQ43MON_DMAINT                *((volatile  uint8_t *)(0x42621800UL))
#define bFM3_INTREQ_IRQ43MON_DMAINT               *((volatile  uint8_t *)(0x42621800UL))

#define bFM_INTREQ_IRQ44MON_DMAINT                *((volatile  uint8_t *)(0x42621880UL))
#define bFM3_INTREQ_IRQ44MON_DMAINT               *((volatile  uint8_t *)(0x42621880UL))

#define bFM_INTREQ_IRQ45MON_DMAINT                *((volatile  uint8_t *)(0x42621900UL))
#define bFM3_INTREQ_IRQ45MON_DMAINT               *((volatile  uint8_t *)(0x42621900UL))

#define bFM_INTREQ_IRQ46MON_BTINT0                *((volatile  uint8_t *)(0x42621980UL))
#define bFM3_INTREQ_IRQ46MON_BTINT0               *((volatile  uint8_t *)(0x42621980UL))
#define bFM_INTREQ_IRQ46MON_BTINT1                *((volatile  uint8_t *)(0x42621984UL))
#define bFM3_INTREQ_IRQ46MON_BTINT1               *((volatile  uint8_t *)(0x42621984UL))
#define bFM_INTREQ_IRQ46MON_BTINT2                *((volatile  uint8_t *)(0x42621988UL))
#define bFM3_INTREQ_IRQ46MON_BTINT2               *((volatile  uint8_t *)(0x42621988UL))
#define bFM_INTREQ_IRQ46MON_BTINT3                *((volatile  uint8_t *)(0x4262198CUL))
#define bFM3_INTREQ_IRQ46MON_BTINT3               *((volatile  uint8_t *)(0x4262198CUL))
#define bFM_INTREQ_IRQ46MON_BTINT4                *((volatile  uint8_t *)(0x42621990UL))
#define bFM3_INTREQ_IRQ46MON_BTINT4               *((volatile  uint8_t *)(0x42621990UL))
#define bFM_INTREQ_IRQ46MON_BTINT5                *((volatile  uint8_t *)(0x42621994UL))
#define bFM3_INTREQ_IRQ46MON_BTINT5               *((volatile  uint8_t *)(0x42621994UL))
#define bFM_INTREQ_IRQ46MON_BTINT6                *((volatile  uint8_t *)(0x42621998UL))
#define bFM3_INTREQ_IRQ46MON_BTINT6               *((volatile  uint8_t *)(0x42621998UL))
#define bFM_INTREQ_IRQ46MON_BTINT7                *((volatile  uint8_t *)(0x4262199CUL))
#define bFM3_INTREQ_IRQ46MON_BTINT7               *((volatile  uint8_t *)(0x4262199CUL))
#define bFM_INTREQ_IRQ46MON_BTINT8                *((volatile  uint8_t *)(0x426219A0UL))
#define bFM3_INTREQ_IRQ46MON_BTINT8               *((volatile  uint8_t *)(0x426219A0UL))
#define bFM_INTREQ_IRQ46MON_BTINT9                *((volatile  uint8_t *)(0x426219A4UL))
#define bFM3_INTREQ_IRQ46MON_BTINT9               *((volatile  uint8_t *)(0x426219A4UL))
#define bFM_INTREQ_IRQ46MON_BTINT10               *((volatile  uint8_t *)(0x426219A8UL))
#define bFM3_INTREQ_IRQ46MON_BTINT10              *((volatile  uint8_t *)(0x426219A8UL))
#define bFM_INTREQ_IRQ46MON_BTINT11               *((volatile  uint8_t *)(0x426219ACUL))
#define bFM3_INTREQ_IRQ46MON_BTINT11              *((volatile  uint8_t *)(0x426219ACUL))
#define bFM_INTREQ_IRQ46MON_BTINT12               *((volatile  uint8_t *)(0x426219B0UL))
#define bFM3_INTREQ_IRQ46MON_BTINT12              *((volatile  uint8_t *)(0x426219B0UL))
#define bFM_INTREQ_IRQ46MON_BTINT13               *((volatile  uint8_t *)(0x426219B4UL))
#define bFM3_INTREQ_IRQ46MON_BTINT13              *((volatile  uint8_t *)(0x426219B4UL))
#define bFM_INTREQ_IRQ46MON_BTINT14               *((volatile  uint8_t *)(0x426219B8UL))
#define bFM3_INTREQ_IRQ46MON_BTINT14              *((volatile  uint8_t *)(0x426219B8UL))
#define bFM_INTREQ_IRQ46MON_BTINT15               *((volatile  uint8_t *)(0x426219BCUL))
#define bFM3_INTREQ_IRQ46MON_BTINT15              *((volatile  uint8_t *)(0x426219BCUL))

