lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
/******************************************************************************
 ** MFT Registers MFT0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFT0_ADCMP_ACSB_BDIS0                 *((volatile  uint8_t *)(0x42401700UL))
#define bFM3_MFT0_ADCMP_ACSB_BDIS0                *((volatile  uint8_t *)(0x42401700UL))
#define bFM_MFT0_ADCMP_ACSB_BDIS1                 *((volatile  uint8_t *)(0x42401704UL))
#define bFM3_MFT0_ADCMP_ACSB_BDIS1                *((volatile  uint8_t *)(0x42401704UL))
#define bFM_MFT0_ADCMP_ACSB_BDIS2                 *((volatile  uint8_t *)(0x42401708UL))
#define bFM3_MFT0_ADCMP_ACSB_BDIS2                *((volatile  uint8_t *)(0x42401708UL))
#define bFM_MFT0_ADCMP_ACSB_BTS0                  *((volatile  uint8_t *)(0x42401710UL))
#define bFM3_MFT0_ADCMP_ACSB_BTS0                 *((volatile  uint8_t *)(0x42401710UL))
#define bFM_MFT0_ADCMP_ACSB_BTS1                  *((volatile  uint8_t *)(0x42401714UL))
#define bFM3_MFT0_ADCMP_ACSB_BTS1                 *((volatile  uint8_t *)(0x42401714UL))
#define bFM_MFT0_ADCMP_ACSB_BTS2                  *((volatile  uint8_t *)(0x42401718UL))
#define bFM3_MFT0_ADCMP_ACSB_BTS2                 *((volatile  uint8_t *)(0x42401718UL))

#define bFM_MFT0_FRT_TCSA0_SCLR                   *((volatile  uint8_t *)(0x42400610UL))
#define bFM3_MFT0_FRT_TCSA0_SCLR                  *((volatile  uint8_t *)(0x42400610UL))
#define bFM_MFT0_FRT_TCSA0_MODE                   *((volatile  uint8_t *)(0x42400614UL))
#define bFM3_MFT0_FRT_TCSA0_MODE                  *((volatile  uint8_t *)(0x42400614UL))
#define bFM_MFT0_FRT_TCSA0_STOP                   *((volatile  uint8_t *)(0x42400618UL))
#define bFM3_MFT0_FRT_TCSA0_STOP                  *((volatile  uint8_t *)(0x42400618UL))
#define bFM_MFT0_FRT_TCSA0_BFE                    *((volatile  uint8_t *)(0x4240061CUL))
#define bFM3_MFT0_FRT_TCSA0_BFE                   *((volatile  uint8_t *)(0x4240061CUL))
#define bFM_MFT0_FRT_TCSA0_ICRE                   *((volatile  uint8_t *)(0x42400620UL))
#define bFM3_MFT0_FRT_TCSA0_ICRE                  *((volatile  uint8_t *)(0x42400620UL))
#define bFM_MFT0_FRT_TCSA0_ICLR                   *((volatile  uint8_t *)(0x42400624UL))
#define bFM3_MFT0_FRT_TCSA0_ICLR                  *((volatile  uint8_t *)(0x42400624UL))
#define bFM_MFT0_FRT_TCSA0_IRQZE                  *((volatile  uint8_t *)(0x42400634UL))
#define bFM3_MFT0_FRT_TCSA0_IRQZE                 *((volatile  uint8_t *)(0x42400634UL))
#define bFM_MFT0_FRT_TCSA0_IRQZF                  *((volatile  uint8_t *)(0x42400638UL))
#define bFM3_MFT0_FRT_TCSA0_IRQZF                 *((volatile  uint8_t *)(0x42400638UL))
#define bFM_MFT0_FRT_TCSA0_ECKE                   *((volatile  uint8_t *)(0x4240063CUL))
#define bFM3_MFT0_FRT_TCSA0_ECKE                  *((volatile  uint8_t *)(0x4240063CUL))

#define bFM_MFT0_FRT_TCSA1_SCLR                   *((volatile  uint8_t *)(0x42400810UL))
#define bFM3_MFT0_FRT_TCSA1_SCLR                  *((volatile  uint8_t *)(0x42400810UL))
#define bFM_MFT0_FRT_TCSA1_MODE                   *((volatile  uint8_t *)(0x42400814UL))
#define bFM3_MFT0_FRT_TCSA1_MODE                  *((volatile  uint8_t *)(0x42400814UL))
#define bFM_MFT0_FRT_TCSA1_STOP                   *((volatile  uint8_t *)(0x42400818UL))
#define bFM3_MFT0_FRT_TCSA1_STOP                  *((volatile  uint8_t *)(0x42400818UL))
#define bFM_MFT0_FRT_TCSA1_BFE                    *((volatile  uint8_t *)(0x4240081CUL))
#define bFM3_MFT0_FRT_TCSA1_BFE                   *((volatile  uint8_t *)(0x4240081CUL))
#define bFM_MFT0_FRT_TCSA1_ICRE                   *((volatile  uint8_t *)(0x42400820UL))
#define bFM3_MFT0_FRT_TCSA1_ICRE                  *((volatile  uint8_t *)(0x42400820UL))
#define bFM_MFT0_FRT_TCSA1_ICLR                   *((volatile  uint8_t *)(0x42400824UL))
#define bFM3_MFT0_FRT_TCSA1_ICLR                  *((volatile  uint8_t *)(0x42400824UL))
#define bFM_MFT0_FRT_TCSA1_IRQZE                  *((volatile  uint8_t *)(0x42400834UL))
#define bFM3_MFT0_FRT_TCSA1_IRQZE                 *((volatile  uint8_t *)(0x42400834UL))
#define bFM_MFT0_FRT_TCSA1_IRQZF                  *((volatile  uint8_t *)(0x42400838UL))
#define bFM3_MFT0_FRT_TCSA1_IRQZF                 *((volatile  uint8_t *)(0x42400838UL))
#define bFM_MFT0_FRT_TCSA1_ECKE                   *((volatile  uint8_t *)(0x4240083CUL))
#define bFM3_MFT0_FRT_TCSA1_ECKE                  *((volatile  uint8_t *)(0x4240083CUL))

#define bFM_MFT0_FRT_TCSA2_SCLR                   *((volatile  uint8_t *)(0x42400A10UL))
#define bFM3_MFT0_FRT_TCSA2_SCLR                  *((volatile  uint8_t *)(0x42400A10UL))
#define bFM_MFT0_FRT_TCSA2_MODE                   *((volatile  uint8_t *)(0x42400A14UL))
#define bFM3_MFT0_FRT_TCSA2_MODE                  *((volatile  uint8_t *)(0x42400A14UL))
#define bFM_MFT0_FRT_TCSA2_STOP                   *((volatile  uint8_t *)(0x42400A18UL))
#define bFM3_MFT0_FRT_TCSA2_STOP                  *((volatile  uint8_t *)(0x42400A18UL))
#define bFM_MFT0_FRT_TCSA2_BFE                    *((volatile  uint8_t *)(0x42400A1CUL))
#define bFM3_MFT0_FRT_TCSA2_BFE                   *((volatile  uint8_t *)(0x42400A1CUL))
#define bFM_MFT0_FRT_TCSA2_ICRE                   *((volatile  uint8_t *)(0x42400A20UL))
#define bFM3_MFT0_FRT_TCSA2_ICRE                  *((volatile  uint8_t *)(0x42400A20UL))
#define bFM_MFT0_FRT_TCSA2_ICLR                   *((volatile  uint8_t *)(0x42400A24UL))
#define bFM3_MFT0_FRT_TCSA2_ICLR                  *((volatile  uint8_t *)(0x42400A24UL))
#define bFM_MFT0_FRT_TCSA2_IRQZE                  *((volatile  uint8_t *)(0x42400A34UL))
#define bFM3_MFT0_FRT_TCSA2_IRQZE                 *((volatile  uint8_t *)(0x42400A34UL))
#define bFM_MFT0_FRT_TCSA2_IRQZF                  *((volatile  uint8_t *)(0x42400A38UL))
#define bFM3_MFT0_FRT_TCSA2_IRQZF                 *((volatile  uint8_t *)(0x42400A38UL))
#define bFM_MFT0_FRT_TCSA2_ECKE                   *((volatile  uint8_t *)(0x42400A3CUL))
#define bFM3_MFT0_FRT_TCSA2_ECKE                  *((volatile  uint8_t *)(0x42400A3CUL))

#define bFM_MFT0_FRT_TCSB0_AD0E                   *((volatile  uint8_t *)(0x42400680UL))
#define bFM3_MFT0_FRT_TCSB0_AD0E                  *((volatile  uint8_t *)(0x42400680UL))
#define bFM_MFT0_FRT_TCSB0_AD1E                   *((volatile  uint8_t *)(0x42400684UL))
#define bFM3_MFT0_FRT_TCSB0_AD1E                  *((volatile  uint8_t *)(0x42400684UL))
#define bFM_MFT0_FRT_TCSB0_AD2E                   *((volatile  uint8_t *)(0x42400688UL))
#define bFM3_MFT0_FRT_TCSB0_AD2E                  *((volatile  uint8_t *)(0x42400688UL))

