lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define bFM_MFT0_FRT_TCSB1_AD0E                   *((volatile  uint8_t *)(0x42400880UL))
#define bFM3_MFT0_FRT_TCSB1_AD0E                  *((volatile  uint8_t *)(0x42400880UL))
#define bFM_MFT0_FRT_TCSB1_AD1E                   *((volatile  uint8_t *)(0x42400884UL))
#define bFM3_MFT0_FRT_TCSB1_AD1E                  *((volatile  uint8_t *)(0x42400884UL))
#define bFM_MFT0_FRT_TCSB1_AD2E                   *((volatile  uint8_t *)(0x42400888UL))
#define bFM3_MFT0_FRT_TCSB1_AD2E                  *((volatile  uint8_t *)(0x42400888UL))

#define bFM_MFT0_FRT_TCSB2_AD0E                   *((volatile  uint8_t *)(0x42400A80UL))
#define bFM3_MFT0_FRT_TCSB2_AD0E                  *((volatile  uint8_t *)(0x42400A80UL))
#define bFM_MFT0_FRT_TCSB2_AD1E                   *((volatile  uint8_t *)(0x42400A84UL))
#define bFM3_MFT0_FRT_TCSB2_AD1E                  *((volatile  uint8_t *)(0x42400A84UL))
#define bFM_MFT0_FRT_TCSB2_AD2E                   *((volatile  uint8_t *)(0x42400A88UL))
#define bFM3_MFT0_FRT_TCSB2_AD2E                  *((volatile  uint8_t *)(0x42400A88UL))

#define bFM_MFT0_ICU_ICSA10_ICE0                  *((volatile  uint8_t *)(0x42400F10UL))
#define bFM3_MFT0_ICU_ICSA10_ICE0                 *((volatile  uint8_t *)(0x42400F10UL))
#define bFM_MFT0_ICU_ICSA10_ICE1                  *((volatile  uint8_t *)(0x42400F14UL))
#define bFM3_MFT0_ICU_ICSA10_ICE1                 *((volatile  uint8_t *)(0x42400F14UL))
#define bFM_MFT0_ICU_ICSA10_ICP0                  *((volatile  uint8_t *)(0x42400F18UL))
#define bFM3_MFT0_ICU_ICSA10_ICP0                 *((volatile  uint8_t *)(0x42400F18UL))
#define bFM_MFT0_ICU_ICSA10_ICP1                  *((volatile  uint8_t *)(0x42400F1CUL))
#define bFM3_MFT0_ICU_ICSA10_ICP1                 *((volatile  uint8_t *)(0x42400F1CUL))

#define bFM_MFT0_ICU_ICSA32_ICE2                  *((volatile  uint8_t *)(0x42400F90UL))
#define bFM3_MFT0_ICU_ICSA32_ICE2                 *((volatile  uint8_t *)(0x42400F90UL))
#define bFM_MFT0_ICU_ICSA32_ICE3                  *((volatile  uint8_t *)(0x42400F94UL))
#define bFM3_MFT0_ICU_ICSA32_ICE3                 *((volatile  uint8_t *)(0x42400F94UL))
#define bFM_MFT0_ICU_ICSA32_ICP2                  *((volatile  uint8_t *)(0x42400F98UL))
#define bFM3_MFT0_ICU_ICSA32_ICP2                 *((volatile  uint8_t *)(0x42400F98UL))
#define bFM_MFT0_ICU_ICSA32_ICP3                  *((volatile  uint8_t *)(0x42400F9CUL))
#define bFM3_MFT0_ICU_ICSA32_ICP3                 *((volatile  uint8_t *)(0x42400F9CUL))

#define bFM_MFT0_ICU_ICSB10_IEI0                  *((volatile  uint8_t *)(0x42400F20UL))
#define bFM3_MFT0_ICU_ICSB10_IEI0                 *((volatile  uint8_t *)(0x42400F20UL))
#define bFM_MFT0_ICU_ICSB10_IEI1                  *((volatile  uint8_t *)(0x42400F24UL))
#define bFM3_MFT0_ICU_ICSB10_IEI1                 *((volatile  uint8_t *)(0x42400F24UL))

#define bFM_MFT0_ICU_ICSB32_IEI2                  *((volatile  uint8_t *)(0x42400FA0UL))
#define bFM3_MFT0_ICU_ICSB32_IEI2                 *((volatile  uint8_t *)(0x42400FA0UL))
#define bFM_MFT0_ICU_ICSB32_IEI3                  *((volatile  uint8_t *)(0x42400FA4UL))
#define bFM3_MFT0_ICU_ICSB32_IEI3                 *((volatile  uint8_t *)(0x42400FA4UL))

#define bFM_MFT0_OCU_OCSA10_CST0                  *((volatile  uint8_t *)(0x42400300UL))
#define bFM3_MFT0_OCU_OCSA10_CST0                 *((volatile  uint8_t *)(0x42400300UL))
#define bFM_MFT0_OCU_OCSA10_CST1                  *((volatile  uint8_t *)(0x42400304UL))
#define bFM3_MFT0_OCU_OCSA10_CST1                 *((volatile  uint8_t *)(0x42400304UL))
#define bFM_MFT0_OCU_OCSA10_BDIS0                 *((volatile  uint8_t *)(0x42400308UL))
#define bFM3_MFT0_OCU_OCSA10_BDIS0                *((volatile  uint8_t *)(0x42400308UL))
#define bFM_MFT0_OCU_OCSA10_BDIS1                 *((volatile  uint8_t *)(0x4240030CUL))
#define bFM3_MFT0_OCU_OCSA10_BDIS1                *((volatile  uint8_t *)(0x4240030CUL))
#define bFM_MFT0_OCU_OCSA10_IOE0                  *((volatile  uint8_t *)(0x42400310UL))
#define bFM3_MFT0_OCU_OCSA10_IOE0                 *((volatile  uint8_t *)(0x42400310UL))
#define bFM_MFT0_OCU_OCSA10_IOE1                  *((volatile  uint8_t *)(0x42400314UL))
#define bFM3_MFT0_OCU_OCSA10_IOE1                 *((volatile  uint8_t *)(0x42400314UL))
#define bFM_MFT0_OCU_OCSA10_IOP0                  *((volatile  uint8_t *)(0x42400318UL))
#define bFM3_MFT0_OCU_OCSA10_IOP0                 *((volatile  uint8_t *)(0x42400318UL))
#define bFM_MFT0_OCU_OCSA10_IOP1                  *((volatile  uint8_t *)(0x4240031CUL))
#define bFM3_MFT0_OCU_OCSA10_IOP1                 *((volatile  uint8_t *)(0x4240031CUL))

#define bFM_MFT0_OCU_OCSA32_CST2                  *((volatile  uint8_t *)(0x42400380UL))
#define bFM3_MFT0_OCU_OCSA32_CST2                 *((volatile  uint8_t *)(0x42400380UL))
#define bFM_MFT0_OCU_OCSA32_CST3                  *((volatile  uint8_t *)(0x42400384UL))
#define bFM3_MFT0_OCU_OCSA32_CST3                 *((volatile  uint8_t *)(0x42400384UL))
#define bFM_MFT0_OCU_OCSA32_BDIS2                 *((volatile  uint8_t *)(0x42400388UL))
#define bFM3_MFT0_OCU_OCSA32_BDIS2                *((volatile  uint8_t *)(0x42400388UL))
#define bFM_MFT0_OCU_OCSA32_BDIS3                 *((volatile  uint8_t *)(0x4240038CUL))
#define bFM3_MFT0_OCU_OCSA32_BDIS3                *((volatile  uint8_t *)(0x4240038CUL))
#define bFM_MFT0_OCU_OCSA32_IOE2                  *((volatile  uint8_t *)(0x42400390UL))
#define bFM3_MFT0_OCU_OCSA32_IOE2                 *((volatile  uint8_t *)(0x42400390UL))
#define bFM_MFT0_OCU_OCSA32_IOE3                  *((volatile  uint8_t *)(0x42400394UL))
#define bFM3_MFT0_OCU_OCSA32_IOE3                 *((volatile  uint8_t *)(0x42400394UL))
#define bFM_MFT0_OCU_OCSA32_IOP2                  *((volatile  uint8_t *)(0x42400398UL))
#define bFM3_MFT0_OCU_OCSA32_IOP2                 *((volatile  uint8_t *)(0x42400398UL))
#define bFM_MFT0_OCU_OCSA32_IOP3                  *((volatile  uint8_t *)(0x4240039CUL))
#define bFM3_MFT0_OCU_OCSA32_IOP3                 *((volatile  uint8_t *)(0x4240039CUL))

#define bFM_MFT0_OCU_OCSA54_CST4                  *((volatile  uint8_t *)(0x42400400UL))
#define bFM3_MFT0_OCU_OCSA54_CST4                 *((volatile  uint8_t *)(0x42400400UL))
#define bFM_MFT0_OCU_OCSA54_CST5                  *((volatile  uint8_t *)(0x42400404UL))
#define bFM3_MFT0_OCU_OCSA54_CST5                 *((volatile  uint8_t *)(0x42400404UL))
#define bFM_MFT0_OCU_OCSA54_BDIS4                 *((volatile  uint8_t *)(0x42400408UL))
#define bFM3_MFT0_OCU_OCSA54_BDIS4                *((volatile  uint8_t *)(0x42400408UL))
#define bFM_MFT0_OCU_OCSA54_BDIS5                 *((volatile  uint8_t *)(0x4240040CUL))
#define bFM3_MFT0_OCU_OCSA54_BDIS5                *((volatile  uint8_t *)(0x4240040CUL))
#define bFM_MFT0_OCU_OCSA54_IOE4                  *((volatile  uint8_t *)(0x42400410UL))
#define bFM3_MFT0_OCU_OCSA54_IOE4                 *((volatile  uint8_t *)(0x42400410UL))
#define bFM_MFT0_OCU_OCSA54_IOE5                  *((volatile  uint8_t *)(0x42400414UL))
#define bFM3_MFT0_OCU_OCSA54_IOE5                 *((volatile  uint8_t *)(0x42400414UL))
#define bFM_MFT0_OCU_OCSA54_IOP4                  *((volatile  uint8_t *)(0x42400418UL))
#define bFM3_MFT0_OCU_OCSA54_IOP4                 *((volatile  uint8_t *)(0x42400418UL))
#define bFM_MFT0_OCU_OCSA54_IOP5                  *((volatile  uint8_t *)(0x4240041CUL))
#define bFM3_MFT0_OCU_OCSA54_IOP5                 *((volatile  uint8_t *)(0x4240041CUL))

#define bFM_MFT0_OCU_OCSB10_OTD0                  *((volatile  uint8_t *)(0x42400320UL))
#define bFM3_MFT0_OCU_OCSB10_OTD0                 *((volatile  uint8_t *)(0x42400320UL))
#define bFM_MFT0_OCU_OCSB10_OTD1                  *((volatile  uint8_t *)(0x42400324UL))
#define bFM3_MFT0_OCU_OCSB10_OTD1                 *((volatile  uint8_t *)(0x42400324UL))
#define bFM_MFT0_OCU_OCSB10_CMOD                  *((volatile  uint8_t *)(0x42400330UL))
#define bFM3_MFT0_OCU_OCSB10_CMOD                 *((volatile  uint8_t *)(0x42400330UL))
#define bFM_MFT0_OCU_OCSB10_BTS0                  *((volatile  uint8_t *)(0x42400334UL))
#define bFM3_MFT0_OCU_OCSB10_BTS0                 *((volatile  uint8_t *)(0x42400334UL))
#define bFM_MFT0_OCU_OCSB10_BTS1                  *((volatile  uint8_t *)(0x42400338UL))
#define bFM3_MFT0_OCU_OCSB10_BTS1                 *((volatile  uint8_t *)(0x42400338UL))

#define bFM_MFT0_OCU_OCSB32_OTD2                  *((volatile  uint8_t *)(0x424003A0UL))
#define bFM3_MFT0_OCU_OCSB32_OTD2                 *((volatile  uint8_t *)(0x424003A0UL))
#define bFM_MFT0_OCU_OCSB32_OTD3                  *((volatile  uint8_t *)(0x424003A4UL))
#define bFM3_MFT0_OCU_OCSB32_OTD3                 *((volatile  uint8_t *)(0x424003A4UL))
#define bFM_MFT0_OCU_OCSB32_CMOD                  *((volatile  uint8_t *)(0x424003B0UL))
#define bFM3_MFT0_OCU_OCSB32_CMOD                 *((volatile  uint8_t *)(0x424003B0UL))
#define bFM_MFT0_OCU_OCSB32_BTS2                  *((volatile  uint8_t *)(0x424003B4UL))
#define bFM3_MFT0_OCU_OCSB32_BTS2                 *((volatile  uint8_t *)(0x424003B4UL))
#define bFM_MFT0_OCU_OCSB32_BTS3                  *((volatile  uint8_t *)(0x424003B8UL))
#define bFM3_MFT0_OCU_OCSB32_BTS3                 *((volatile  uint8_t *)(0x424003B8UL))

#define bFM_MFT0_OCU_OCSB54_OTD4                  *((volatile  uint8_t *)(0x42400420UL))
#define bFM3_MFT0_OCU_OCSB54_OTD4                 *((volatile  uint8_t *)(0x42400420UL))
#define bFM_MFT0_OCU_OCSB54_OTD5                  *((volatile  uint8_t *)(0x42400424UL))
#define bFM3_MFT0_OCU_OCSB54_OTD5                 *((volatile  uint8_t *)(0x42400424UL))
#define bFM_MFT0_OCU_OCSB54_CMOD                  *((volatile  uint8_t *)(0x42400430UL))
#define bFM3_MFT0_OCU_OCSB54_CMOD                 *((volatile  uint8_t *)(0x42400430UL))
#define bFM_MFT0_OCU_OCSB54_BTS4                  *((volatile  uint8_t *)(0x42400434UL))
#define bFM3_MFT0_OCU_OCSB54_BTS4                 *((volatile  uint8_t *)(0x42400434UL))
#define bFM_MFT0_OCU_OCSB54_BTS5                  *((volatile  uint8_t *)(0x42400438UL))
#define bFM3_MFT0_OCU_OCSB54_BTS5                 *((volatile  uint8_t *)(0x42400438UL))

#define bFM_MFT0_OCU_OCSC_MOD0                    *((volatile  uint8_t *)(0x424004A0UL))
#define bFM3_MFT0_OCU_OCSC_MOD0                   *((volatile  uint8_t *)(0x424004A0UL))
#define bFM_MFT0_OCU_OCSC_MOD1                    *((volatile  uint8_t *)(0x424004A4UL))
#define bFM3_MFT0_OCU_OCSC_MOD1                   *((volatile  uint8_t *)(0x424004A4UL))
#define bFM_MFT0_OCU_OCSC_MOD2                    *((volatile  uint8_t *)(0x424004A8UL))
#define bFM3_MFT0_OCU_OCSC_MOD2                   *((volatile  uint8_t *)(0x424004A8UL))
#define bFM_MFT0_OCU_OCSC_MOD3                    *((volatile  uint8_t *)(0x424004ACUL))
#define bFM3_MFT0_OCU_OCSC_MOD3                   *((volatile  uint8_t *)(0x424004ACUL))
#define bFM_MFT0_OCU_OCSC_MOD4                    *((volatile  uint8_t *)(0x424004B0UL))
#define bFM3_MFT0_OCU_OCSC_MOD4                   *((volatile  uint8_t *)(0x424004B0UL))
#define bFM_MFT0_OCU_OCSC_MOD5                    *((volatile  uint8_t *)(0x424004B4UL))
#define bFM3_MFT0_OCU_OCSC_MOD5                   *((volatile  uint8_t *)(0x424004B4UL))

#define bFM_MFT0_WFG_NZCL_DTIEA                   *((volatile  uint16_t*)(0x42401380UL))
#define bFM3_MFT0_WFG_NZCL_DTIEA                  *((volatile  uint16_t*)(0x42401380UL))
#define bFM_MFT0_WFG_NZCL_SDTI                    *((volatile  uint16_t*)(0x42401390UL))
#define bFM3_MFT0_WFG_NZCL_SDTI                   *((volatile  uint16_t*)(0x42401390UL))

#define bFM_MFT0_WFG_WFIR_DTIFA                   *((volatile  uint16_t*)(0x42401300UL))
#define bFM3_MFT0_WFG_WFIR_DTIFA                  *((volatile  uint16_t*)(0x42401300UL))
#define bFM_MFT0_WFG_WFIR_DTICA                   *((volatile  uint16_t*)(0x42401304UL))
#define bFM3_MFT0_WFG_WFIR_DTICA                  *((volatile  uint16_t*)(0x42401304UL))
#define bFM_MFT0_WFG_WFIR_TMIF10                  *((volatile  uint16_t*)(0x42401310UL))
#define bFM3_MFT0_WFG_WFIR_TMIF10                 *((volatile  uint16_t*)(0x42401310UL))
#define bFM_MFT0_WFG_WFIR_TMIC10                  *((volatile  uint16_t*)(0x42401314UL))
#define bFM3_MFT0_WFG_WFIR_TMIC10                 *((volatile  uint16_t*)(0x42401314UL))
#define bFM_MFT0_WFG_WFIR_TMIE10                  *((volatile  uint16_t*)(0x42401318UL))
#define bFM3_MFT0_WFG_WFIR_TMIE10                 *((volatile  uint16_t*)(0x42401318UL))
#define bFM_MFT0_WFG_WFIR_TMIS10                  *((volatile  uint16_t*)(0x4240131CUL))
#define bFM3_MFT0_WFG_WFIR_TMIS10                 *((volatile  uint16_t*)(0x4240131CUL))
#define bFM_MFT0_WFG_WFIR_TMIF32                  *((volatile  uint16_t*)(0x42401320UL))
#define bFM3_MFT0_WFG_WFIR_TMIF32                 *((volatile  uint16_t*)(0x42401320UL))
#define bFM_MFT0_WFG_WFIR_TMIC32                  *((volatile  uint16_t*)(0x42401324UL))
#define bFM3_MFT0_WFG_WFIR_TMIC32                 *((volatile  uint16_t*)(0x42401324UL))
#define bFM_MFT0_WFG_WFIR_TMIE32                  *((volatile  uint16_t*)(0x42401328UL))
#define bFM3_MFT0_WFG_WFIR_TMIE32                 *((volatile  uint16_t*)(0x42401328UL))
#define bFM_MFT0_WFG_WFIR_TMIS32                  *((volatile  uint16_t*)(0x4240132CUL))
#define bFM3_MFT0_WFG_WFIR_TMIS32                 *((volatile  uint16_t*)(0x4240132CUL))
#define bFM_MFT0_WFG_WFIR_TMIF54                  *((volatile  uint16_t*)(0x42401330UL))
#define bFM3_MFT0_WFG_WFIR_TMIF54                 *((volatile  uint16_t*)(0x42401330UL))
#define bFM_MFT0_WFG_WFIR_TMIC54                  *((volatile  uint16_t*)(0x42401334UL))
#define bFM3_MFT0_WFG_WFIR_TMIC54                 *((volatile  uint16_t*)(0x42401334UL))
#define bFM_MFT0_WFG_WFIR_TMIE54                  *((volatile  uint16_t*)(0x42401338UL))
#define bFM3_MFT0_WFG_WFIR_TMIE54                 *((volatile  uint16_t*)(0x42401338UL))
#define bFM_MFT0_WFG_WFIR_TMIS54                  *((volatile  uint16_t*)(0x4240133CUL))
#define bFM3_MFT0_WFG_WFIR_TMIS54                 *((volatile  uint16_t*)(0x4240133CUL))

