lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define bFM_MFT0_WFG_WFSA10_DMOD                  *((volatile  uint16_t*)(0x424011B0UL))
#define bFM3_MFT0_WFG_WFSA10_DMOD                 *((volatile  uint16_t*)(0x424011B0UL))

#define bFM_MFT0_WFG_WFSA32_DMOD                  *((volatile  uint16_t*)(0x42401230UL))
#define bFM3_MFT0_WFG_WFSA32_DMOD                 *((volatile  uint16_t*)(0x42401230UL))

#define bFM_MFT0_WFG_WFSA54_DMOD                  *((volatile  uint16_t*)(0x424012B0UL))
#define bFM3_MFT0_WFG_WFSA54_DMOD                 *((volatile  uint16_t*)(0x424012B0UL))


/******************************************************************************
 ** QPRC Registers QPRC0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_QPRC0_QCR_PSTP                        *((volatile  uint8_t *)(0x424C0310UL))
#define bFM3_QPRC0_QCR_PSTP                       *((volatile  uint8_t *)(0x424C0310UL))
#define bFM_QPRC0_QCR_CGSC                        *((volatile  uint8_t *)(0x424C0314UL))
#define bFM3_QPRC0_QCR_CGSC                       *((volatile  uint8_t *)(0x424C0314UL))
#define bFM_QPRC0_QCR_RSEL                        *((volatile  uint8_t *)(0x424C0318UL))
#define bFM3_QPRC0_QCR_RSEL                       *((volatile  uint8_t *)(0x424C0318UL))
#define bFM_QPRC0_QCR_SWAP                        *((volatile  uint8_t *)(0x424C031CUL))
#define bFM3_QPRC0_QCR_SWAP                       *((volatile  uint8_t *)(0x424C031CUL))

#define bFM_QPRC0_QECR_ORNGMD                     *((volatile  uint8_t *)(0x424C0380UL))
#define bFM3_QPRC0_QECR_ORNGMD                    *((volatile  uint8_t *)(0x424C0380UL))
#define bFM_QPRC0_QECR_ORNGF                      *((volatile  uint8_t *)(0x424C0384UL))
#define bFM3_QPRC0_QECR_ORNGF                     *((volatile  uint8_t *)(0x424C0384UL))
#define bFM_QPRC0_QECR_ORNGIE                     *((volatile  uint8_t *)(0x424C0388UL))
#define bFM3_QPRC0_QECR_ORNGIE                    *((volatile  uint8_t *)(0x424C0388UL))

#define bFM_QPRC0_QICRH_CDCIE                     *((volatile  uint8_t *)(0x424C02A0UL))
#define bFM3_QPRC0_QICRH_CDCIE                    *((volatile  uint8_t *)(0x424C02A0UL))
#define bFM_QPRC0_QICRH_CDCF                      *((volatile  uint8_t *)(0x424C02A4UL))
#define bFM3_QPRC0_QICRH_CDCF                     *((volatile  uint8_t *)(0x424C02A4UL))
#define bFM_QPRC0_QICRH_DIRPC                     *((volatile  uint8_t *)(0x424C02A8UL))
#define bFM3_QPRC0_QICRH_DIRPC                    *((volatile  uint8_t *)(0x424C02A8UL))
#define bFM_QPRC0_QICRH_DIROU                     *((volatile  uint8_t *)(0x424C02ACUL))
#define bFM3_QPRC0_QICRH_DIROU                    *((volatile  uint8_t *)(0x424C02ACUL))
#define bFM_QPRC0_QICRH_QPCNRCMIE                 *((volatile  uint8_t *)(0x424C02B0UL))
#define bFM3_QPRC0_QICRH_QPCNRCMIE                *((volatile  uint8_t *)(0x424C02B0UL))
#define bFM_QPRC0_QICRH_QPCNRCMF                  *((volatile  uint8_t *)(0x424C02B4UL))
#define bFM3_QPRC0_QICRH_QPCNRCMF                 *((volatile  uint8_t *)(0x424C02B4UL))

#define bFM_QPRC0_QICRL_QPCMIE                    *((volatile  uint8_t *)(0x424C0280UL))
#define bFM3_QPRC0_QICRL_QPCMIE                   *((volatile  uint8_t *)(0x424C0280UL))
#define bFM_QPRC0_QICRL_QPCMF                     *((volatile  uint8_t *)(0x424C0284UL))
#define bFM3_QPRC0_QICRL_QPCMF                    *((volatile  uint8_t *)(0x424C0284UL))
#define bFM_QPRC0_QICRL_QPRCMIE                   *((volatile  uint8_t *)(0x424C0288UL))
#define bFM3_QPRC0_QICRL_QPRCMIE                  *((volatile  uint8_t *)(0x424C0288UL))
#define bFM_QPRC0_QICRL_QPRCMF                    *((volatile  uint8_t *)(0x424C028CUL))
#define bFM3_QPRC0_QICRL_QPRCMF                   *((volatile  uint8_t *)(0x424C028CUL))
#define bFM_QPRC0_QICRL_OUZIE                     *((volatile  uint8_t *)(0x424C0290UL))
#define bFM3_QPRC0_QICRL_OUZIE                    *((volatile  uint8_t *)(0x424C0290UL))
#define bFM_QPRC0_QICRL_UFDF                      *((volatile  uint8_t *)(0x424C0294UL))
#define bFM3_QPRC0_QICRL_UFDF                     *((volatile  uint8_t *)(0x424C0294UL))
#define bFM_QPRC0_QICRL_OFDF                      *((volatile  uint8_t *)(0x424C0298UL))
#define bFM3_QPRC0_QICRL_OFDF                     *((volatile  uint8_t *)(0x424C0298UL))
#define bFM_QPRC0_QICRL_ZIIF                      *((volatile  uint8_t *)(0x424C029CUL))
#define bFM3_QPRC0_QICRL_ZIIF                     *((volatile  uint8_t *)(0x424C029CUL))


/******************************************************************************
 ** RTC Registers RTC
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_RTC_ALMOR_TAMO0                       *((volatile  uint8_t *)(0x42760330UL))
#define bFM3_RTC_ALMOR_TAMO0                      *((volatile  uint8_t *)(0x42760330UL))

#define bFM_RTC_WTBR_BR0                          *((volatile  uint8_t *)(0x42760100UL))
#define bFM3_RTC_WTBR_BR0                         *((volatile  uint8_t *)(0x42760100UL))
#define bFM_RTC_WTBR_BR1                          *((volatile  uint8_t *)(0x42760104UL))
#define bFM3_RTC_WTBR_BR1                         *((volatile  uint8_t *)(0x42760104UL))
#define bFM_RTC_WTBR_BR2                          *((volatile  uint8_t *)(0x42760108UL))
#define bFM3_RTC_WTBR_BR2                         *((volatile  uint8_t *)(0x42760108UL))
#define bFM_RTC_WTBR_BR3                          *((volatile  uint8_t *)(0x4276010CUL))
#define bFM3_RTC_WTBR_BR3                         *((volatile  uint8_t *)(0x4276010CUL))
#define bFM_RTC_WTBR_BR4                          *((volatile  uint8_t *)(0x42760110UL))
#define bFM3_RTC_WTBR_BR4                         *((volatile  uint8_t *)(0x42760110UL))
#define bFM_RTC_WTBR_BR5                          *((volatile  uint8_t *)(0x42760114UL))
#define bFM3_RTC_WTBR_BR5                         *((volatile  uint8_t *)(0x42760114UL))
#define bFM_RTC_WTBR_BR6                          *((volatile  uint8_t *)(0x42760118UL))
#define bFM3_RTC_WTBR_BR6                         *((volatile  uint8_t *)(0x42760118UL))
#define bFM_RTC_WTBR_BR7                          *((volatile  uint8_t *)(0x4276011CUL))
#define bFM3_RTC_WTBR_BR7                         *((volatile  uint8_t *)(0x4276011CUL))
#define bFM_RTC_WTBR_BR8                          *((volatile  uint8_t *)(0x42760120UL))
#define bFM3_RTC_WTBR_BR8                         *((volatile  uint8_t *)(0x42760120UL))
#define bFM_RTC_WTBR_BR9                          *((volatile  uint8_t *)(0x42760124UL))
#define bFM3_RTC_WTBR_BR9                         *((volatile  uint8_t *)(0x42760124UL))
#define bFM_RTC_WTBR_BR10                         *((volatile  uint8_t *)(0x42760128UL))
#define bFM3_RTC_WTBR_BR10                        *((volatile  uint8_t *)(0x42760128UL))
#define bFM_RTC_WTBR_BR11                         *((volatile  uint8_t *)(0x4276012CUL))
#define bFM3_RTC_WTBR_BR11                        *((volatile  uint8_t *)(0x4276012CUL))
#define bFM_RTC_WTBR_BR12                         *((volatile  uint8_t *)(0x42760130UL))
#define bFM3_RTC_WTBR_BR12                        *((volatile  uint8_t *)(0x42760130UL))
#define bFM_RTC_WTBR_BR13                         *((volatile  uint8_t *)(0x42760134UL))
#define bFM3_RTC_WTBR_BR13                        *((volatile  uint8_t *)(0x42760134UL))
#define bFM_RTC_WTBR_BR14                         *((volatile  uint8_t *)(0x42760138UL))
#define bFM3_RTC_WTBR_BR14                        *((volatile  uint8_t *)(0x42760138UL))
#define bFM_RTC_WTBR_BR15                         *((volatile  uint8_t *)(0x4276013CUL))
#define bFM3_RTC_WTBR_BR15                        *((volatile  uint8_t *)(0x4276013CUL))
#define bFM_RTC_WTBR_BR16                         *((volatile  uint8_t *)(0x42760140UL))
#define bFM3_RTC_WTBR_BR16                        *((volatile  uint8_t *)(0x42760140UL))
#define bFM_RTC_WTBR_BR17                         *((volatile  uint8_t *)(0x42760144UL))
#define bFM3_RTC_WTBR_BR17                        *((volatile  uint8_t *)(0x42760144UL))
#define bFM_RTC_WTBR_BR18                         *((volatile  uint8_t *)(0x42760148UL))
#define bFM3_RTC_WTBR_BR18                        *((volatile  uint8_t *)(0x42760148UL))
#define bFM_RTC_WTBR_BR19                         *((volatile  uint8_t *)(0x4276014CUL))
#define bFM3_RTC_WTBR_BR19                        *((volatile  uint8_t *)(0x4276014CUL))
#define bFM_RTC_WTBR_BR20                         *((volatile  uint8_t *)(0x42760150UL))
#define bFM3_RTC_WTBR_BR20                        *((volatile  uint8_t *)(0x42760150UL))
#define bFM_RTC_WTBR_BR21                         *((volatile  uint8_t *)(0x42760154UL))
#define bFM3_RTC_WTBR_BR21                        *((volatile  uint8_t *)(0x42760154UL))
#define bFM_RTC_WTBR_BR22                         *((volatile  uint8_t *)(0x42760158UL))
#define bFM3_RTC_WTBR_BR22                        *((volatile  uint8_t *)(0x42760158UL))
#define bFM_RTC_WTBR_BR23                         *((volatile  uint8_t *)(0x4276015CUL))
#define bFM3_RTC_WTBR_BR23                        *((volatile  uint8_t *)(0x4276015CUL))

