lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
#define bFM_RTC_WTCALEN_WTCALEN                   *((volatile  uint8_t *)(0x427604A0UL))
#define bFM3_RTC_WTCALEN_WTCALEN                  *((volatile  uint8_t *)(0x427604A0UL))

#define bFM_RTC_WTCLKS_WTCLKS                     *((volatile  uint8_t *)(0x42760400UL))
#define bFM3_RTC_WTCLKS_WTCLKS                    *((volatile  uint8_t *)(0x42760400UL))

#define bFM_RTC_WTCR1_ST                          *((volatile  uint8_t *)(0x42760000UL))
#define bFM3_RTC_WTCR1_ST                         *((volatile  uint8_t *)(0x42760000UL))
#define bFM_RTC_WTCR1_RUN                         *((volatile  uint8_t *)(0x42760008UL))
#define bFM3_RTC_WTCR1_RUN                        *((volatile  uint8_t *)(0x42760008UL))
#define bFM_RTC_WTCR1_SRST                        *((volatile  uint8_t *)(0x4276000CUL))
#define bFM3_RTC_WTCR1_SRST                       *((volatile  uint8_t *)(0x4276000CUL))
#define bFM_RTC_WTCR1_SCST                        *((volatile  uint8_t *)(0x42760010UL))
#define bFM3_RTC_WTCR1_SCST                       *((volatile  uint8_t *)(0x42760010UL))
#define bFM_RTC_WTCR1_SCRST                       *((volatile  uint8_t *)(0x42760014UL))
#define bFM3_RTC_WTCR1_SCRST                      *((volatile  uint8_t *)(0x42760014UL))
#define bFM_RTC_WTCR1_BUSY                        *((volatile  uint8_t *)(0x42760018UL))
#define bFM3_RTC_WTCR1_BUSY                       *((volatile  uint8_t *)(0x42760018UL))
#define bFM_RTC_WTCR1_MIEN                        *((volatile  uint8_t *)(0x42760020UL))
#define bFM3_RTC_WTCR1_MIEN                       *((volatile  uint8_t *)(0x42760020UL))
#define bFM_RTC_WTCR1_HEN                         *((volatile  uint8_t *)(0x42760024UL))
#define bFM3_RTC_WTCR1_HEN                        *((volatile  uint8_t *)(0x42760024UL))
#define bFM_RTC_WTCR1_DEN                         *((volatile  uint8_t *)(0x42760028UL))
#define bFM3_RTC_WTCR1_DEN                        *((volatile  uint8_t *)(0x42760028UL))
#define bFM_RTC_WTCR1_MOEN                        *((volatile  uint8_t *)(0x4276002CUL))
#define bFM3_RTC_WTCR1_MOEN                       *((volatile  uint8_t *)(0x4276002CUL))
#define bFM_RTC_WTCR1_YEN                         *((volatile  uint8_t *)(0x42760030UL))
#define bFM3_RTC_WTCR1_YEN                        *((volatile  uint8_t *)(0x42760030UL))
#define bFM_RTC_WTCR1_INTSSI                      *((volatile  uint8_t *)(0x42760040UL))
#define bFM3_RTC_WTCR1_INTSSI                     *((volatile  uint8_t *)(0x42760040UL))
#define bFM_RTC_WTCR1_INTSI                       *((volatile  uint8_t *)(0x42760044UL))
#define bFM3_RTC_WTCR1_INTSI                      *((volatile  uint8_t *)(0x42760044UL))
#define bFM_RTC_WTCR1_INTMI                       *((volatile  uint8_t *)(0x42760048UL))
#define bFM3_RTC_WTCR1_INTMI                      *((volatile  uint8_t *)(0x42760048UL))
#define bFM_RTC_WTCR1_INTHI                       *((volatile  uint8_t *)(0x4276004CUL))
#define bFM3_RTC_WTCR1_INTHI                      *((volatile  uint8_t *)(0x4276004CUL))
#define bFM_RTC_WTCR1_INTTMI                      *((volatile  uint8_t *)(0x42760050UL))
#define bFM3_RTC_WTCR1_INTTMI                     *((volatile  uint8_t *)(0x42760050UL))
#define bFM_RTC_WTCR1_INTALI                      *((volatile  uint8_t *)(0x42760054UL))
#define bFM3_RTC_WTCR1_INTALI                     *((volatile  uint8_t *)(0x42760054UL))
#define bFM_RTC_WTCR1_INTERI                      *((volatile  uint8_t *)(0x42760058UL))
#define bFM3_RTC_WTCR1_INTERI                     *((volatile  uint8_t *)(0x42760058UL))
#define bFM_RTC_WTCR1_INTCRI                      *((volatile  uint8_t *)(0x4276005CUL))
#define bFM3_RTC_WTCR1_INTCRI                     *((volatile  uint8_t *)(0x4276005CUL))
#define bFM_RTC_WTCR1_INTSSIE                     *((volatile  uint8_t *)(0x42760060UL))
#define bFM3_RTC_WTCR1_INTSSIE                    *((volatile  uint8_t *)(0x42760060UL))
#define bFM_RTC_WTCR1_INTSIE                      *((volatile  uint8_t *)(0x42760064UL))
#define bFM3_RTC_WTCR1_INTSIE                     *((volatile  uint8_t *)(0x42760064UL))
#define bFM_RTC_WTCR1_INTMIE                      *((volatile  uint8_t *)(0x42760068UL))
#define bFM3_RTC_WTCR1_INTMIE                     *((volatile  uint8_t *)(0x42760068UL))
#define bFM_RTC_WTCR1_INTHIE                      *((volatile  uint8_t *)(0x4276006CUL))
#define bFM3_RTC_WTCR1_INTHIE                     *((volatile  uint8_t *)(0x4276006CUL))
#define bFM_RTC_WTCR1_INTTMIE                     *((volatile  uint8_t *)(0x42760070UL))
#define bFM3_RTC_WTCR1_INTTMIE                    *((volatile  uint8_t *)(0x42760070UL))
#define bFM_RTC_WTCR1_INTALIE                     *((volatile  uint8_t *)(0x42760074UL))
#define bFM3_RTC_WTCR1_INTALIE                    *((volatile  uint8_t *)(0x42760074UL))
#define bFM_RTC_WTCR1_INTERIE                     *((volatile  uint8_t *)(0x42760078UL))
#define bFM3_RTC_WTCR1_INTERIE                    *((volatile  uint8_t *)(0x42760078UL))
#define bFM_RTC_WTCR1_INTCRIE                     *((volatile  uint8_t *)(0x4276007CUL))
#define bFM3_RTC_WTCR1_INTCRIE                    *((volatile  uint8_t *)(0x4276007CUL))

#define bFM_RTC_WTCR2_CREAD                       *((volatile  uint8_t *)(0x42760080UL))
#define bFM3_RTC_WTCR2_CREAD                      *((volatile  uint8_t *)(0x42760080UL))
#define bFM_RTC_WTCR2_TMST                        *((volatile  uint8_t *)(0x427600A0UL))
#define bFM3_RTC_WTCR2_TMST                       *((volatile  uint8_t *)(0x427600A0UL))
#define bFM_RTC_WTCR2_TMEN                        *((volatile  uint8_t *)(0x427600A4UL))
#define bFM3_RTC_WTCR2_TMEN                       *((volatile  uint8_t *)(0x427600A4UL))
#define bFM_RTC_WTCR2_TMRUN                       *((volatile  uint8_t *)(0x427600A8UL))
#define bFM3_RTC_WTCR2_TMRUN                      *((volatile  uint8_t *)(0x427600A8UL))

#define bFM_RTC_WTDIVEN_WTDIVEN                   *((volatile  uint8_t *)(0x42760520UL))
#define bFM3_RTC_WTDIVEN_WTDIVEN                  *((volatile  uint8_t *)(0x42760520UL))
#define bFM_RTC_WTDIVEN_WTDIVRDY                  *((volatile  uint8_t *)(0x42760524UL))
#define bFM3_RTC_WTDIVEN_WTDIVRDY                 *((volatile  uint8_t *)(0x42760524UL))

#define bFM_RTC_WTMOR_TMO0                        *((volatile  uint8_t *)(0x42760230UL))
#define bFM3_RTC_WTMOR_TMO0                       *((volatile  uint8_t *)(0x42760230UL))


