lucatib/mb9af312k/mb9af31xk_usb_pdl/common/mb9af31xk.h
/******************************************************************************
 ** WC Registers WC
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_WC_CLK_EN_CLK_EN                      *((volatile  uint8_t *)(0x42740280UL))
#define bFM3_WC_CLK_EN_CLK_EN                     *((volatile  uint8_t *)(0x42740280UL))
#define bFM_WC_CLK_EN_CLK_EN_R                    *((volatile  uint8_t *)(0x42740284UL))
#define bFM3_WC_CLK_EN_CLK_EN_R                   *((volatile  uint8_t *)(0x42740284UL))

#define bFM_WC_CLK_SEL_SEL_IN                     *((volatile  uint8_t *)(0x42740200UL))
#define bFM3_WC_CLK_SEL_SEL_IN                    *((volatile  uint8_t *)(0x42740200UL))
#define bFM_WC_CLK_SEL_SEL_OUT                    *((volatile  uint8_t *)(0x42740220UL))
#define bFM3_WC_CLK_SEL_SEL_OUT                   *((volatile  uint8_t *)(0x42740220UL))

#define bFM_WC_WCCR_WCIF                          *((volatile  uint8_t *)(0x42740040UL))
#define bFM3_WC_WCCR_WCIF                         *((volatile  uint8_t *)(0x42740040UL))
#define bFM_WC_WCCR_WCIE                          *((volatile  uint8_t *)(0x42740044UL))
#define bFM3_WC_WCCR_WCIE                         *((volatile  uint8_t *)(0x42740044UL))
#define bFM_WC_WCCR_WCOP                          *((volatile  uint8_t *)(0x42740058UL))
#define bFM3_WC_WCCR_WCOP                         *((volatile  uint8_t *)(0x42740058UL))
#define bFM_WC_WCCR_WCEN                          *((volatile  uint8_t *)(0x4274005CUL))
#define bFM3_WC_WCCR_WCEN                         *((volatile  uint8_t *)(0x4274005CUL))


/******************************************************************************
 ** WORKFLASH_IF Registers WORKFLASH_IF
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_WORKFLASH_IF_WFASZR_ASZ               *((volatile  uint8_t *)(0x23C00000UL))
#define bFM3_WORKFLASH_IF_WFASZR_ASZ              *((volatile  uint8_t *)(0x23C00000UL))

#define bFM_WORKFLASH_IF_WFSTR_RDY                *((volatile  uint8_t *)(0x23C00100UL))
#define bFM3_WORKFLASH_IF_WFSTR_RDY               *((volatile  uint8_t *)(0x23C00100UL))
#define bFM_WORKFLASH_IF_WFSTR_HNG                *((volatile  uint8_t *)(0x23C00104UL))
#define bFM3_WORKFLASH_IF_WFSTR_HNG               *((volatile  uint8_t *)(0x23C00104UL))


#if defined __cplusplus
}
#endif

#endif /* _MB9AF31XK_H_ */
